[{
        "name": "ලසිත් මාලිංග",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 226 ලකුණු 567, විස්සයි විස්ස තරග 83 ලකුණු 136, ටෙස්ට් තරග 30 ලකුණු 275, IPL තරග 122 ලකුණු 88",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 226 කඩුලු 338, විස්සයි විස්ස 83 තරග කඩුලු 107, ටෙස්ට් තරග 30 කඩුලු 101, IPL තරග 122 කඩුලු 170",
        "ball_rank": "විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 77",
        "bat_rank": "",
        "bio": "ශ්‍රී ලංකාවේ ගාලු නගරයේ දී උපත ලැබීය. ලසිත් මාලිංග රත්ගම ප්‍රදේශයේ සාමාන්‍ය පවුලක හැදී වැඩිණ.නිතරම ඔහු ක්‍රිකට් ක්‍රීඩාව ප්‍රිය කළේය. ක්‍රිකට් ක්‍රීඩාව ගැන එතරම් තැකීමක් නොතිබුණ තම ගම තුළ පාරවල්වල සහ පොල් වතුවල යහළුවන් සමඟ බොහෝ විට ඔහු සෙල්ලම් කරන ලදී. ඔහු ගාල්ලේ විද්‍යාලෝක සහ මහින්ද යන පාසල්වල ඉගනුම ලැබීය. මෙහිදී හිටපු ක්‍රිකට් ක්‍රීඩක චම්පක රාමනායක විසින් ඔහුගේ දක්ෂතා හඳුනාගන්නා ලදී. මාලිංගගේ දක්ෂතාවයන් ගැන බොහෝ සතුටට පත් ඔහු මාලිංගට ආරාධනා කළේ ලංකා ක්‍රිකට් පදනමට සහභාගී වන ලෙසය",
        "teams": "ශ්‍රී  ලංකාව, බස්නාහිර, BCCSL ඇකඩමි XI, ගාල්ල ක්‍රිකට්, ගාල්ල ග්ලැඩියේටර්ස්, ගයානා ඇමසන් වොරියර්ස්, ජැමෙයිකාවේ තල්ලාවාස්, මහනුවර",
        "career_info": "මාලිංග 2004 ජූලි 17 වනදා ශ්‍රී ලංකාව එක්සත් අරාබි එමීර් රාජ්‍යයට එරෙහිව දඹුල්ලේ දී ක්‍රීඩා කළ තරඟයේ දී ප්‍රථම වරට ජාත්‍යන්තර තරඟ බිමට පිහිටියේය. ඔහුගේ පළමු ක්‍රිකට් තරඟයට ඔහු සහභාගී වූයේ 2004 ජුලි මස 1 සිට 3 වනදා දක්වා “ඩාර්විනස් මරාරා ඕවල්” හි දීය. බොහෝ ඉක්මණින් ඔහු සාර්ථක භාවයට පත්වූයේ විකට් 6ක් ලබා ගැනීමෙනි. 2007 ලෝක ක්‍රිකට් කුසලානය අතරතුර දී මාලිංග වඩාත් සුප්‍රසිද්ධ විය. එයට හේතුව වූයේ පිට පිට යවන ලද පන්දු 4ක් තුළ දී කඩුළු 4ක් ලබා ගැනීමට සමත් වූ ලොව ප්‍රථම හා එකම ක්‍රීඩකයා බවට පත් වෙමිනි. මොහු මෙම දස්කම සිදු කරන ලද්දේ 2007 වසරේ මාර්තු මස 28 වනදා දකුණු අප්‍රිකාවට ‍එරෙහිවය. එය ලෝක කුසලාන ඉතිහාසයේ පස්වන කඩුළු ත්‍රිත්වය වූ අතර ශ්‍රී ලංකාව තුන් වැන්න ද ODI ඉතිහාසයේ 24 වැන්න ද විය"
    },
    {
        "name": "රංජිත් ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 3 ලකුණු 47",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "එඩ්වඩ් රංජිත් ප්‍රනාන්දු (උපත 22 පෙබරවාරි 1944 දිනදී ශ්‍රී ලංකාවේ, කොළඹදී) 1960 දී , කොළඹ ශාන්ත බෙනඩික්ට් විද්‍යාලයෙහි, පළමු පෙළ පාසැල් ක්‍රිකට් කණ්ඩායම සඳහා ක්‍රීඩා කිරීම ඇරඹූ අතර, පාසැල් ක්‍රිකට් ක්‍රීඩකයෙකු ලෙසින් එකල පෙරමුණ ගෙන සිටි අතර හොඳම කඩුළු රකින්නා-පිතිකරුවන් අතරින් එක් අයෙකු විය. 1964දී වසරෙහි පාසැල් ක්‍රිකට් ක්‍රීඩකයා ලෙසින් ඔහු තීරණය කෙරිණි",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "එඩ්වඩ් රංජිත් ප්‍රනාන්දු යනු, 1975 ක්‍රිකට් ලෝක කුසලාන තුලදී, එදිජා තුනක ක්‍රීඩා කල සහ, ඒවායෙහිදී කඩුළු-රකින්නා සහ ආරම්භක පිතිකරු ලෙසින් ක්‍රීඩා කල, හිටපු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි"
    },
    {
        "name": "ඩේවිඩ් හයින්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 3",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පීටර් ඩේවිඩ් හයින් (උපත ජූනි 26, 1945, කොළඹ)",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "පීටර් ඩේවිඩ් හයින්  යනු, 1966 සිට 1976 අතර නිලනොවන ටෙස්ට් තරග 18 ක් සහ, 1975 ලෝක කුසලානයෙහිදී එදිජා තරග දෙකක් තුල ක්‍රීඩා කල හිටපු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. හයින් ප්‍රසිද්ධත්වයක් දරන්නේ, ශ්‍රී ලංකාව මෙතෙක් නියෝජනය කල හොඳම කවර් පොයින්ට් පන්දු රකින්නන් අතුරින් එක් අයෙකු ලෙසිනි"
    },
    {
        "name": "අනුර රණසිංහ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 6 ලකුණු 9, ටෙස්ට් තරග 4 ලකුණු 41",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 6 කඩුලු 9, ටෙස්ට් තරග 4 කඩුලු 7",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "අනුර නන්දන රණසිංහ (ඉංග්‍රීසි: Anura Ranasinghe) (13 ඔක්තොම්බර 1956, කළුතර – 9 නොවැම්බර 1998, කොළඹ) යනු, ජාත්‍යන්තර මට්ටමෙහිදී ශ්‍රී ලංකාව 11 වරක් නියෝජනය කල ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි.  කොළඹ. නාලන්ද විද්‍යාලය වෙනුවෙන් ඔහු පළමුවෙන් ක්‍රිකට් ක්‍රීඩා කරද්දී, 1974-75 ක්‍රිකට් තරග වාරය සඳහා, රණසිංහ විසින් හොඳම පාසැල් ක්‍රිකට් ක්‍රීඩකයා සම්මානය දිනා ගන්නා ලදි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "කණ්ඩායම සඳහා ඔහු සිය මංගලාවතරණය සිදු කලේ 1975 ලෝක කුසලාන වෙතින් වන අතර, එහිදී ඔහු ශී ලංකාව වෙනුවෙන් තරග තුන සඳහාම ක්‍රීඩා කරමින්, ඉනිම තුනෙහිම ලකුණු 19 පමණක් රැස් කල අතර පන්දු වාර දහයක් තුලදී ලකුණු 65 රැස් කිරීමට ඉඩ දුනි."
    },
    {
        "name": "අජිත් ද සිල්වා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 153, ටෙස්ට් තරග 2 ලකුණු 88",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 9 කඩුලු 2, ටෙස්ට් තරග 2 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ගිනිගල්ගොඩගේ රම්බා අජිත් ද සිල්වා (උපත 12 දෙසැම්බර් 1952, ශ්‍රී ලංකාවේ, අම්බලන්ගොඩදී) යනු, හිටපු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ටෙස්ට් තරග හතරකදී සහ එදිජා හයකදී, නිරවද්‍ය වමතින් මඳ වේග දඟ පන්දු යවමින්, ශ්‍රී ලංකාව වෙනුවෙන් ඔහු ක්‍රීඩා කලේය. 1982/83 දී, කැරළිකාර ඇරෝසා ශ්‍රී ලංකා කණ්ඩායම සමගින් දකුණු අප්‍රිකාව වෙත තරග සංචාරයට ඔහු සහභාගි වන තෙක්, වසර ගණනාවක් තිස්සේ ජාතික ක්‍රිකට් සංචිතයෙහි වැදගත් සාමාජිකයෙක් බවට ප්‍රත්‍යක්ෂව තිබුණි."
    },
    {
        "name": "අර්ජුන රණතුංග",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 269 ලකුණු 7456, ටෙස්ට් තරග 93 ලකුණු 5103",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 269 කඩුලු 79, ටෙස්ට් තරග 93 කඩුලු 16",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1963 දෙසැම්බර් 01 වන දා උපත ලැබු අර්ජුන රණතුංග ආරම්භක අවදියේදී ක්‍රිකට් ක්‍රීඩකයෙකු වු අතර වර්තමානය වන විට දේශපාලනඥයෙකු වෙයි.ශ්‍රී ලංකාව තුළ ක්‍රිකට් ක්‍රිඩාව ආශ්‍රිත කටයුතු පාලනය කරන ප්‍රධාන ආයතනය වන ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ප්‍රධානියා වශයෙන්ද හෙතෙම කටයුතු කර ඇත. අර්ජුන රණතුංග උපත ලැබුයේ කොළඹින් සැතපුම් 20 ක් පමණ උතුරු දෙසින් පිහිටා තිබෙන ගම්පහ නගරයේදී වේ",
        "teams": "ශ්‍රී  ලංකාව, සිංහල ක්‍රීඩා සමාජය",
        "career_info": "වමත් පිතිකරුවෙකු සහ ප්‍රයෝජනවත් දකුණත් මදවේග පන්දු යවන්නෙකු වන අර්ජුණ 1981 වසරේදී තම ප්‍රථම පළමු පෙළ ක්‍රිකට් තරඟයට සහභාගි වු අතර ඒ වන විට ඔහුගේ වයස අවුරුදු 18 ක් විය. මින් වසරක් පසු ඔහු ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායමේ මංගල ටෙස්ට් තරඟයට සහභාගි වීමේ අවස්ථාව හිමිකරගන්නා අතර එම තරගයේදී ශ්‍රී ලංකාව සදහා වාර්තා වු පළමු අර්ධ ශතකය ද ඔහු විසින් වාර්ථා කරන ලදී."
    },
    {
        "name": "අරවින්ද ද සිල්වා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 308 ලකුණු 9284, ටෙස්ට් තරග 93 ලකුණු 6361",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 308 කඩුලු 106, ටෙස්ට් තරග 93 කඩුලු 29",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පින්නදුවගේ අරවින්ද ද සිල්වා 1965 ඔක්තෝබර් 17 වන දින කොළඹ දී උපත ලැබීය. ශ්‍රී ලංකා මාතාවට ගෞරවය ගෙන දුන් අති මහත් දක්ෂතා රැසක් හිමි කරගත් අනගිභවනීය ක්‍රීඩකයකු ලෙස ඔහුව හැඳින්විය හැකිය.",
        "teams": "ශ්‍රී  ලංකාව, නොන්ඩෙස්ක්‍රිප්ට්ස් ක්‍රිකට් සමාජය, කෙන්ට්, ඕක්ලන්ඩ්",
        "career_info": "අරවින්ද ද සිල්වාගේ ටෙස්ට් , ක්‍රිකට් දිවිය ආරම්භවන්නේ 1984 එංගලන්තයේ “ලෝඩ්ස්” ක්‍රීඩා පිටියෙනි. ක්‍රිකට් දිවියේ මුල් අවධියේ දී ඔහුව හඳුනාගනු ලැබුවේ පන්දුවට දැවැන්තව පහර දෙන නමුත් අස්තිර පිතිකරුවකු ලෙසිණි. 1995 එංගලන්තයේ කෙන්ට්හි ක්‍රීඩා කළ සාර්ථක පළමු පෙළේ තරඟාවලියකින් පසු ඔහුගේ ක්‍රිකට් දිවියේ සැබෑ පරිවර්තනයක් සිදුවිය. 1996 ලෝක කුසලාන තරඟාවලියේ ඔහු ජයග්‍රාහී බල කණුවක් වූයේ සිය විජයග්‍රාහී ශතකය හා විකට් තුනක් ලබාගෙන ඕස්ට්‍රේලියා‍වට එරෙහිව හොඳම ක්‍රීඩකයා වීමෙනි."
    },
    {
        "name": "අසංක ගුරුසිංහ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 147 ලකුණු 3902, ටෙස්ට් තරග 41 ලකුණු 2452",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 147 කඩුලු 26, ටෙස්ට් තරග 41 කඩුලු 20",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "දේශබන්ධු අසංක ගුරුසිංහ නාලන්දා විද්‍යාලය, කොළඹහි ආදි සිසුවෙකි. 1982 සිට 1985 දක්වා අසංක කොලඹ නාලන්ද විද්‍යාලයේ ජේෂ්ට ක්‍රිකට් පිලේ ක්‍රීඞා කල අතර 1985 දී නාලන්දා නායකයාවිය. අසංක වසර 1985 දී ඔබ්සර්ව බාටා හොඳම පාසැල් ක්‍රිකට් ක්‍රීඞකයාට හිමි සම්මානය ලබාගත්තාය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "දේශබන්ධු අසංක ගුරුසිංහ (ඉංග්‍රීසි: Asanka Gurusinha) (උපත 1966 සැප්තැම්බර් 16 , කොළඹ දි) ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායම නියෝජනය කළ දක්ෂ ක්‍රිකට් ක්‍රීඩකයෙකි. වමතින් පන්දුවට පහර​දෙන අසංක ගුරුසිංහ වමත් පිතිකරුවන් අතර ඉතා ඉහළින් වැජඹුන ක්‍රීඩකයෙකි. 1996 වර්ෂයේ ලෝක කුසලාන ක්‍රිකට් තරඟාවලිය දිනවිමට දායක විය. අසංක වර්තමාන ශ්‍රී ලංකා ක්‍රිකට්‌ කළමනාකරු, ජාතික ක්‍රිකට් තේරීම් කමිටු සාමාජිකද වෙයි."
    },
    {
        "name": "දොන් අනුරසිරි",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 45 ලකුණු 62, ටෙස්ට් තරග 18 ලකුණු 91",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 45 කඩුලු 32, ටෙස්ට් තරග 18 කඩුලු 41",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සංගරංගේ දොන් අනුරසිරි (උපත 25 පෙබරවාරි 1966, පානදුර) යනු, 1986 සිට 1998 දක්වා, ටෙස්ට් තරග 18 ක සහ එදිජා 45 ක තරග කල හිටපු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. වමතින් ඕර්තඩොක්ස් දඟ පන්දු යවන්නෙකු වූ ඔහු, ජාතික කණ්ඩායමෙහි විටින් විට ක්‍රීඩා කලේය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "වයස අවුරුදු 20 ක් වත්ම ඔහුගේ ටෙස්ට් මංගලාවතරණය සිදු වූයේ 1986 මාර්තු 14 දිනදී පකිස්තානයට එරෙහිව කොළඹ පැවැති තරගයකදීය. බලාපොරොත්තුනොවූ ආකාරයකට මෙම තරගය කඩුළු අටකින් ජය ගැනීමට ශ්‍රී ලංකාව සමත්වූ අතර, ඔහු මෙහිදී යැවුවේ පන්දු වාර සතරක් පමණි. ඔහු ක්‍රීඩා කල ටෙස්ට් තරග 18 තුලදී කිසිවිටෙක ඉනිමකදී කඩුළු පහක් ලබා ගැනීමට අසමත්වූ අතර බොහෝවිට උදවු ලබා නොදෙන කඩුලු මතදී පිතිකරුවන්හට රිසිසේ ලකුණු රැස් කිරීමට නොදී සීමා කිරීමට හේ සමත් විය. ඔහුගේ හොඳම තරගාවලිය වූයේ, 1992-93 තුලදී සංචාරක ඕස්ට්‍රේලියානුවන්ට එරෙහිව වන අතර, එහිදී හේ කඩුලු 10 ක් දවාලීය."
    },
    {
        "name": "රොෂාන් මහානාම",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 213 ලකුණු 5162, ටෙස්ට් තරග 52 ලකුණු 2576",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 213 කඩුලු 0, ටෙස්ට් තරග 52 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "දේශබන්ධු රොෂාන් මහානාම (ඉංග්‍රීසි: Roshan Mahanama) යනු හිටපු ශ්‍රී ලංකා ජාත්‍යන්තර එක්දින ක්‍රිකට් නායක හා වර්තමාන ජ්‍යාත්‍යන්තර ක්‍රිකට් කවුන්සල එලය්ට් පැනල් විනිසුරු වරයෙකි. රොෂාන් නාලන්දා විද්‍යාලය නියෝජනය කරමින් පාසල් මට්ටමින් ක්‍රිකට් ක්‍රීඩා කිරීමට පටන් ගත් අතර ඔහුගේ පාසල් ක්‍රිකට් කණ්ඩායමේ නායකත්වයට පත් විය. ඔහු ඉතා ඉක්මනින් ජනප්‍රිය පාසල් ශිෂ්‍ය ක්‍රිකට් ක්‍රීඩකයෙකු ලෙස ඉහළට නැගුනේ වාර්ෂික මහා තරඟයේදී අතිමූලික ප්‍රතිවාදී ආනන්ද විද්‍යාලයට එරෙහිව නොදැවී ලකුණු 145 ක් රැස් කරමිනි. පාසල් ක්‍රිකට් ක්‍රීඩාවේදී ඔහු දැක්වූ දස්කම් හේතුවෙන් 1983 සහ 1984 දී වසර දෙකක කාලයක් සඳහා ඔබ්සර්වර් වසරේ පාසල් ශිෂ්‍ය ක්‍රිකට් සම්මානයෙන් පිදුම් ලැබීය.",
        "teams": "ශ්‍රී  ලංකාව, කොළඹ ක්‍රිකට් සමාජය",
        "career_info": "2015 සැප්තැම්බර් මාසයේදී මහානාම පැවසුවේ වසර අවසානයේදී අයිසීසී තරග තීරක මණ්ඩලයෙන් ඉවත් වන බවයි. ඔහු තම පවුල සහ ව්‍යාපාර සමඟ කාලය ගත කරනු ඇත. ඔහු ජාත්‍යන්තර ක්‍රිකට් පිටියේ හොඳම තරග තීරකවරයෙක් ලෙස සැලකෙන අතර ඔහුගේ ක්‍රීඩා කාලය තුළදී ඔහු හොඳම පන්දු රකින්නෙකු ලෙස ද සැලකේ. රොෂාන් මහානාම 1980 ගණන් වල අග භාගයේ සහ 1990 දශකයේ මුල් භාගයේදී අරවින්ද ද සිල්වාගේ නායකත්වය යටතේ ආකර්ෂණීය ආරම්භක පිතිකරුවෙකු ලෙස ස්ථාපිත විය. "
    },
    {
        "name": "චමරි අතපත්තු",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 84 ලකුණු 2625, විස්සයි විස්ස තරග 85 ලකුණු 1646",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 84 කඩුලු 23, විස්සයි විස්ස 85 තරග කඩුලු 26",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 62, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 56",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 16, විස්සයි විස්ස පිතිකරණ ස්ථානය 14",
        "bio": "අතපත්තු මුදියන්සේලාගේ චමරි ජයංගනී (උපත 1990 පෙබරවාරි 9, චමරි අතපත්තු ලෙසද හැඳින්වේ) යනු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩිකාවක් වන අතර ශ්‍රී ලංකාවේ කාන්තා විස්සයි 20 ජාත්‍යන්තර කණ්ඩායමේ වත්මන් නායිකාව වේ. ඇය ශ්‍රී ලංකා කාන්තා කණ්ඩායමේ නායිකාව ලෙස කෙටි කාලයක් කටයුතු කළ අතර, ඇයගෙන් පසු නායිකා වූයේ ශෂිකලා සිරිවර්ධන ය.",
        "teams": "ශ්‍රී  ලංකාව, මෙල්බර්න් රෙනේගේඩ්ස්, යෝක්ෂයර් දියමන්ති, පර්ත් ස්කොචර්ස්",
        "career_info": "ඇය ඉහළ පෙළේ ආක්‍රමණශීලී පිතිකරණය සඳහා ප්‍රසිද්ධය. 2013 කාන්තා ක්‍රිකට් ලෝක කුසලානයේදී අතපත්තු එංගලන්ත කාන්තා කණ්ඩායමට එරෙහිව වේගවත් ශතකයක් වාර්තා කළ අතර එහිදී එම තරඟය ජයග්‍රහණය කළේ ශ්‍රී ලංකා කාන්තා කණ්ඩායමයි. ඇයගේ නායකත්වය යටතේ පාකිස්තාන කාන්තා කණ්ඩායම සමඟ පැවති T20 තරඟාවලිය ජයග්‍රහණය කිරීමට ශ්‍රී ලංකා කාන්තාවන් සමත් වුනා. එක්දින ශතකයක් වාර්තා කළ එකම ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩිකාව ද ඇය වන අතර, ඇයගේ වෘත්තීය දිවියේ පස් වතාවක් මෙය සිදු කළාය. ඇය සිය මංගල එක්දින ශතකය වාර්තා කළේ 2011 අප්‍රේල් 28 දින අයර්ලන්තයට එරෙහිව ය."
    },
    {
        "name": "ශෂිකලා සිරිවර්ධන",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 118 ලකුණු 2029, විස්සයි විස්ස තරග 81 ලකුණු 1097",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 118 කඩුලු 124, විස්සයි විස්ස 81 තරග කඩුලු 77",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ශෂිකලා සිරිවර්ධන ලෙස හැඳින්වෙන හෙට්ටිමුල්ල අප්පුහාමිලාගේ ශෂිකලා දේදුණු සිරිවර්ධන (උපත 1985 පෙබරවාරි 14, ශ්‍රී ලංකාවේ කොළඹ), WODI වල ශ්‍රී ලංකා කාන්තා ක්‍රිකට් කණ්ඩායමේ නායිකාව ලෙස කටයුතු කළ ශ්‍රී ලංකාවේ හිටපු ක්‍රිකට් ක්‍රීඩිකාවකි. ශ්‍රී ලංකාව වෙනුවෙන් WODI හි කඩුලු 100 ක් ලබා ගත් එකම ක්‍රිකට් ක්‍රීඩිකාව ඇය වන අතර එමඟින් මෙය ලකුණු 1000+ සමඟ එකතු කළ එකම ශ්‍රී ලාංකික කාන්තාවයි. ඩබ්ලිව්ටී 20 අයි හිදී කඩුලු 77 ක් බිඳ හෙලූ ශ්‍රී ලංකාව වෙනුවෙන් වැඩිම කඩුලු ලාභියා ද වේ. 2003 සිට 2020 දක්වා වසර 17 ක් පමණ වූ වෘත්තීය ජීවිතය තුළ ඇය ජාත්‍යන්තරව ශ්‍රී ලංකාව වෙනුවෙන් ක්‍රීඩා කළාය.",
        "teams": "ශ්‍රී  ලංකාව, ශ්‍රී ලංකා නාවික හමුදාව ",
        "career_info": "සිරිවර්ධන 2002 දී ජාතික සංචිතයට තේරී පත්වීමෙන් පසු වයස අවුරුදු 18 දී 2003 මාර්තු මාසයේදී කිංග්ස්ටවුන්හිදී, බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව ශාන්ත වින්සන්ට් හිදී සිය එක්දින මංගල දර්ශනය ආරම්භ කළාය. ඇය 2-20 ක් ලබා ගත් අතර එම තරඟයේදී වේගවත් 29 ක් ලබා ගත්තාය. ශ්‍රී ලාංකිකයින් විසින් දිනා ගන්නා ලදි. ඇයගේ ජාත්‍යන්තර ආරම්භය සිදු වූයේ 2006 වන තුරු ශ්‍රී ලංකාවේ කාන්තා ක්‍රිකට් ශ්‍රී ලංකා ක්‍රිකට් පාලක මණ්ඩලය යටතේ නොතිබූ අවස්ථාවක ය."
    },
    {
        "name": "ඉනෝකා රණවීර",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 59 ලකුණු 156, විස්සයි විස්ස තරග 43 ලකුණු 27",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 59 කඩුලු 63, විස්සයි විස්ස 43 තරග කඩුලු 41",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 32, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 24",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 97",
        "bio": "ඉනෝකා රණවීර (උපත 1986 පෙබරවාරි 18) යනු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් සහ හිටපු එක්දින ජාත්‍යන්තර (එක්දින) නායකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඇය ශ්‍රී ලංකා ජාතික කණ්ඩායම වෙනුවෙන් එක්දින සහ විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) මට්ටමින් ක්‍රීඩා කර ඇත. 2015 නොවැම්බරයේදී නවසීලන්තයට එරෙහිව පැවති එක්දින තරඟයකදී ඉනිමේ අවසන් පන්දු තුනෙන් කඩුලු 3 ක් දවාගත් ඇය එක්දින කඩුලු ත්රිත්වයක් ලබාගත් පළමු ශ්රී ලාංකික කාන්තාව බවට පත්විය. 2016 සහ 2017 දී වසරේ හොඳම කාන්තා එක්දින පන්දු යවන්නිය සඳහා වූ ශ්‍රී ලංකා ක්‍රිකට් සම්මානය ඇය දිනාගෙන ඇත. 2021 ඔක්තෝම්බර් මාසයේදී සිම්බාබ්වේ හි පැවැත්වෙන 2021 කාන්තා ක්‍රිකට් ලෝක කුසලාන සුදුසුකම් ලැබීමේ තරඟාවලිය සඳහා ඇය ශ්‍රී ලංකා කණ්ඩායමේ නම් කරන ලදී."
    },
    {
        "name": "ඩිලානි මනෝදර",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 92 ලකුණු 1363, විස්සයි විස්ස තරග 62 ලකුණු 752",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 57, විස්සයි විස්ස පිතිකරණ ස්ථානය 74",
        "bio": "ඩිලානි මනෝදර ලෙස හැඳින්වෙන මනෝදාරා ආචාරිගේ දොන් ඩිලානි සුරංගිකා (උපත 1982 දෙසැම්බර් 8) ජාත්‍යන්තර තරග 139 කට ක්‍රීඩා කර ඇති ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩිකාවකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "කාන්තා එක්දින තරඟ වලදී ශ්‍රී ලංකාව වෙනුවෙන් වැඩිම කඩුලු රකින ක්‍රීඩිකාවන් ලෙස දැවී යාමේ වාර්තාව ඇය සතුයි. මනෝදර 2014 ආසියානු ක්‍රීඩා ලෝකඩ පදක්කම් ලාභී කණ්ඩායමේ සාමාජිකයෙකි. 2018 ඔක්තෝම්බර් මාසයේදී ඇය බටහිර ඉන්දීය කොදෙව්හි පැවති 2018 අයිසීසී කාන්තා ලෝක විස්සයි 20 තරඟාවලිය සඳහා වූ ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී. 2020 ජනවාරි මාසයේදී ඇය ඕස්ට්‍රේලියාවේ පැවැත්වෙන 2020 අයිසීසී කාන්තා විස්සයි 20 ලෝක කුසලානය සඳහා වන ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී"
    },
    {
        "name": "එෂානි කෞශල්‍ය",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 89 ලකුණු 1219, විස්සයි විස්ස තරග 68 ලකුණු 780",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 89 කඩුලු 49, විස්සයි විස්ස තරග 68 කඩුලු 36",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 59, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 51",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 61, විස්සයි විස්ස පිතිකරණ ස්ථානය 37",
        "bio": "එෂානි කෞශල්‍ය (1984 ජූනි 1 දින උපත ලද ඊෂානි ලොකුසූරියගේ ලෙසද හැඳින්වේ) ශ්‍රී ලංකා ජාතික කාන්තා ක්‍රිකට් කණ්ඩායම සඳහා ක්‍රීඩා කරන ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩිකාවකි. තුන් ඉරියව් ක්‍රීඩිකාවක වන ඇය දකුණත් පිතිකරුවෙකු මෙන්ම දකුණත් මැද වේග පන්දු යවන්නියකි",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2005 කාන්තා ක්‍රිකට් ලෝක කුසලානයේදී ලකුණු 7 ක් ලබා ගනිමින් කෞශල්‍ය ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල දර්ශනය ආරම්භ කළාය. බටහිර ඉන්දීය කොදෙව් ජුලියානා නීරෝගේ කකුල කඩුල්ලට පෙර සිරකරමින් තරගාවලිය අතරතුරදී ඇය සිය පළමු ජාත්‍යන්තර කඩුල්ල ලබා ගත්තාය. 2006 කාන්තා ආසියානු කුසලාන ක්‍රිකට් තරගාවලියේදී ඇය ශ්‍රී ලංකාව වෙනුවෙන් හොඳින් පිතිකරණයේ යෙදුන අතර, තම රට වෙනුවෙන් පිතිකරණ සාමාන්‍යයන්හි ඉහළින්ම සිටි අතර, 35.33 කදී ලකුණු 106 ක් ලබා ගත් අතර, ඇයගේ වෘත්තීය දිවියේ ඉහළම ලකුණු 57 ද ඇතුළත් ය."
    },
    {
        "name": "චාමනි රෝෂිණී සෙනෙවිරත්න",
        "gender": "කාන්තා",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 80 ලකුණු 832, විස්සයි විස්ස තරග 48 ලකුණු 334",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 80 කඩුලු 72, විස්සයි විස්ස තරග 48 කඩුලු 45",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "චාමනි රෝෂිණී සෙනෙවිරත්න (උපත 1978 නොවැම්බර් 14 අනුරාධපුරයේ) ශ්‍රී ලාංකික -එමිරාති ක්‍රිකට් ක්‍රීඩිකාවකි. 1998 අප්‍රේල් මාසයේදී පාකිස්ථානයට එරෙහිව නොදැවී ලකුණු 105 ක් රැස් කළ ඇය කාන්තා ටෙස්ට් ක්‍රිකට් ක්‍රීඩාවේදී ශ්‍රී ලංකාවේ එකම ශතකය වාර්තා කළාය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඇය එය ඇගේ මංගල දිවියේදීම කළාය. මංගල තරගයේදීම ටෙස්ට් ශතකයක් වාර්තා කිරීමෙන් ඇය මංගල තරගයේදී ටෙස්ට් ශතකයක් ලබා ගත් අටවන ක්‍රීඩිකාව බවට පත්විය. ශ්‍රී ලංකා ක්‍රිකට් ඉතිහාසයේ චාමණි සෙනෙවිරත්නගේ ශතකය වාර්තා කිරීමෙන් පසුව ශ්‍රී ලංකා පිරිමි ජාතික ක්‍රිකට් කණ්ඩායම මෙන්ම ශ්‍රී ලංකා කාන්තා ක්‍රිකට් කණ්ඩායම ද ප්‍රථම වරට ටෙස්ට් ශතක ලාභීන් බවට පත් වූහ, පිළිවෙලින් බ්‍රෙන්ඩන් කුරුප්පු සහ සෙනෙවිරත්න තුන් ඉරියව් ක්‍රීඩිකාවක් වන ඇය ශ්‍රී ලංකාව වෙනුවෙන් එක් ටෙස්ට් තරගයක් සහ එක්දින ජාත්‍යන්තර තරග 47 කට ක්‍රීඩා කර තිබේ."
    },
    {
        "name": "චරිත් අසලංක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 8 ලකුණු 326, විස්සයි විස්ස තරග 1 ලකුණු 44",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 8 කඩුලු 1, විස්සයි විස්ස තරග 1 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කාරියවසම් ඉන්දිපාලගේ චරිත් අසලංක (උපත 1997 ජූනි 29) ජාතික කණ්ඩායම සඳහා සීමිත ජාත්‍යන්තර තරඟ ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. වමත් පිතිකරුවෙකු වන අසලංක 2021 ජුනි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය.",
        "teams": "ශ්‍රී  ලංකාව, යාපනය ස්ටැලියන්ස්",
        "career_info": "2021 ජූනි මාසයේදී අසලංක සිය එංගලන්ත සංචාරය සඳහා වූ ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී. ඔහු සිය එක්දින ජාත්‍යන්තර (එක්දින) මංගල තරඟය 2021 ජුනි 29 දින එංගලන්තයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් කළේය. [24] 2021 ජූලි මාසයේදී ඔහු ඉන්දියාවට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා වන ශ්‍රී ලංකා සංචිතයේ නම් කරන ලදී. 2021 ජූලි 19 දින අසලංක ඉන්දියාවට එරෙහිව මංගල එක්දින ශතකය වාර්තා කළේය. ඔහු සිය විස්සයි 20 තරගාවලිය ආරම්භ කළේ 2021 ජූලි 25 දින ශ්‍රී ලංකාව වෙනුවෙන් ඉන්දියාවට එරෙහිව ය."
    },
    {
        "name": "වනිඳු හසරංග",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 29 ලකුණු 546, විස්සයි විස්ස තරග 25 ලකුණු 200, ටෙස්ට් තරග 4 ලකුණු 196",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 29 කඩුලු 29, විස්සයි විස්ස 25 තරග කඩුලු 36, ටෙස්ට් තරග 4 කඩුලු 4",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 33, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 2",
        "bat_rank": "",
        "bio": "පින්නදූව වනිඳු හසරංග ද සිල්වා (උපත 1997 ජූලි 29) වනිඳු හසරංග ලෙස ප්‍රසිද්ධ වූ අතර ඔහු ක්‍රීඩාවේ සියලුම ආකෘති තුනේදීම ජාතික කණ්ඩායමට ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු 2017 ජූලි මාසයේදී ශ්‍රී ලංකාව සඳහා ජාත්‍යන්තරව ක්‍රීඩා කළේය. ඔහුගේ වැඩිමහල් සහෝදරයා වන චතුරංග ද සිල්වා ද ජාතික කණ්ඩායම නියෝජනය කර ඇත.",
        "teams": "ශ්‍රී  ලංකාව, යාපනය ස්ටැලියන්ස්, රෝයල් චැලෙන්ජර්ස් බැංගලෝර්",
        "career_info": "සිම්බාබ්වේට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා හසරංග ශ්‍රී ලංකා එක්දින ජාත්‍යන්තර සංචිතයට නම් කර තිබේ. ඔහු 2017 ජූලි 2 දින සිම්බාබ්වේට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර ක්‍රිකට් තරඟය ක්‍රීඩා කළේය. ඔහුගේ මංගල තරඟයේදී ඔහු අඛණ්ඩව පන්දු යැවීමේදී සිම්බාබ්වේ කඩුලු 3 ක් ලබා ගත් අතර එක්දින ජාත්‍යන්තර තරගයකදී කඩුලු ත්‍රි කඩුලු ලබා ගත් ලාබාලතම පන්දු යවන්නා බවට පත්විය. . බංග්ලාදේශ තායිජුල් ඉස්ලාම් සහ දකුණු අප්‍රිකානු කගිසෝ රබාඩාට පසුව එක්දින තරග ඉතිහාසයේ තුන්වන කඩුලු ත්රිත්වය ලබා ගත් ක්‍රීඩකයා ඔහු විය. එක්දින ඉතිහාසයේ කඩුලු ත්‍රිත්වයක් ලබා ගත් ප්‍රථම පා දඟ පන්දු යවන්නා බවට ද ඔහු පත්විය"
    },
    {
        "name": "දුෂ්මන්ත චමීර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 37 ලකුණු 203, විස්සයි විස්ස තරග 31 ලකුණු 200, ටෙස්ට් තරග 6 ලකුණු 140",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 37 කඩුලු 39, විස්සයි විස්ස 31 තරග කඩුලු 31, ටෙස්ට් තරග 6 කඩුලු 32",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 35, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 30, ටෙස්ට් පන්දු යැවීමේ ස්ථානය 73",
        "bat_rank": "",
        "bio": "පතිර වාසන් දුෂ්මන්ත චමීර (උපත 1992 ජනවාරි 11) ශ්‍රී ලංකාව සඳහා ජාත්‍යන්තර ආකෘති තුනම ක්‍රීඩා කරන අතර නොන්ඩිස්ක්‍රිප්ට්ස් ක්‍රිකට් සමාජය සඳහා දේශීයව ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2015 ජනවාරි මාසයේදී ශ්‍රී ලංකාව සඳහා සිය ජාත්‍යන්තර මංගල තරගය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව, කොළඹ රජවරු",
        "career_info": "දකුණත් වේග පන්දු යවන්නෙකු වන චමීර 2015 ජනවාරි 29 දින නවසීලන්තයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල එක්දින ජාත්‍යන්තර ක්‍රිකට් තරඟය ක්‍රීඩා කළේය. ඔහු රොස් ටේලර්ව යැවූ පළමු ඕවරයේදී ඔහුගේ පළමු ජාත්‍යන්තර කඩුල්ල ලබා ගත් අතර, ඔහු ග්‍රාන්ට් එලියට් ද දැවී ශ්‍රී ලංකාව ජයග්‍රහණය කළේය."
    },
    {
        "name": "දසුන් ශානක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 34 ලකුණු 715, විස්සයි විස්ස තරග 49 ලකුණු 611, ටෙස්ට් තරග 11 ලකුණු 140",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 34 කඩුලු 12, විස්සයි විස්ස තරග 49 කඩුලු 15, ටෙස්ට් තරග 11 කඩුලු 13",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 81",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 87, විස්සයි විස්ස පිතිකරණ ස්ථානය 73",
        "bio": "මැදගමගමගේ දසුන් ශානක (උපත 1991 සැප්තැම්බර් 9) යනු ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකු වන අතර ඔහු සියලු ආකාර ක්‍රීඩා කරන ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායමේ සීමිත පන්දුවාර නායකයෙකි. පිංච පහර කරන්නෙකු ලෙස හැඳින්වෙන ශානක සාමාන්‍යයෙන් දකුණත් අතැති මැද වේග පන්දු යැවීම සමඟින් පිතිකරණ තුන් ඉරියව් ක්‍රීඩකයෙකු ලෙස ක්‍රීඩා කරයි.",
        "teams": "ශ්‍රී  ලංකාව, දඹුල්ල වයිකිං, චිතගොං වයිකින්ස්, රංග්පූර් රයිඩර්ස්",
        "career_info": "ඔහු 2015 ජූලි මාසයේදී පකිස්ථානයට එරෙහිව පැවැත්වෙන ශ්‍රී ලංකා විස්සයි විස්ස ජාත්‍යන්තර (විස්සයි 20) සංචිතයට නම් කරන ලදී. ඔහු සිය විස්සයි 20 තරගාවලිය ආරම්භ කළේ 2015 අගෝස්තු 1 වන දින ශ්‍රී ලංකාව සඳහා වූ 58 වන විස්සයි 20 ක්‍රිකට් තරගය ලෙස ය. ඔහු 2016 මැයි 19 දින එංගලන්තයට එරෙහිව එම සංචාරයේදීම ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය. ඔහු ශ්‍රී ලංකාව වෙනුවෙන් 134 වන ටෙස්ට් ක්‍රීඩකයා විය. ඔහු සිය පළමු ටෙස්ට් කඩුල්ල ලබා ගත්තේ එංගලන්ත නායක ඇලෙස්ටෙයාර් කුක් දැවී යාමෙන්. ඔහු ලකුණු 46 ට 3 ක් ලබා ගත්තද, ඔහු ඉනිම දෙකේදීම රැස් කළේ ලකුණු 4 ක් පමණක් වන අතර, ශ්‍රී ලංකාව ඉනිමකින් සහ ලකුණු 88 කින් පරාජය විය"
    },
    {
        "name": "දිනේෂ් චන්දිමාල් ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 150 ලකුණු 3707, විස්සයි විස්ස තරග 57 ලකුණු 868, ටෙස්ට් තරග 62 ලකුණු 4158",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 50, විස්සයි විස්ස පිතිකරණ ස්ථානය 46, ටෙස්ට් පිතිකරණ ස්ථානය 50",
        "bio": "ලොකුගේ දිනේෂ් චන්දිමාල් (සිංහල: ලොකුගේ දිනේෂ් චන්දිමාල්; උපත 18 නොවැම්බර් 1989) යනු ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායමේ වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් සහ සියලු ආකෘති වල හිටපු නායකයෙකි. සමහර විට කඩුලු රකින මැදපෙළ පිතිකරුවෙකු ලෙස ක්‍රීඩා කරන පහසු හා කඩිසර දකුණත් පිතිකරුවෙකු වන චන්දිමාල් සිය පළමු දිවා-රාත්‍රී ටෙස්ට් තරඟයේදී ශ්‍රී ලංකාව මෙහෙයවූ ප්‍රථම නායකයා විය.",
        "teams": "ශ්‍රී  ලංකාව, කොළඹ කිංග්ස්, චිතගොං වයිකින්ස්, රාජස්ථාන් රෝයල්ස්",
        "career_info": "ඔහු 2010 ජාත්‍යන්තර ක්‍රිකට් ලෝක කුසලාන ක්‍රිකට් තරගාවලියේදී බටහිර ඉන්දීය කොදෙව් දූපත් වලදී ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසි අතර මූලික කණ්ඩායම් අදියරේදී නවසීලන්තය සහ සිම්බාබ්වේට එරෙහිව ශ්‍රී ලංකා කණ්ඩායම් ක්‍රීඩා කරමින් පසුව ඕස්ට්‍රේලියාවට එරෙහිව සුපර් අට අවසන් තරගයට ක්‍රීඩා කළේය. ෆ්ලොරිඩාවේ පැවති විස්සයි 20 ජාත්‍යන්තර තරඟයකදී නවසීලන්තයට එරෙහිව ක්‍රීඩා කිරීමෙන් පසු චන්දිමාල් සිම්බාබ්වේ හි පැවති එක්දින තුන්කොන් ක්‍රිකට් තරගාවලිය සඳහා තෝරා ගත් අතර එහිදී දෙපාර්ශවයම ඉන්දියාවට ද ක්‍රීඩා කළහ. ඔහු සිම්බාබ්වේට එරෙහිව මංගල තරඟය ආරම්භ කළ අතර නොදැවී ලකුණු 10 ක් රැස් කළ අතර ඔහුගේ කණ්ඩායම කඩුලු 9 ක ජයග්රහණයක් කරා ගමන් කළ අතර පසුව ඉන්දියාවට එරෙහිව පන්දු 118 කදී ලකුණු 111 ක් රැස් කරමින් ඔහුගේ මංගල ජාත්යන්තර ශතකය වාර්තා කළ අතර එම තරගය ජයග්රහණය කිරීමට දෙපිලම සමත් විය ( කඩුලු 6 ක්) ඉන්දියාව තරගාවලියෙන් ඉවත් කරයි."
    },
    {
        "name": "තිසර පෙරේරා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 166 ලකුණු 2338, විස්සයි විස්ස තරග 84 ලකුණු 1204, ටෙස්ට් තරග 6 ලකුණු 203",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 166 කඩුලු 140, විස්සයි විස්ස තරග 49 කඩුලු 51, ටෙස්ට් තරග 6 කඩුලු 11",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "නාරංගොඩ ලියනආරච්චිගේ තිසර චිරන්ත පෙරේරා (සිංහල: තිසර පෙරේරා; උපත 1989 අප්රේල් 3), තිසර පෙරේරා ලෙස ජනප්‍රිය, ජාතික කණ්ඩායම සඳහා සියලු ආකෘති ක්‍රීඩා කළ හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි. පෙරේරා වයස අවුරුදු දහඅටේදී තම පෙම්වතිය වූ ෂෙරමි දිනුෂිකා සමඟ විවාහ විය. 2020 ඔක්තෝම්බර් මාසයේදී ඔහු ගජබා රෙජිමේන්තුවට අනුයුක්තව සිටි ශ්‍රී ලංකා යුද හමුදා ස්වේච්ඡා බලකායේ මේජර්වරයෙකු ලෙස පත් කරන ලදී.",
        "teams": "ශ්‍රී  ලංකාව, යාපනය ස්ටැලියන්ස්",
        "career_info": "පෙරේරා 2009 දෙසැම්බර් මාසයේදී ඉන්දියාව සමඟ කොල්කටාහිදී එක්දින තරඟයකට ක්‍රීඩා කිරීම සඳහා වූ ප්‍රමාද කැඳවීම මත 2009 දෙසැම්බර් මාසයේදී ශ්‍රී ලංකාව සඳහා ජාත්‍යන්තරව මංගල තරඟය ආරම්භ කළේය. ඔහු 2010 අගෝස්තු මාසයේදී ජාත්‍යන්තර ක්‍රිකට් පිටියේ පළමු කඩුලු 5 දවා ගත් අතර ඉන්දියාවට එරෙහිව එක්දින ජයග්‍රහණයක තරගාවලියේ වීරයා සම්මානය දිනා ගත්තේය. ඔහු එම සංචාරයේදී ඕස්ට්‍රේලියාවට එරෙහිව පැවති එක්දින තරඟයේදී කඩුලු 5 ක් දවා ගත්තා"
    },
    {
        "name": "චාමර කපුගෙදර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 102 ලකුණු 1624, විස්සයි විස්ස තරග 43 ලකුණු 703, ටෙස්ට් තරග 8 ලකුණු 418",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 61, විස්සයි විස්ස පිතිකරණ ස්ථානය 37, ටෙස්ට් පිතිකරණ ස්ථානය 50",
        "bio": "චාමර කාන්ත කපුගෙදර (සිංහල: චාමර කපුගෙදර, 1987 පෙබරවාරි 24 මහනුවරදී උපත), පොදුවේ චාමර කපුගෙදර යනු ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කළ හිටපු ජාත්‍යන්තර ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු හිටපු එක්දින නායකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, චෙන්නායි සුපර් කිංග්ස්",
        "career_info": "ආක්‍රමණශීලී දකුණත් පිතිකරුවෙකු වූ කපුගෙදර 2006 දී ඕස්ට්‍රේලියාවට එරෙහිව පර්ත්හිදී එක්දින ජාත්‍යන්තර ක්‍රිකට් පිටියේදී සිය පළමු ජාත්‍යන්තර ක්‍රිකට් රසය ලබා ගත්තේය. ඔහු සිය පළමු ටෙස්ට් ක්‍රිකට් තරගය එංගලන්තයට එරෙහිව ලන්ඩනයේ ලෝඩ්ස් ක්‍රිකට් ක්‍රීඩාංගණයේදී ආරම්භ කළේය. 2006 මැයි මාසයේදී ඔහු පළමු ඉනිමේදී පළමු පන්දුවට පහරදීමක් සිදු කළේය. හැඩකාර හා සම්භාව්‍ය ක්‍රීඩකයෙකු වන ඔහු 2006 දී පැවති වීබී සීරීස් තරඟාවලියේ ප්‍රථම අවසන් තරඟයේදී බ්‍රෙට් ලීට එරෙහිව දැවැන්ත පහරක් එල්ල කළ අතර පන්දු 21 කදී හතරේ පහර 2 ක් සහ හයේ පහර 3 ක් සමඟින් ලකුණු 38 ක් රැස් කළේය. මෙම ඉනිම ශක්තිමත් විය. වසර 9 කට පසු ඕස්ට්‍රේලියාව සිය පළමු ගෙදර අවසන් තරගය පරාජයට පත් වීම සහතික කළ ශ්‍රී ලංකාවේ මුළු එකතුව."
    },
    {
        "name": "ෆර්වීස් මහරුෆ්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 89 ලකුණු 1219, විස්සයි විස්ස තරග 8 ලකුණු 33, ටෙස්ට් තරග 22 ලකුණු 556",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 89 කඩුලු 135, විස්සයි විස්ස තරග 8 කඩුලු 7, ටෙස්ට් තරග 22 කඩුලු 25",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මොහොමඩ් ෆර්වීස් මහරුෆ් (උපත 1984 සැප්තැම්බර් 7) නොහොත් ෆර්වීස් මහරූෆ් යනු ටෙස්ට් හා එක්දින තරඟ සඳහා ක්‍රීඩා කළ ශ්‍රී ලාංකික වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු ප්‍රථමයෙන් සිය අවධානයට ලක් වූයේ 2004 ශ්‍රී 19 ලෝක කුසලාන ක්‍රිකට් තරගාවලියේදී වන අතර එහිදී ඔහු ශ්‍රී ලංකා කණ්ඩායමේ නායකයා විය. ඔහු වෙස්ලි විද්‍යාලය සඳහා උසස් පාසල් දිවියක් භුක්ති වින්දා, වැඩිම ලකුණු 243 ක් සහ හොඳම පන්දු යැවීමේ ඉනිම 20 ට 8 යි. තුන් ඉරියව් ක්‍රීඩකයෙකු වන ඔහු 2004 දී සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළේය.",
        "teams": "ශ්‍රී  ලංකාව, දිල්ලි ඩෙයාර් ඩෙවිල්ස්, වයඹ, ලැන්කෂයර්",
        "career_info": "2004 අප්රේල් සහ මැයි මාසවලදී මහරුෆ් එක්දින තරඟ 5 ක් සහ ටෙස්ට් තරග දෙකක් සඳහා සිම්බාබ්වේහි සංචාරය කළ ශ්රී ලංකා කණ්ඩායමේ කොටසක් විය. මහරූෆ් ඇතුළු ක්‍රීඩකයින් දෙදෙනෙකු මෙම එක්දින ක්‍රිකට් තරගාවලියේ තුන්වන තරඟයේදී සිය මංගල එක්දින තරඟය ආරම්භ කළ අතර, ශ්‍රී ලංකා නිත්‍ය ක්‍රීඩකයින් තිදෙනෙකු විවේක ගන්වනු ලැබීය. ඔහු කඩුලු 3 ක් දවාගනිමින් සිම්බාබ්වේ ලකුණු 35 කට දැවී ගිය අතර එය එක්දින ඉතිහාසයේ අඩුම ලකුණු විය. තරගාවලියේ අවසන් තරඟ දෙකේදී මහරූෆ් තවත් කඩුලු දවාගනිමින් 16.60 ක සාමාන්‍යයකින් තරග 5 ක් අවසන් කළේය."
    },
    {
        "name": "අවිශ්ක ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 26 ලකුණු 964, විස්සයි විස්ස තරග 23 ලකුණු 356",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 39",
        "bio": "සාමාන්‍යයෙන් අවිශ්ක ප්‍රනාන්දු ලෙස හැඳින්වෙන වීරහණ්ඩිගේ ඉනෝල් අවිශ්ක ප්‍රනාන්දු (උපත 1998 අප්‍රේල් 5), ශ්‍රී ලාංකික ජාතික ක්‍රිකට් ක්‍රීඩකයෙකු වන අතර ඔහු දැනට ශ්‍රී ලංකා ජාතික කණ්ඩායම සඳහා සීමිත ජාත්‍යන්තර තරග ක්‍රීඩා කරයි. ඔහු දේශීය ක්‍රිකට් ක්‍රීඩාවේදී කෝල්ට්ස් ක්‍රිකට් සමාජය සඳහා ක්‍රීඩා කරන අතර, ඔහු 2016 අගෝස්තු මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය. ඔහු අධ්‍යාපනය ලැබුවේ මොරටුව ශාන්ත සෙබස්තියන් විද්‍යාලයේ ය.",
        "teams": "ශ්‍රී  ලංකාව, යාපනය ස්ටැලියන්ස්, මහනුවර, කොළඹ, ශ්‍රී ලංකා XI, අබුඩාබි කණ්ඩායම, චැට්ටෝග්‍රෑම් චැලෙන්ජර්ස්",
        "career_info": "18 හැවිරිදි තරුණයෙකු ලෙස ඔස්ට්‍රේලියාවට එරෙහිව ඔවුන්ගේ මව්බිමේදී පැවැත්වෙන තරගාවලිය සඳහා ඔහු ශ්‍රී ලංකා එක්දින සංචිතයට කැඳවා තිබේ. ඔහු කිසිදු විස්සයි 20 හෝ ලැයිස්තු ඒ හෝ පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩා නොකර ජාතික එක්දින කණ්ඩායමට සිය පළමු කැඳවීම ලබා ගත්තේය. ඔහු 2016 අගෝස්තු 31 දා දඹුල්ලේදී ඕස්ට්‍රේලියාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් එක්දින ජාත්‍යන්තර තරඟය ආරම්භ කළේය. මිචෙල් ස්ටාර්ක්ගේ පන්දුවකට මුහුණ දීමෙන් ඔහු තණතීරුවකට දැවී ගියේය"
    },
    {
        "name": "පැතුම් නිශ්ශංක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 81, විස්සයි විස්ස තරග 4 ලකුණු 86, ටෙස්ට් තරග 4 ලකුණු 229",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පැතුම් නිශ්ශංක සිල්වා (උපත 1998 මැයි 18) ශ්රී ලංකාව සඳහා සියළුම ආකෘති ක්රීඩා කරන වෘත්තීයමය ශ්රී ලාංකික ක්රීඩකයෙකි. ඔහු 2021 මාර්තු මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2019 ජනවාරි මාසයේදී ඔහු අයර්ලන්ත ඒ. කණ්ඩායමට එරෙහිව පැවති පළමු පන්තියේ තරගාවලිය සඳහා වූ ශ්‍රී ලංකා ඒ කණ්ඩායමේ සංචිතයට නම් කරන ලදී. 2019 පෙබරවාරි මාසයේදී ඔහු කොළඹ ක්‍රිකට් සමාජයට එරෙහිව නොන්ඩිස් ක්‍රිප්ට් ක්‍රිකට් සමාජය වෙනුවෙන් පන්දුවට පහර දෙමින් 2018-19 ප්‍රිමියර් ලීග් තරඟාවලියේදී සිය 1000 වැනි ලකුණු රැස් කළේය. ඔහු තරඟ 7 න් නොන්ස්ක්‍රිප්ට්ස් ක්‍රිකට් සමාජයේ වැඩිම ලකුණු ලාභියා ලෙස තරඟාවලිය අවසන් කළ අතර තරඟ හතකදී ලකුණු 1088 ක් රැස් කළේය."
    },
    {
        "name": "භානුක රාජපක්ෂ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 5 ලකුණු 89, විස්සයි විස්ස තරග 10 ලකුණු 165",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "භානුක රාජපක්ෂ (උපත 1991 ඔක්තෝබර් 24) ලෙස ප්‍රචලිත ප්‍රමෝද් භානුක බණ්ඩාර රාජපක්ෂ, ජාතික කණ්ඩායම සඳහා ජාත්‍යන්තර තරග සීමා සහිතව ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් මැද පන්දු යවන වමත් පිතිකරුවෙකි. ඔහු ඉපදුණේ කොළඹ ය.",
        "teams": "ශ්‍රී  ලංකාව, ගාල්ල ග්ලැඩියේටර්ස්",
        "career_info": "2019 සැප්තැම්බර් මාසයේදී ඔහු පකිස්ථානයට එරෙහිව පකිස්ථානයේදී පැවැත්වෙන තරඟාවලිය සඳහා වූ ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට නම් කරන ලදී. ඔහු 2019 ඔක්තෝබර් 5 දින පාකිස්තානයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් විස්සයි 20 තරගාවලියට පිවිසි අතර පන්දු 22 කදී ලකුණු 32 ක් රැස් කරමින් ලකුණු 64 ක ජයක් ලබා ගත්තේය. දෙවන තරඟයේදී රාජපක්ෂ පන්දු 48 කදී ලකුණු 77 ක් රැස් කළ අතර ශ්‍රී ලංකාව පාකිස්තානය ලකුණු 35 කින් පරාජය කළේය. ඔහුගේ පිතිහරඹය හේතුවෙන් තරගයේ වීරයා ලෙස ඔහු නම් කෙරිණි."
    },
    {
        "name": "අශේන් බණ්ඩාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 5 ලකුණු 141, විස්සයි විස්ස තරග 5 ලකුණු 84",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "අශේන් බණ්ඩාර ලෙස හඳුන්වන කෝරළේගෙදර නදීජා අශේන් බණ්ඩාර (උපත 1998 නොවැම්බර් 23), ශ්‍රී ලාංකික වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2021 මාර්තු මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2019 නොවැම්බර් මාසයේදී ඔහු බංග්ලාදේශයේ පැවති 2019 ඒසීසී නැගී එන කණ්ඩායම් ආසියානු කුසලානය සඳහා වූ ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී. එම මාසයේම පසුව, ඔහු 2019 දකුණු ආසියානු ක්‍රීඩා උළෙලේ පිරිමි ක්‍රිකට් තරඟාවලිය සඳහා වූ ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී. අවසන් මහා තරඟයේදී බංග්ලාදේශය සමඟ කඩුලු 7 කින් පරාජයට පත් වූ ශ්‍රී ලංකා කණ්ඩායම රිදී පදක්කම දිනා ගත්තා."
    },
    {
        "name": "ලක්ෂාන් සඳකැන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 31 ලකුණු 64, විස්සයි විස්ස තරග 20 ලකුණු 23, ටෙස්ට් තරග 11 ලකුණු 117",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 31 කඩුලු 27, විස්සයි විස්ස තරග 20 කඩුලු 23, ටෙස්ට් තරග 11 කඩුලු 37",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 93, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 24",
        "bat_rank": "",
        "bio": "පට්ටම්පෙරුම ආරච්චිගේ දොන් ලක්ෂාන් රංගිකා සඳකැන්, සාමාන්‍යයෙන් ලක්ෂාන් සඳකැන් (උපත 1991 ජූනි 10), ඔහු ක්‍රීඩාවේ සියලුම ආකෘති තුනේදීම ජාතික කණ්ඩායම සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු කඳාන ද මැසෙනොද් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2016 ජූලි මාසයේදී ඔස්ට්‍රේලියාවට එරෙහිව පැවති තරගාවලිය සඳහා ඔහු ශ්‍රී ලංකා ටෙස්ට් සංචිතයට නම් කරන ලදී. 2016 ජූලි 26 දින ඔහු ශ්‍රී ලංකාව වෙනුවෙන් ඕස්ට්‍රේලියාවට එරෙහිව සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය"
    },
    {
        "name": "ධනංජය සිල්වා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 56 ලකුණු 1199, විස්සයි විස්ස තරග 23 ලකුණු 412, ටෙස්ට් තරග 36 ලකුණු 2253",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 56 කඩුලු 28, විස්සයි විස්ස තරග 23 කඩුලු 5, ටෙස්ට් තරග 36 කඩුලු 24",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 78, ටෙස්ට් පන්දු යැවීමේ ස්ථානය 74",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 74,  ටෙස්ට් පිතිකරණ ස්ථානය 89",
        "bio": "ධනංජය මධුරංග ද සිල්වා, හෝ පොදුවේ ධනංජය ද සිල්වා (උපත 1991 සැප්තැම්බර් 6) යනු වෘත්තීයමය වශයෙන් ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ජාත්‍යන්තර තරඟ සඳහා ශ්‍රී ලංකාව වෙනුවෙන් ක්‍රීඩා කරන අතර දේශීය ක්‍රිකට් වල තමිල් යූනියන් වෙනුවෙන් ද ක්‍රීඩා කරයි. 2017 නොවැම්බරයේදී ඔහු ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ වාර්ෂික සම්මාන උළෙලේදී 2016-17 කාලය සඳහා වසරේ ටෙස්ට් පිතිකරු ලෙස නම් කරන ලදී",
        "teams": "ශ්‍රී  ලංකාව, යාපනය ස්ටැලියන්ස්",
        "career_info": "2015 ජූලි මාසයේදී ද සිල්වා පකිස්ථානයට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා වූ ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට ඇතුළත් විය. ඔහු 2015 ජූලි 30 වෙනිදා විස්සයි 20 තරග බිමට පිවිසියේය. ඔහු සිය මංගල තරගයේදී ලකුණු 31 ක් රැස් කළ අතර එහිදී ශ්‍රී ලංකාව පරාජයට පත් විය."
    },
    {
        "name": "දිමුත් කරුණාරත්න",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 34 ලකුණු 767, ටෙස්ට් තරග 72 ලකුණු 5137",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "ටෙස්ට් පිතිකරණ ස්ථානය 11",
        "bio": "දිමුත් කරුණාරත්න ලෙස ජනප්‍රිය වූ ෆ්‍රෑන්ක් දිමුත් මධුශංක කරුණාරත්න (උපත 1988 අප්‍රේල් 21), ශ්‍රී ලාංකික වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකු මෙන්ම වර්තමාන ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් කණ්ඩායමේ නායකයෙකි. ඔහු ටෙස්ට් හා එක්දින තරඟ දෙකෙන්ම රට නියෝජනය කරන වමත් දකුණත් රතු පන්දු විශේෂඥයෙකු වන අතර හිටපු එක්දින නායකයෙක්ද වේ.",
        "teams": "ශ්‍රී  ලංකාව, වයඹ",
        "career_info": "2012 අග භාගයේදී නවසීලන්තයට එරෙහිව පැවති ටෙස්ට් ක්‍රිකට් තරගාවලිය සඳහා වූ ටෙස්ට් සංචිතයට ඔහුව නැවත කැඳවනු ලැබීය. ඔහු එම තරග මාලාවේ පළමු ටෙස්ට් තරඟය ගාල්ලේදී ආරම්භ කළේ පළමු ඉනිමේදී තාරාවන් සඳහා දැවී යාම පමණි. කෙසේ වෙතත්, නොදැවී අර්ධ ශතකයක් ලබා ගනිමින් 2 වන ඉනිමේදී ඔහු දැඩි ලෙස ආපසු පැමිණි අතර ජයග්‍රාහී ලකුණු ද වාර්තා කළේය. නවසීලන්ත තරගාවලියෙන් පසුව ඔහුව ඕස්ට්‍රේලියාවේ ටෙස්ට් තරග තුනකින් සමන්විත ටෙස්ට් තරගාවලියකට කැඳවා තිබුණි."
    },
    {
        "name": "කුසල් මෙන්ඩිස්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 79 ලකුණු 2228, විස්සයි විස්ස තරග 29 ලකුණු 538, ටෙස්ට් තරග 47 ලකුණු 3022",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 79 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 54, විස්සයි විස්ස පිතිකරණ ස්ථානය 99, ටෙස්ට් පිතිකරණ ස්ථානය 56",
        "bio": "කුසල් මෙන්ඩිස් ලෙසින් හැඳින්වෙන, බලාපුවඩුගේ කුසල් ගිම්හාන් මෙන්ඩිස්, (උපත 2 පෙබරවාරි 1995) යනු, ටෙස්ට් ක්‍රිකට් සහ එක් දින ජාත්‍යන්තර සඳහා ක්‍රීඩා කරන වෘත්තීය තලයේ ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ",
        "teams": "ශ්‍රී  ලංකාව, මහනුවර ටස්කර්ස්",
        "career_info": "2014 ICC 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ නායකත්වය මෙන්ඩිස් විසින් දරනු ලැබීය. ඔහු සෝබර්ස් තිසේරා කුසලාන දෙවන ටෙස්ට් ක්‍රිකට් තරඟයේදී තම හිස් වැස්ම ලබා ගනිමින් ශ්‍රී ලංකාව වෙනුවෙන් 132 වන ටෙස්ට් ක්‍රීඩකයා විය. ඔහු සිය පළමු ටෙස්ට් ක්‍රිකට් තරඟය ආරම්භ කළේ 2015 බටහිර ඉන්දීය කොදෙව් සංචාරයේ 2 වන ටෙස්ට් ක්‍රිකට් සංචාරයේදී වන අතර ඔහු පළමු ඉනිමේදී ලකුණු 13 ක් සහ දෙවන ඉනිමේදී ලකුණු 39 ක් රැස් කළේය."
    },
    {
        "name": "චාමික කරුණාරත්න",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 10 ලකුණු 200, විස්සයි විස්ස තරග 6 ලකුණු 69, ටෙස්ට් තරග 1 ලකුණු 22",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 10 කඩුලු 6, විස්සයි විස්ස තරග 6 කඩුලු 1, ටෙස්ට් තරග 1 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "එදිරිමුණි චාමික දිනූෂාන් පෙරේරා කරුණාරත්න (උපත 1996 මැයි 29) යනු වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් සහ බැඩ්මින්ටන් ක්‍රීඩකයෙකි. [2] ඔහු 2019 පෙබරවාරි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2018 දෙසැම්බර් මාසයේදී ඔහු 2018 ඒසීසී නැගී එන කණ්ඩායම් ආසියානු කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ නම් කරන ලදී. 2019 ජනවාරියේදී ඔස්ට්‍රේලියාවට එරෙහි දෙවන ටෙස්ට් ක්‍රිකට් තරඟය සඳහා ඔහු ශ්‍රී ලංකා ටෙස්ට් සංචිතයට ඇතුළත් කරන ලදී. ඔහු සිය පළමු ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළේ 2019 පෙබරවාරි 1 දින ඕස්ට්‍රේලියාවට එරෙහිව ය"
    },
    {
        "name": "සුරංග ලක්මාල්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 86 ලකුණු 244, විස්සයි විස්ස තරග 11 ලකුණු 7, ටෙස්ට් තරග 66 ලකුණු 889",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 86 කඩුලු 109, විස්සයි විස්ස තරග 11 කඩුලු 8, ටෙස්ට් තරග 66 කඩුලු 167",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 22, එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 66",
        "bat_rank": "",
        "bio": "රණසිංහ ආරච්චිගේ සුරංග ලක්මාල් (උපත 1987 මාර්තු 10) යනු ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකු වන අතර ඔහු ක්‍රීඩාවේ සෑම ආකෘතියකටම ක්‍රීඩා කරන අතර හිටපු ටෙස්ට් ක්‍රිකට් නායකයෙකි. ඔහු දකුණත් වේග පන්දු යවන්නෙකු මෙන්ම දකුණත් පිතිකරුවෙකි. ඔහු සිය ක්‍රිකට් ජීවිතය ආරම්භ කළේ තිස්සමහාරාම දෙබරවැව ජාතික පාසලෙනි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2009 දෙසැම්බරයේදී ඉන්දියාවේ දිල්හාර ප්‍රනාන්දු වෙනුවට ආදේශ කිරීමට ලක්මාල් කැඳවනු ලැබූ අතර, ඔහු නාග්පූර්හිදී පැවති දෙවන තරඟයේදී ඔහුගේ එක්දින මංගල ජාත්‍යන්තර තරඟය ආරම්භ කළ අතර එහිදී ඔහු කඩුලු 3 ක් නොදැවී ඕවර 8 ක් යැවී ලකුණු 58 කට කඩුලු 3 ක් ජයග්රහණය කළේය. ඔහු 2010 නොවැම්බර් 23 දින ආර්.ප්‍රේමදාස ක්‍රීඩාංගණයේදී පැවති දෙවන ටෙස්ට් ක්‍රිකට් තරගයේදී බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව සිය මංගල ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළ අතර 114 වන ශ්‍රී ලංකා ටෙස්ට් ක්‍රීඩකයා බවට පත්විය."
    },
    {
        "name": "අසිත ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 4, ටෙස්ට් තරග 3 ලකුණු 4",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 4 කඩුලු 0, ටෙස්ට් තරග 3 කඩුලු 4",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "අසිත මධුසංක ප්‍රනාන්දු (උපත 1997 ජූලි 31) ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2017 ජූලි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ප්‍රනාන්දු සිම්බාබ්වේ සමඟ පැවැත්වෙන තරගාවලිය සඳහා වූ ශ්‍රී ලංකා එක්දින සංචිතයට ඇතුළත් කර තිබේ. ඔහු 2017 ජූලි 8 සිම්බාබ්වේ සමඟ පැවති සිව්වන එක්දින තරඟයේදී මහින්ද රාජපක්ෂ ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාංගණයේදී සිය මංගල එක්දින ජාත්‍යන්තර ක්‍රිකට් තරගය ආරම්භ කළ නමුත් කඩුල්ලක් දවා ගැනීමට නොහැකි විය."
    },
    {
        "name": "මහීෂ් තීක්ෂණ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 10, විස්සයි විස්ස තරග 3 ලකුණු 72",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 4, විස්සයි විස්ස තරග 3 කඩුලු 8 ",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මොරවකගේ මහීෂ් තීක්ෂණ (උපත 2000 අගෝස්තු 1) යනු ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2021 සැප්තැම්බර් මාසයේදී ශ්‍රී ලංකාව සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "එස්එල්සී ආරාධිත විස්සයි 20 ලීගයේ තීක්‍ෂණගේ ප්‍රබල දස්කම් වලින් පසුව ඔහු දකුණු අප්‍රිකාවට එරෙහි සිය තරගාවලිය සඳහා ශ්‍රී ලංකා එක්දින ජාත්‍යන්තර (එක්දින) සහ විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිත සඳහා නම් කරන ලදී. ඔහු 2021 සැප්තැම්බර් 7 වන දින ශ්‍රී ලංකාව වෙනුවෙන් දකුණු අප්‍රිකාවට එරෙහිව සිය මංගල එක්දින තරගය ආරම්භ කළේය. තරඟයේදී ඔහු එක්දින ක්‍රිකට් ක්‍රීඩාවේ පළමු පන්දුවෙන්ම කඩුල්ලක් දවා ගත්තා. [9] ඔහු ලකුණු 37 කට කඩුලු 4 ක් දවාලූ අතර [10] එම තරඟාවලිය 2-1ක් ලෙස ශ්‍රී ලංකාව ජයග්‍රහණය කළේය. ඔහු 2020 2021 සැප්තැම්බර් 10 වන දින ශ්‍රී ලංකාව වෙනුවෙන් දකුණු අප්‍රිකාවට එරෙහිව විස්සයි 20 තරඟය ආරම්භ කළේය"
    },
    {
        "name": "ධනංජය ලක්ෂාන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 10",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පොතොටුව ආරච්චිගේ ධනංජය ලක්ෂාන් (උපත 1998 ඔක්තෝබර් 5), ධනංජය ලක්ෂාන් ලෙස ජනප්‍රිය වූ ඔහු වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. [1] ඔහු 2021 ජුනි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව, ගාල්ල ග්ලැඩියේටර්ස්",
        "career_info": "2021 ජුනි මාසයේදී ලක්ෂාන් එංගලන්ත සංචාරය සඳහා වූ ශ්‍රී ලංකා සංචිතයට නම් කරන ලදී. ඔහු සිය එක්දින ජාත්‍යන්තර (එක්දින) මංගල තරඟය ආරම්භ කළේ 2021 ජූනි 29 දින එංගලන්තයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙනි. 2021 ජූලි මාසයේදී ඔහු ඉන්දියාවට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා වන ශ්‍රී ලංකා සංචිතයේ නම් කරන ලදී."
    },
    {
        "name": "ප්‍රවීන් ජයවික්‍රම",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 5 ලකුණු 7, ටෙස්ට් තරග 1 ලකුණු 3",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 5 කඩුලු 5, ටෙස්ට් තරග 1 කඩුලු 11",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 50",
        "bat_rank": "",
        "bio": "ප්‍රවීන් ජයවික්‍රම (උපත 1998 සැප්තැම්බර් 30) ජාතික කණ්ඩායමට ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2021 අප්‍රේල් මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2021 අප්‍රේල් මාසයේදී බංග්ලාදේශය සමඟ පැවති තරඟාවලිය සඳහා ජයවික්‍රම ශ්‍රී ලංකා ටෙස්ට් සංචිතයට නම් කරන ලදී. ඔහු සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළේ 2021 අප්‍රේල් 29 දින බංග්ලාදේශයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙනි. ඔහු මංගල ටෙස්ට් තරගයේදී පළමු ඉනිමේදී ලකුණු 92 කට කඩුලු 6 ක් දවාගනිමින්, ටෙස්ට් තරගයකදී කඩුලු 5 බැගින් දවා ගත් ශ්‍රී ලංකාව වෙනුවෙන් පස්වන පන්දු යවන්නා බවට පත්විය. ඔහු දෙවැනි ඉනිමේදී ලකුණු 86 කට කඩුලු 5 ක් දවා ගත් අතර, ශ්‍රී ලංකාව වෙනුවෙන් පළමු පන්දු යවන්නා බවට පත් වූ අතර සමස්තයක් ලෙස ටෙස්ට් තරගයකදී මංගල කඩුලු 10 බැගින් දවා ගත්තා."
    },
    {
        "name": "රමේෂ් මෙන්ඩිස්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 3 ලකුණු 24, ටෙස්ට් තරග 2 ලකුණු 57",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 3 කඩුලු 2, ටෙස්ට් තරග 2 කඩුලු 8",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "වනිගාමුණි රමේෂ් තරින්ද මෙන්ඩිස් (උපත 1995 ජූලි 7) යනු ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු 2014 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ කොටසක් විය. ඔහු 2021 ජනවාරි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2021 ජනවාරියේදී ඔහු එංගලන්තය සමඟ පැවති ශ්‍රී ලංකා ටෙස්ට් තරඟ සඳහා සංචිත ක්‍රීඩකයෙකු ලෙස නම් කරන ලදී. 2021 ජනවාරි 22 දින එංගලන්තයට එරෙහිව ඔහු ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළේය. 2021 පෙබරවාරි මාසයේදී මෙන්ඩිස් බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව පැවති තරගාවලිය සඳහා ශ්‍රී ලංකාවේ සීමිත ඕවර සංචිතයට නම් කරන ලදී."
    },
    {
        "name": "බිනුර ප්‍රනාන්දු ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 26, විස්සයි විස්ස තරග 4 ලකුණු 28",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 2 කඩුලු 2, විස්සයි විස්ස තරග 4 කඩුලු 5",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "බිනුර ප්‍රනාන්දු (උපත 1995 ජූලි 12) යනු ශ්‍රී ලංකා ජාතික කණ්ඩායමට ක්‍රීඩා කරන ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2015 ජූලි මාසයේදී පකිස්ථානයට එරෙහිව පැවති ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට නම් කරන ලදී. ඔහු 2015 ජූලි 30 දින සිය විස්සයි 20 තරගාවලිය ආරම්භ කළේය. ඔහු ෂාහිඩ් අෆ්රිඩිගේ පන්දු යැවීමෙන් පළමු ජාත්‍යන්තර කඩුල්ල ලබා ගත්තේය."
    },
    {
        "name": "මිනෝද් භානුක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 6 ලකුණු 140, විස්සයි විස්ස තරග 5 ලකුණු 64, ටෙස්ට් තරග 1 ලකුණු 6",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මිනෝද් භානුක රණසිංහ (උපත 1995 අප්‍රියෙල් 29) යනු ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු 2019 ඔක්තෝම්බර් මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළේය. ඔහු 2014 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ කොටසක් විය. ඔහු කුරුණෑගල මලියදේව විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2014 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ කොටසක් විය. 2017 ඔක්තෝම්බර් මාසයේදී ඔහු පකිස්ථානයට එරෙහිව එක්සත් අරාබි එමීර් රාජ්‍යයේ පැවති තරගාවලිය සඳහා ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට ඇතුළත් වූ නමුත් ඔහු ක්‍රීඩා කළේ නැත. 2019 සැප්තැම්බර් මාසයේදී පාකිස්ථානයට එරෙහිව පකිස්ථානයේදී පැවැත්වෙන තරගාවලිය සඳහා වූ ශ්‍රී ලංකා සංචිත සඳහා ඔහු නම් කරන ලදී. [13] ඔහු 2019 ඔක්තෝබර් 2 වන දින පාකිස්තානයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර (එක්දින) මංගල තරඟය ක්‍රීඩා කළේය."
    },
    {
        "name": "කමිඳු මෙන්ඩිස් ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 42, විස්සයි විස්ස තරග 5 ලකුණු 76",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 4 කඩුලු 1, විස්සයි විස්ස තරග 5 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පැස්කුවල් හණ්ඩි කමිඳු දිලංක මෙන්ඩිස් (උපත 1998 සැප්තැම්බර් 30), ජනප්‍රිය කමිඳු මෙන්ඩිස්, ජාතික කණ්ඩායමට සහ දේශීය ක්‍රිකට් වලදී කොළඹ ක්‍රිකට් සමාජය සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු අපැහැදිලි පන්දු යවන්නෙකු වන අතර එම පන්දුවාරයේදීම දකුණ සහ වමතින් පන්දු යැවීම ද සිදු කළේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2018 අගෝස්තු මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් ඔහුව 2018 ආසියානු කුසලානය සඳහා ක්‍රීඩකයින් 31 දෙනෙකුගෙන් යුත් මූලික සංචිතයට නම් කළේය. 2018 ඔක්තෝම්බර් මාසයේදී ඔහු එංගලන්තය සමඟ පැවති එක්දින තරඟය සඳහා වූ ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට නම් කරන ලදී. ඔහු 2018 ඔක්තෝබර් 27 දින එංගලන්තයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් විස්සයි 20 තරඟය ආරම්භ කළේය. ඔහු එම තරඟයේදී ලකුණු 24 ක් රැස් කළේය."
    },
    {
        "name": "ප්‍රියමාල් පෙරේරා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 33",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ප්‍රියමාල් පෙරේරා (උපත 1995 මැයි 2) ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2014 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා සංචිතයේ කොටසක් වූ අතර 2019 මාර්තු මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල තරඟය ආරම්භ කළේය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2019 පෙබරවාරි මාසයේදී ඔහු දකුණු අප්‍රිකාවට එරෙහි ඔවුන්ගේ තරගාවලිය සඳහා ශ්‍රී ලංකා එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට නම් කරන ලදී. ඔහු 2019 මාර්තු 13 දින දකුණු අප්‍රිකාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල එක්දින තරගය ආරම්භ කළේය."
    },
    {
        "name": " ඕෂද ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 8 ලකුණු 148, විස්සයි විස්ස තරග 7 ලකුණු 128, ටෙස්ට් තරග 11 ලකුණු 667",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "බෝඩියබඩුගේ ඕෂද පියුමාල් ප්‍රනාන්දු, සාමාන්‍යයෙන් ඔෂද ප්‍රනාන්දු (උපත 1992 අප්‍රේල් 15), ඔහු ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු හලාවත මේරියන්ස් ක්‍රිකට් සමාජය සඳහා දේශීය ක්‍රිකට් ක්‍රීඩා කරන අතර ඔහු 2019 පෙබරවාරි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය ජාත්‍යන්තර මංගල තරගය ආරම්භ කළේය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2019 පෙබරවාරි මාසයේදී ඔහු දකුණු අප්‍රිකාවට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා ශ්‍රී ලංකා ටෙස්ට් සංචිතයට නම් කරන ලදී. ඔහු 2019 පෙබරවාරි 13 දින දකුණු අප්‍රිකාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළේය. පෝට් එලිසබෙත් හි පැවති දෙවන තරඟයේදී ප්‍රනාන්දු සිය මංගල ටෙස්ට් ශතකය වාර්තා කළේය. කුසල් මෙන්ඩිස් සමඟ එක්ව ඔවුන් පන්දු 213 කදී ලකුණු 163 ක නොබිඳුණු තරඟ ජයග්‍රාහී සබඳතාවක් කඩුලු 8 කින් ජයග්‍රහණය කළහ."
    },
    {
        "name": "කසුන් රාජිත",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 10 ලකුණු 1, විස්සයි විස්ස තරග 10 ලකුණු 8, ටෙස්ට් තරග 9 ලකුණු 35",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 10 කඩුලු 10, විස්සයි විස්ස තරග 10 කඩුලු 10, ටෙස්ට් තරග 9 කඩුලු 25",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 67",
        "bat_rank": "",
        "bio": "චන්ද්‍රසේකර ආරච්චිලාගේ කසුන් රාජිත (උපත 1993 ජූනි 1) ශ්‍රී ලංකාව වෙනුවෙන් ජාත්‍යන්තර මට්ටමේ ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු මාතර ශාන්ත සර්වේශස් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, බදුරලිය ක්‍රීඩා සමාජය",
        "career_info": "ඔහු 2016 පෙබරවාරි 9 දින ඉන්දියාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) ක්‍රිකට් පිටියට පිවිසියේය. ඔහුගේ පළමු ඕවරයේදීම ඔහු ඉන්දියාවේ ඉහළ පෙළේ පිතිකරුවන් දෙදෙනෙකුගේ කඩුලු ලබා ගත්තේය. අවසානයේදී සෙසු ක්‍රීඩකයින්ගේ සහාය ඇතිව ඉන්දියාව සියලු දෙනා දැවී ලකුණු 101 ක් ලබා ගත් අතර ශ්‍රී ලංකාව තරඟය ජයග්‍රහණය කරමින් තරඟ 3 කින් සමන්විත තරගාවලිය 1-0 ලෙස පෙරමුණ ගැනීමට සමත් විය. ඔහුගේ පන්දු යැවීමේදී ලකුණු 29 ට 3 ක් ලෙස රාජිත තරගයේ වීරයා ලෙසද සම්මාන ලැබීය."
    },
    {
        "name": "ප්‍රභාත් ජයසූරිය",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 11",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 87, විස්සයි විස්ස පිතිකරණ ස්ථානය 73",
        "bio": "නැකෙත් ගෙදර රොෂාන් ප්‍රභාත් ජයසූරිය, සාමාන්‍යයෙන් ප්‍රභාත් ජයසූරිය (උපත 1991 නොවැම්බර් 5), කෝල්ට්ස් ක්‍රිකට් සමාජය සහ යාපනය ස්ටැලියන්ස් ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික එක්දින ක්‍රිකට් ක්‍රීඩකයෙක් සහ පළමු පෙළ ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු මාතලේ ක්‍රිස්තු දේවස්ථාන විද්‍යාලයේ සහ කොළඹ ලුම්බිණි විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2018 ජූලි මාසයේදී ඔහු දකුණු අප්‍රිකාවට එරෙහිව පැවති තරගාවලිය සඳහා ශ්‍රී ලංකා එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට නම් කරන ලදී. ඔහු 2018 අගෝස්තු 1 වෙනිදා දකුණු අප්‍රිකාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල එක්දින තරගය ආරම්භ කළේය."
    },
    {
        "name": "ෂෙහාන් මධුශංක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 7",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 3, විස්සයි විස්ස තරග 2 කඩුලු 2",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "දේවපුරගේ ෂෙහාන් මධුශංක කුමාර හෝ පොදුවේ ෂෙහාන් මධුශංක (උපත 1995 මැයි 10) ජාත්‍යන්තර තරග වලට සීමාසහිතව ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙක් මෙන්ම දකුණත් වේග පන්දු යවන්නෙක්ද වේ. ඔහු වෙන්නප්පුව ජෝශප් වාස් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, දෙමළ සංගමය",
        "career_info": "2018 ජනවාරි මාසයේදී 2017-18 බංග්ලාදේශ තුන්කොන් තරඟාවලිය සඳහා වූ ශ්‍රී ලංකාවේ එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට මධුශංක නම් කරන ලදී. ඔහු 2018 ජනවාරි 27 දින පැවති තුන්කොන් ක්‍රිකට් තරගාවලියේ අවසන් තරඟයේදී බංග්ලාදේශයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින මංගල ජාත්‍යන්තර තරඟය ක්‍රීඩා කළේය"
    },
    {
        "name": "මලින්ද පුෂ්පකුමාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 11, ටෙස්ට් තරග 4 ලකුණු 102",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 2 කඩුලු 1, ටෙස්ට් තරග 4 කඩුලු 14",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පවුලුගේ මලින්ද පුෂ්පකුමාර, පොදුවේ මාලින්ද පුෂ්පකුමාර (උපත 1987 මාර්තු 24) ටෙස්ට් හා එක්දින තරඟ ක්‍රීඩා කරන ශ්‍රී ලාංකික වෘත්තීය ක්‍රීඩකයෙකි. ඔහු පළමු පෙළ ක්‍රිකට් වල කොළඹ ක්‍රිකට් සමාජය වෙනුවෙන් ක්‍රීඩා කරයි. 2019 ජනවාරි මාසයේදී ඔහු පළමු පෙළ ක්‍රිකට් තරඟයකදී ඉනිමක කඩුලු දහයම දවා ගත්තා.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2017 පෙබරවාරි මාසයේදී ඔහු ක්‍රීඩා නොකළ නමුත් බංග්ලාදේශයට එරෙහිව පැවති තරගාවලිය සඳහා ඔහු ශ්‍රී ලංකා ටෙස්ට් සංචිතයට නම් කරන ලදී."
    },
    {
        "name": "සදීර සමරවික්‍රම",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 7 ලකුණු 138, විස්සයි විස්ස තරග 9 ලකුණු 111, ටෙස්ට් තරග 4 ලකුණු 125",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "වෙදගෙදර සදීර රෂේන් සමරවික්‍රම (උපත 1995 අගෝස්තු 30) යනු ක්‍රීඩාවේ සෑම ආකෘතියකින්ම ජාතික කණ්ඩායම නියෝජනය කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු 2014 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානය සඳහා වූ ශ්‍රී ලංකා කණ්ඩායමේ කොටසක් විය. ඔහු කොළඹ ශාන්ත ජෝශප් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, කෝල්ට්ස්",
        "career_info": "සමරවික්‍රම ඒසීසී නැගී එන කණ්ඩායම් ආසියානු කුසලාන 2017 තරඟාවලියේ ශ්‍රී ලංකා කණ්ඩායමේ කොටසක් විය. පාකිස්තානය සමඟ පැවති අඩු ලකුණු තරඟය ජයග්‍රහණය කිරීම සඳහා ඔහු අවසන් තරඟයේදී ලකුණු 45 ක් රැස් කළේය. ශ්‍රී ලංකාව තරඟාවලිය ජයග්‍රහණය කළ පළමු අවස්ථාව මෙය විය."
    },
    {
        "name": "ඩිල්ෂාන් මුණවීර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 15, විස්සයි විස්ස තරග 13 ලකුණු 215",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 2 කඩුලු 0, විස්සයි විස්ස තරග 13 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "එල්ඩේනියා මැදගෙදර ඩිල්ෂාන් රසික මුණවීර, පොදුවේ ඩිල්ෂාන් මුණවීර (උපත 1989 අප්‍රියෙල් 24 කොළඹ), වෘත්තීයමය වශයෙන් ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ජාතික පැත්තට සීමිත ආකෘති ක්‍රීඩා කරයි. ඔහු 2012 ශ්‍රී ලංකාව සඳහා වූ අයිසීසී ලෝක විස්සයි 20 සාමාජිකයෙකි",
        "teams": "ශ්‍රී  ලංකාව, බැරිසල් බුල්ස්",
        "career_info": "මුණවීර බ්ලූම්ෆීල්ඩ් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය වෙනුවෙන් පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩා කර ඇත. ඔහු ශ්‍රී ලංකාව වෙනුවෙන් ජාත්‍යන්තර විස්සයි 20 තරග හතරකට ද ක්‍රීඩා කර තිබේ. ඔහු 2008 අයිසීසී 19 න් පහළ ක්‍රිකට් ලෝක කුසලානයේදී සහ 2010 ආසියානු ක්‍රීඩා උළෙලේදී ශ්‍රී ලංකාව නියෝජනය කළේය."
    },
    {
        "name": "විශ්ව ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 8 ලකුණු 30, විස්සයි විස්ස තරග 1 ලකුණු 2,  ටෙස්ට් තරග 14 ලකුණු 58",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 8 කඩුලු 5, විස්සයි විස්ස තරග 1 කඩුලු 2,  ටෙස්ට් තරග 14 කඩුලු 40",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 48",
        "bat_rank": "",
        "bio": "මුතුතන්ත්‍රිගේ විශ්ව තිළිණ ප්‍රනාන්දු (උපත 1991 සැප්තැම්බර් 18), පොදුවේ විශ්ව ප්‍රනාන්දු ලෙස හැඳින්වෙන, ඔහු ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි, ඔහු ආකෘති තුනෙන්ම ජාතික කණ්ඩායම නියෝජනය කරයි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2017 අගෝස්තු මාසයේදී ඔහු ඉන්දියාවට එරෙහි තරඟාවලිය සඳහා ශ්‍රී ලංකාවේ එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට නම් කරන ලදී. ඔහු 2017 අගෝස්තු 20 දින ඉන්දියාව සමඟ ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර ක්‍රිකට් තරඟය ආරම්භ කළේය. විරාට් කෝලි දැවී ගිය විට ඔහු සිය පළමු එක්දින කඩුල්ල ලබා ගත්තේ තුන්වන තරඟයේදීය. 2017 ඔක්තෝම්බර් මාසයේදී පාකිස්තානයට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා ඔහු ශ්‍රී ලංකා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට නම් කරන ලදී"
    },
    {
        "name": "ළහිරු මධුශංක ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 14, විස්සයි විස්ස තරග 3 ලකුණු 22",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 4 කඩුලු 4, විස්සයි විස්ස තරග 3 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ළහිරු ඩිල්ෂාන් මධුශංක (උපත 1992 සැප්තැම්බර් 12), සීමිත ජාත්‍යන්තර තරඟ සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. දක්ෂ දකුණත් පිතිකරුවෙකු වන මධුශංක දකුණතින් මධ්‍යම වේගයෙන් පන්දු යවයි. ඔහු ඉපදුණේ පොළොන්නරුව ඇලහැර ය. ඔහු මාතලේ ශාන්ත තෝමස් විද්‍යාලයේ පැරණි තෝමියන් ජාතිකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2017 ජනවාරියේදී ඔහු දකුණු අප්‍රිකාවට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා ශ්‍රී ලංකාවේ එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට නම් කරන ලදී. ඔහු 2017 පෙබරවාරි 4 දින දකුණු අප්‍රිකාවට එරෙහිව ජොහැන්නස්බර්ග්හි වැන්ඩරර්ස් ක්‍රීඩාංගණයේදී මංගල එක්දින ජාත්‍යන්තර තරඟය ක්‍රීඩා කළේය."
    },
    {
        "name": "ළහිරු කුමාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 13 ලකුණු 17, විස්සයි විස්ස තරග 7 ලකුණු 5, ටෙස්ට් තරග 22 ලකුණු 52",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 13 කඩුලු 13, විස්සයි විස්ස තරග 7 කඩුලු 6, ටෙස්ට් තරග 22 කඩුලු 68",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 40",
        "bat_rank": "",
        "bio": "චන්ද්‍රදාස බ්‍රහ්මමනා රාලලාගේ ළහිරු සුදේශ් කුමාර, පොදුවේ ළහිරු කුමාර (උපත 13 පෙබරවාරි 1997), ඔහු ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි, ඔහු ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායම සඳහා ක්‍රීඩාවේ තුන් ආකාරයෙන්ම ක්‍රීඩා කරයි.",
        "teams": "ශ්‍රී  ලංකාව, දඹුල්ල වයිකිං",
        "career_info": "2016 ඔක්තෝම්බර් මාසයේදී සිම්බාබ්වේ සංචාරය සඳහා ඔහු ශ්‍රී ලංකා ටෙස්ට් සංචිතය සඳහා තෝරා ගන්නා ලදී. ඔහු 2016 ඔක්තෝබර් 29 දින සිම්බාබ්වේට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය පළමු ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළේය. පීටර් මුවර්ව දවාලමින් ඔහු සිය මංගල ටෙස්ට් කඩුල්ල ලබා ගත්තේය."
    },
    {
        "name": "සඳුන් වීරක්කොඩි",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 3 ලකුණු 73",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "දර්ශනප්‍රිය සඳුන් වීරක්කොඩි (උපත 1993 සැප්තැම්බර් 3) ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ශ්‍රී ලංකාව වෙනුවෙන් එක්දින ජාත්‍යන්තර තරඟ සඳහා ක්‍රීඩා කරයි. වීරක්කොඩි මහනුවර ධර්මරාජ විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි. වමත් පිතිකරුවෙක් සහ කඩුලු රකින්නෙක්,",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2017 ජනවාරියේදී ඔහු දකුණු අප්‍රිකාවට එරෙහිව පැවැත්වෙන තරගාවලිය සඳහා ශ්‍රී ලංකාවේ එක්දින ජාත්‍යන්තර (එක්දින) සංචිතයට නම් කරන ලදී. ඔහු 2017 ජනවාරි 28 දා දකුණු අප්‍රිකාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් එක්දින ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේ ලකුණු 5 ක් ලබා ගනිමිනි. ඔහුගේ පළමු එක්දින අර්ධ ශතකය වාර්තා කළේ ඔහුගේ ක් රීඩා දිවියේ දෙවැනි තරගයේදී වන නමුත් ශ් රී ලංකාව එම තරගය ලකුණු 40 කින් පරාජයට පත් විය"
    },
    {
        "name": "අසේල ගුණරත්න",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 31 ලකුණු 575, විස්සයි විස්ස තරග 12 ලකුණු 225, ටෙස්ට්  තරග 6 ලකුණු 455",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 31 කඩුලු 22, විස්සයි විස්ස තරග 12 කඩුලු 5, ටෙස්ට් තරග 6 කඩුලු 3",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සාමාන්‍යයෙන් අසේල ගුණරත්න (උපත 1986 ජනවාරි 8) ලෙස හැඳින්වෙන දවුන්දෙගෙදර අසේල සම්පත් ගුණරත්න යනු සෑම ආකාරයකම ක්‍රීඩාවක් කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ගුණරත්න යනු කලාතුරකින් මධ්‍ය කාලීන වේග පන්දු යවන ආක්‍රමණශීලී දකුණත් පිතිකරුවෙකි.",
        "teams": "ශ්‍රී  ලංකාව, මහනුවර ටස්කර්ස්, ලාහෝර් ක්ලාන්ඩර්ස්, කොමිලා වික්ටෝරියානු ජාතිකයින්, මුම්බායි ඉන්දියන්ස්",
        "career_info": "2016 පෙබරවාරි මාසයේදී ශ්‍රී ලංකාවේ ඉන්දීය සංචාරය සඳහා වූ විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) සංචිතයට ඔහු තේරී පත් විය. ඔහු 2016 පෙබරවාරි 14 දින ලකුණු 4 ක් ලබා ගනිමින් විස්සයි 20 තරගාවලියට පිවිසියේය. ශ්‍රී ලංකාව කඩුලු 9 කින් තරගය පරාජය විය"
    },
    {
        "name": "අමිල අපොන්සු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 10, විස්සයි විස්ස තරග 3 ලකුණු 0",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 9 කඩුලු 10, විස්සයි විස්ස තරග 3 කඩුලු 4",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මැල්මීගේ අමිල අපොන්සු නොහොත් අමිල අපොන්සු (උපත 1993 ජූනි 23) යනු ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා ක්‍රීඩා කළ වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු රාගම ක්‍රිකට් සමාජය වෙනුවෙන් පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩා කළේය. ඔහු මොරටුව ශාන්ත සෙබස්තියන් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි. 2021 ජූනි මාසයේදී ඇපොන්සෝ මයිනර් ලීග් ක්‍රිකට් තරඟාවලියට ක්‍රීඩා කිරීම සඳහා ඇමරිකා එක්සත් ජනපදයට ගියේය",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඇපොන්සෝ 2015 තරග වාරයේදී 20.9 ක සාමාන්‍යයකින් පළමු පන්තියේ කඩුලු 31 ක් දවා ගත් අතර එම වසර අවසානයේදී නවසීලන්තයට යන ශ්‍රී ලංකා ඒ සංචිතයේ ස්ථානයක් හිමි විය. 2015 සහ 2016 දී දේශීය පිටියේ හොඳ දස්කම් මාලාවකින් පසුව, ශ්‍රී ලංකාවේ ප්‍රධාන දඟ පන්දු යවන රංගන හේරත් සීමිත පන්දුවාර ක්‍රිකට් ක්‍රීඩාවෙන් විශ්‍රාම ගන්නා තෙක් ඔහුට බලා සිටීමට සිදු විය."
    },
    {
        "name": "චමින්ද බණ්ඩාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 1, විස්සයි විස්ස තරග 1 ලකුණු 1",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 1, විස්සයි විස්ස තරග 1 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "චමින්ද බණ්ඩාර (සම්පුර්ණ නම කොනාරා මුදියන්සේලාගේ චමින්ද බණ්ඩාර; උපත 1987 මැයි 22) ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. 2016 ජුනි මාසයේදී එංගලන්තය සමඟ පැවති තුන්වන ටෙස්ට් තරඟය සඳහා ශ්රී ලංකා සංචිතයට ඇතුළත් කරනු ලැබුවේ, දුෂ්මන්ත චමීර ආබාධයෙන් ඉවත් වීමෙනි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2016 ජූලි 2 දින ඔහු ශ්‍රී ලංකාව වෙනුවෙන් එංගලන්තයට එරෙහිව සිය එක්දින ජාත්‍යන්තර (එක්දින) මංගල තරඟය ක්‍රීඩා කළේය. ඔහු ඕවර දහය තුළදී ලකුණු 83 ක් ලබා දුන්නේ හතරේ පහර 11 ක් ලබා දෙමිනි. එක්දින මංගල තරගයේදී ශ්‍රී ලංකා ක්‍රීඩකයෙකු වාර්තා කළ නරකම ලකුණු සංඛ්‍යාව ඔහුගේය."
    },
    {
        "name": "ෂෙහාන් ‍ජයසූරිය",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 12 ලකුණු 195, විස්සයි විස්ස තරග 18 ලකුණු 241",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 12 කඩුලු 3, විස්සයි විස්ස තරග 18 කඩුලු 3",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ගම්පලගේ ෂෙහාන් නවීන්ද්‍ර ද ෆොන්සේකා ගුණවර්ණ ජයසූරිය, නැතහොත් පොදුවේ ෂෙහාන් ජයසූරිය (උපත 1991 සැප්තැම්බර් 12) යනු ශ්‍රී ලංකාවේ දේශීය ක්‍රිකට් ක්‍රීඩාවේ හලාවත මේරියන්ස් කණ්ඩායම වෙනුවෙන් ක්‍රීඩා කළ වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු ඉක්මන් ලකුණු ලබා දෙන වමත් පිතිකරුවෙකු වන අතර දකුණතින් පන්දු යැවීමේ පන්දු යවන්නෙකු ද වේ.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "තුන් ඉරියව් ක්‍රීඩකයෙකු වශයෙන් ජයසූරිය 2015 අගෝස්තු 1 දින පකිස්ථානයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් විස්සයි 20 ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය. ඔහු පන්දු 32 කදී හතරේ පහර 3 ක් සහ හයේ පහර 2 ක් සමඟින් ලකුණු 40 ක් ලබා ගත් අතර ඔහුගේ පළමු ජාත්‍යන්තර කඩුල්ල ලබා ගත්තේ ෂාහිඩ් අෆ්රිඩි දැවී යමින් ය. කෙසේ වෙතත් තරගය පරාජය වූයේ ශ්‍රී ලංකාව පරාජයට පත් කරමිනි"
    },
    {
        "name": "ධනුෂ්ක ගුණතිලක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 44 ලකුණු 1520, විස්සයි විස්ස තරග 27 ලකුණු 542, ටෙස්ට්  තරග 8 ලකුණු 299",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 44 කඩුලු 8, විස්සයි විස්ස තරග 27 කඩුලු 6, ටෙස්ට්  තරග 8 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 51, විස්සයි විස්ස පිතිකරණ ස්ථානය 72",
        "bio": "මෂ්ටායේ ධනුෂ්ක ගුණතිලක (උපත 1991 මාර්තු 17) යනු වෘත්තීයමය වශයෙන් ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ක්‍රීඩාවේ සියලුම ආකෘති ජාත්‍යන්තරව ක්‍රීඩා කරයි. ඔහු ශ්‍රී ලංකාවේ ආරම්භක පිතිකරුවෙකු වන අතර ඔහු හවුල්කරු කුසල් පෙරේරා සමඟ ක්‍රීඩා කරන නමුත් ඉඳහිට තුවාල ලබා කණ්ඩායමෙන් ඉවත් කරනු ලැබේ. විනය ගැටලු හේතුවෙන් ඔහු විටින් විට පැත්තකට වී සිටියේය.",
        "teams": "ශ්‍රී  ලංකාව, ගාල්ල ග්ලැඩියේටර්ස්, සිල්හෙට් සික්සර්ස්",
        "career_info": "ඔහු 2015 නොවැම්බර් 1 වෙනිදා බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර ක්‍රිකට් තරඟය ආරම්භ කළේය. නවසීලන්ත සංචාරයේදී ශ්‍රී ලංකා ඒ කණ්ඩායම සමඟ පැවති ආකර්ෂණීය දස්කම් වලින් පසුව ඔහු 2015 බටහිර ඉන්දීය කොදෙව් කණ්ඩායම සමඟ පැවති දේශීය එක්දින තරගාවලිය සඳහා තෝරා ගන්නා ලදී. එම වසරේම ඉනිම හතරේදී අර්ධ ශතක දෙකක් රැස් කළේය"
    },
    {
        "name": "ජෙෆ්රි වැන්ඩර්සේ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 11 ලකුණු 71, විස්සයි විස්ස තරග 10 ලකුණු 15",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 10 කඩුලු 19, විස්සයි විස්ස තරග 10 කඩුලු 8",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ජෙෆ්රි ඩෙක්ස්ටර් ෆ්‍රැන්සිස් වැන්ඩර්සේ, හෝ සාමාන්‍යයෙන් ජෙෆ්රි වැන්ඩර්සේ (උපත 1990 පෙබරවාරි 5) යනු ශ්‍රී ලාංකික වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු කොළඹ වෙස්ලි විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි",
        "teams": "ශ්‍රී  ලංකාව, ",
        "career_info": "ඔහු 2015 ජුනි මාසයේදී ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ සභාපතිගේ XI සහ පකිස්තානුවන් අතර සංචාරක තරඟයට ක්‍රීඩා කළේය. ඔහු 2015 ජූලි 30 දින පකිස්ථානයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් විස්සයි 20 ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය."
    },
    {
        "name": "සචිත් පතිරණ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 18 ලකුණු 332, විස්සයි විස්ස තරග 5 ලකුණු 27",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 18 කඩුලු 15, විස්සයි විස්ස තරග 5 කඩුලු 5",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සචිත් ශානක පතිරණ (උපත 1989 මාර්තු 21), හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි, ඔහු ජාතික කණ්ඩායම සඳහා ක්‍රීඩා කළ අතර දේශීයව පළමු පන්තියේ, ඒ ඒ සහ විස්සයි 20 තරඟ සඳහා ක්‍රීඩා කළේය. පතිරණ යනු පන්දු යැවීමේ තුන් ඉරියව් ක්‍රීඩකයෙකු වන අතර ඔහු සෙමෙන් වමතින් ඕතඩොක්ස් දඟ පන්දු යවමින් වමතින් පහළ මැද පෙල පිතිකරුවෙකු විය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2015 ජූලි 15 දින පාකිස්තානයට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර (එක්දින) මංගල තරඟය ක්‍රීඩා කළේය. ඔහු ලකුණු 54 කට කඩුලු 2 ක් දවා ගත්තේය. දිනේෂ් චන්දිමාල් සමඟ එක්ව ඔවුන් ලකුණු 50 ක සබඳතාවක් ගොඩ නැගූ අතර එමඟින් තරඟය ජයග්‍රහණය කිරීමට ශ්‍රී ලංකාවට හැකි විය. පතිරණ සිය පළමු තරගයේදී ලකුණු 33 ක් රැස් කළේය"
    },
    {
        "name": "මිලින්ද සිරිවර්ධන",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 27 ලකුණු 298, ටෙස්ට්  තරග 5 ලකුණු 516",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 27 කඩුලු 11, ටෙස්ට්  තරග 5 කඩුලු 11",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "තිස්ස අප්පුහාමිලාගේ මිලින්ද සිරිවර්ධන, පොදුවේ මිලින්ද සිරිවර්ධන (උපත 1985 දෙසැම්බර් 4) යනු සීමිත ආකෘති සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු වමත් පිතිකරුවෙක් සහ වමත් දඟ පන්දු යවන්නෙක්. ඔහු ටෙස්ට්, එක්දින, විස්සයි 20 තරඟ සඳහා ශ්‍රී ලංකාව සහ දේශීය පන්තියේ පළමු පන්තිය සහ ඒ ලැයිස්තුව ක්‍රීඩා කරයි",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2015 ජූලි 11 වෙනිදා මිලින්ද සිය මංගල එක්දින ජාත්‍යන්තර (එක්දින) තරඟය රංගිරි දඹුලු ජාත්‍යන්තර ක්‍රීඩාංගණයේදී පකිස්ථානයට එරෙහි එක්දින ක්‍රිකට් තරගාවලියේදී ක්‍රීඩා කළේය."
    },
    {
        "name": "තරිඳු කෞෂාල්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 0, ටෙස්ට් තරග 7 ලකුණු 106",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 0, ටෙස්ට් තරග 7 කඩුලු 25",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පාස්කුවල් හන්දි තරිඳු කෞෂාල් (උපත 1993 මාර්තු 5) ජාත්‍යන්තර මට්ටමේ එක්දින සහ ටෙස්ට් තරඟ සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පන්දු යැවීමේ පන්දු යවන්නෙකු වන අතර ඔහු දකුණතින් පන්දුවට පහර දෙයි. [1] ඔහු රත්ගම දේවපතිරාජ විද්‍යාලයේ ආදි ශිෂ්‍යයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු සිය මංගල ටෙස්ට් ක්‍රිකට් තරඟය ආරම්භ කළේ 2014 දෙසැම්බර් 26 දින නවසීලන්තයට එරෙහිවය."
    },
    {
        "name": "නිරෝෂන් දික්වැල්ල",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 53 ලකුණු 1578, විස්සයි විස්ස තරග 28 ලකුණු 480, ටෙස්ට් තරග 45 ලකුණු 2443",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "එක් දින ජාත්‍යන්තර පිතිකරණ ස්ථානය 63, වටෙස්ට් පිතිකරණ ස්ථානය 31",
        "bio": "දික්වැල්ල පටබැඳිගේ දිලන්ත නිරෝෂන් දික්වැල්ල, නිරෝෂන් දික්වැල්ල (උපත 1993 ජුනි 23), ඔහු ශ්‍රී ලංකාව සඳහා ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. වමත් පිතිකරුවෙකු වන ඔහු කණ්ඩායමේ කඩුලු රකින්නෙකු ලෙසද ක්‍රීඩා කරයි. දික්වැල්ල වමත් ඩිල්ස්කූප් වලට පහර දීම ගැන ප්‍රසිද්ධය.",
        "teams": "ශ්‍රී  ලංකාව, දඹුල්ල වයිකිං",
        "career_info": "ඔහු 2014 ජූලි මාසයේදී දකුණු අප්‍රිකාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය පළමු ටෙස්ට් ක්‍රිකට් තරඟය ආරම්භ කළේය. ඔහු 2014 නොවැම්බර් 16 දින ඉන්දියාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර ක්‍රිකට් තරඟය ආරම්භ කළේය. ඔහු පෙබරවාරි 9 වන දින ඉන්දියාවට එරෙහිව ශ්‍රී ලංකාව සඳහා විස්සයි 20 ජාත්‍යන්තර (විස්සයි 20) මංගල තරඟය ආරම්භ කළේය. 2016"
    },
    {
        "name": "ළහිරු ගමගේ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 4, ටෙස්ට් තරග 5 ලකුණු 6",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 9 කඩුලු 9, ටෙස්ට් තරග 5 කඩුලු 10",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පනාගමුව ළහිරු සම්පත් ගමගේ (උපත 1988 අප්‍රියෙල් 5), නැතහොත් පොදුවේ ළහිරු ගමගේ යනු ටෙස්ට් හා එක්දින ජාත්‍යන්තර (එක්දින) තරග සඳහා ජාතික කණ්ඩායමට ක්‍රීඩා කරන ශ්‍රී ලාංකික වෘත්තීය ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙකු වන අතර දකුණත් වේග පන්දු යැවීම වේගවත් කරයි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2014 නොවැම්බර් 2 වන දින ඉන්දියාවට එරෙහිව ශ්‍රී ලංකාව වෙනුවෙන් සිය එක්දින ජාත්‍යන්තර තරඟය ආරම්භ කළේය. 2015 පාකිස්තාන එක්දින ක්‍රිකට් තරගාවලියේදී ලසිත් මාලිංගගේ දුර්වල දස්කම් හේතුවෙන් නුවන් ප්‍රදීප්ට ඇති වූ ආබාධයක් හේතුවෙන් ගමගේ අවසන් එක්දින තරඟය සඳහා කණ්ඩායමට කැඳවාගෙන එන ලදි."
    },
    {
        "name": " කිත්රුවන් විතානගේ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 6 ලකුණු 75, ටෙස්ට් තරග 9 ලකුණු 361",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 6 කඩුලු 9,ටෙස්ට් තරග 9 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කසුන් දිසි කිත්රුවන් විතානගේ (උපත 1991 පෙබරවාරි කොළඹ), හෝ පොදුවේ කිත්රුවන් විතානගේ යනු ජාත්‍යන්තර මට්ටමේ සෑම ආකාරයකම ක්‍රීඩාවන් සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු වමත් පිතිකරුවෙක් සහ කකුල් කඩන පන්දු යවන්නෙක්",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2013 මාර්තු 8 වන දින බංග්ලාදේශයට එරෙහිව ගාල්ල සහ 2013 දෙසැම්බර් 25 දින අබුඩාබි හිදී පාකිස්ථානයට එරෙහිව එක්දින ජාත්‍යන්තර මංගල තරඟය සඳහා ශ්‍රී ලංකාව වෙනුවෙන් සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය. ඔහු සිය මංගල ටෙස්ට් තරගයේදී ලකුණු 59 ක් සහ එක්දින මංගල තරගයේදී ලකුණු 27 ක් රැස් කළේය"
    },
    {
        "name": "චතුරංග ද සිල්වා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 7 ලකුණු 94, විස්සයි විස්ස තරග 2 ලකුණු 22",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 7 කඩුලු 5, විස්සයි විස්ස තරග 2 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "පින්නදූවගේ චතුරංග ද සිල්වා (උපත 1990 ජනවාරි 17) නොහොත් චතුරංග ද සිල්වා යනු ශ්‍රී ලංකාව සඳහා සීමිත ජාත්‍යන්තර තරඟ සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු මූලික වශයෙන් වමත් පිතිකරුවෙකු වන නමුත් පන්දු යැවීමේදී සෙමින් වමත් ඕතඩොක්ස් ක්‍රීඩකයෙකි. ඔහු සීමාසහිත ජාත්‍යන්තර තරඟ කිහිපයකදී ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම නියෝජනය කර ඇත.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ද සිල්වා මුලින්ම තෝරා ගනු ලැබුවේ දකුණු අප්‍රිකාවට එරෙහි තරඟාවලිය සඳහා වන ශ්‍රී ලංකා සංචිතයේ ය. ඔහු 2014 පෙබරවාරි 25 දින ආසියානු කුසලාන ක්‍රිකට් තරගාවලියේදී ශ්‍රී ලංකාව සහ පාකිස්ථානය අතර එක්දින ජාත්‍යන්තර ක්‍රිකට් තරගයට ක්‍රීඩා කළේය. ඔහු කඩුලු 4 ක් දවාලීය. ඔහු බංග්ලාදේශයට එරෙහිව ලකුණු 44 ක් රැස් කළේය"
    },
    {
        "name": " අශාන් ප්‍රියංජන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 23 ලකුණු 440, විස්සයි විස්ස තරග 3 ලකුණු 54",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 23 කඩුලු 5, විස්සයි විස්ස තරග 3 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සුබසිංහ මුදියන්සේලාගේ අශාන් ප්‍රියංජන් (උපත 1989 අගෝස්තු 14) සීමිත ඕවර ආකෘති වලින් ජාතික කණ්ඩායම වෙනුවෙන් ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු මැදපෙළ පිතිකරුවෙකු වන අතර ඉඳහිට දකුණත් මැද වේග පන්දු යවන්නෙකු ද වේ.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ප්‍රියංජන් 2013 දෙසැම්බර් 25 දින ශ්‍රී ලංකාව වෙනුවෙන් 157 වන එක්දින ක්‍රිකට් තරඟය ලෙස මංගල එක්දින තරඟය ආරම්භ කළ අතර පාකිස්ථානයට එරෙහිව අබුඩාබි හිදී ඔහුගේ මංගල මංගල තරගයේදී ලකුණු 74 ක් රැස් කළේය. මෙම ලකුණු සංඛ්‍යාව ශ්‍රී ලංකා මංගල ක්‍රීඩකයෙකුගේ එක්දින වැඩිම ලකුණු සංඛ්‍යාව ලෙස වාර්තා වේ"
    },
    {
        "name": "ඇන්ජලෝ පෙරේරා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 6 ලකුණු 52, විස්සයි විස්ස තරග 6 ලකුණු 59",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ඇන්ජලෝ කණිෂ්ක පෙරේරා (උපත 1990 පෙබරවාරි 23), හෝ ඇන්ජලෝ පෙරේරා යනු ක්‍රිකට් වලට සීමා සහිතව ක්‍රීඩා කරන, වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙකු වන අතර නොන්ඩිස් ක්‍රිප්ට් ක්‍රිකට් සමාජය සඳහා ක්‍රීඩා කරන වමත් වේග පන්දු යවන්නෙකු වේ. ඔහු මොරටුවේ ඉපිද කොළඹ ශාන්ත පීතර විද්‍යාලයට ඇතුළත් විය.",
        "teams": "ශ්‍රී  ලංකාව, සදර්න් එක්ස්ප්‍රස්",
        "career_info": "පෙරේරා 2013 දී බංග්ලාදේශයට එරෙහිව විස්සයි 20 තරගයට පිවිසියේය. එම වසරේම ඔහු දකුණු අප්‍රිකාවට එරෙහිව පල්ලෙකැලේ ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාංගණයේදී සිය එක්දින ජාත්‍යන්තර ක්‍රිකට් තරගය ආරම්භ කළේය. උඩු යටිකුරු කිරීම් වලින් පසු පෙරේරා ඔස්ට්‍රේලියාවට එරෙහි එක්දින සංචිතය කැඳවූ අතර එහිදී ඔහු දඹුල්ලේදී සිව්වන එක්දින තරඟයට ක්‍රීඩා කළේය."
    },
    {
        "name": "නුවන් ප්‍රදීප්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 47 ලකුණු 30, විස්සයි විස්ස තරග 15 ලකුණු 10, ටෙස්ට් තරග 28 ලකුණු 132",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 47 කඩුලු 59, විස්සයි විස්ස තරග 15 කඩුලු 15,  ටෙස්ට් තරග 28 කඩුලු 70",
        "ball_rank": "එක් දින ජාත්‍යන්තර පන්දු යැවීමේ ස්ථානය 59, විස්සයි විස්ස පන්දු යැවීමේ ස්ථානය 51",
        "bat_rank": "",
        "bio": "අත්තච්චි නුවන් ප්‍රදීප් රොෂාන් ප්‍රනාන්දු (උපත 1986 ඔක්තෝබර් 19) නුවන් ප්‍රදීප් ලෙස හැඳින්වෙන අතර ඔහු ක්‍රීඩාවේ ආකෘති තුනම ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ජාතික ක්‍රිකට් ක්‍රීඩකයෙකු වුවද, ඔහු වයස අවුරුදු 20 වන තෙක් කිසි දිනෙක ක්‍රීඩාව ක්‍රීඩා කර නැති අතර වැදගත්ම දෙය නම් ඔහුගේ 20 වන තෙක් ලෙදර් බෝලයෙන් ක්‍රීඩා නොකළ බවයි.",
        "teams": "ශ්‍රී  ලංකාව,මහනුවර ටස්කර්ස්, රුහුණු",
        "career_info": "2010 දී ඉන්දියාවට එරෙහි දෙවන ටෙස්ට් තරඟය සඳහා ප්‍රදීප් ශ්‍රී ලංකා සංචිතයට කැඳවනු ලැබීය. 2011 එංගලන්ත සංචාරය සඳහා වූ තාවකාලික සංචිතයට ඔහු තේරී පත් වූ අතර එංගලන්ත ලයන්ස් සමඟ පැවති උණුසුම් තරගයේදී ඔහු ලකුණු 4/29 ක් ලබා ගත් අතර එමඟින් ශ්‍රී ලංකාව ලකුණු 38 කින් ජයග්රහණය කළේය."
    },
    {
        "name": "සජීව වීරකෝන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 2 ලකුණු 0",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 2 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සජීව වීරකෝන් (උපත 1978 පෙබරවාරි 17, ගාල්ලේ), ශ්‍රී ලංකාවේ හිටපු එක්දින ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු ශ්‍රී ලංකාව ඒ නියෝජනය කළ සෙමින් වමත් ඕතඩොක්ස් පන්දු යවන්නෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු දේශීය පිටියේ හොඳ වාර්තාවක් තිබුණද ජාත්‍යන්තර කණ්ඩායමට ඔහුගේ වටිනාකම ඔප්පු කිරීමට නොහැකි විය. ඔහු පාකිස්තානයට එරෙහිව 2012 දී කොළඹදී සිය එක්දින මංගල ජාත්‍යන්තර තරගය ආරම්භ කළේය"
    },
    {
        "name": "සචිත්‍ර සේනානායක",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 49 ලකුණු 290, විස්සයි විස්ස තරග 24 ලකුණු 56",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 49 කඩුලු 53, විස්සයි විස්ස තරග 24 කඩුලු 25",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සේනානායක මුදියන්සේලාගේ සචිත්‍ර මධුශංක සේනානායක, සාමාන්‍යයෙන් සචිත්‍ර සේනානායක (උපත 1985 පෙබරවාරි 9) නමින් හැඳින්වෙන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ක්‍රීඩාවේ ආකෘති තුනම ක්‍රීඩා කරන අතර ගායිකාවක් ද වේ. ඔහු දැනට සීමිත ඕවර ක්‍රිකට් ක්‍රීඩා කරන පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, කොල්කටා නයිට් රයිඩර්ස්",
        "career_info": "සේනානායක 2012 ජනවාරි මාසයේදී දකුණු අප්‍රිකානු සංචාරයේ සිව්වන එක්දින ජාත්‍යන්තර තරඟයේදී ශ්‍රී ලංකාව වෙනුවෙන් ජාත්‍යන්තරව මංගල තරඟය ආරම්භ කළේය. එතැන් සිට ඔහු අජන්ත මෙන්ඩිස් සමඟ සීමිත ඕවර ක්‍රිකට් තරග වලදී ශ්‍රී ලංකා දඟ පන්දු යැවීමේ නිත්ය සාමාජිකයෙකු විය. සීක්කුගේ ප්‍රසන්න. සැක සහිත පන්දු යැවීමකින් පසු පසුකාලීන ද්විපාර්ශ්වික තරඟාවලි වලදී ඔහු දුර්වල පන්දු යැවීමක් පෙන්නුම් කළේය."
    },
    {
        "name": "කෝසල කුලසේකර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 22, ටෙස්ට් තරග 1 ලකුණු 22",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 4 කඩුලු 0, ටෙස්ට් තරග 1 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "චමිත් කෝසල බණ්ඩාර කුලසේකර (උපත 1985 ජූලි 15, මාවනල්ලේ) ටෙස්ට් හා එක්දින තරඟ ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු තුන් ඉරියව් ක්‍රීඩකයෙකු වන අතර දකුණතින් පිතිහරඹ කරන අතර දකුණත් වේග පන්දු යවන ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු එක් ටෙස්ට් තරඟයකට ක්‍රීඩා කර ඇති අතර එහිදී ඔහු පාකිස්ථානයට එරෙහිව 2011 දී සාජා හිදී සිය මංගල දර්ශනය ආරම්භ කළේය. ඔහු 2011 නොවැම්බර් 11 දින ඩුබායි හිදී පාකිස්තානයට එරෙහිව එම සංචාරයේදී මංගල එක්දින ජාත්යන්තර තරඟය ආරම්භ කළේය."
    },
    {
        "name": "සීක්කුගේ ප්‍රසන්න ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 40 ලකුණු 421, විස්සයි විස්ස තරග 20 ලකුණු 214,ටෙස්ට් තරග 1 ලකුණු 5",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 40 කඩුලු 32, විස්සයි විස්ස තරග 20 කඩුලු 10, ටෙස්ට් තරග 1 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "සීක්කුගේ ප්‍රසන්න (උපත 1985 ජූනි 27) සීමිත ඕවර ක්‍රිකට් ක්‍රීඩාවක් සඳහා ක්‍රීඩා කරන වෘත්තීයමය ශ්‍රී ලාංකික ක්‍රීඩකයෙකි. ඔහු ශ්‍රී ලංකා යුද හමුදාවේ වරෙන්තු නිලධාරියෙකි. ප්‍රසන්න එක්දින තරඟ වල ප්‍රමාද ඕවරයන්හි ආක්‍රමණශීලී පිතිහරඹය සඳහා ප්‍රසිද්ධියක් උසුලන අතර, ප්‍රයෝජනවත් කකුල දඟ පන්දු යවන්නෙකු වන අතර සමහර විට එය හිටපු ශ්‍රී ලංකා පා දඟ පන්දු යවන උපුල් චන්දනගෙන් පසුව සොයා ගත හැකි හොඳම දෙයයි.",
        "teams": "ශ්‍රී  ලංකාව, ට්‍රින්බැගෝ නයිට් රයිඩර්ස්, මහනුවර ටස්කර්ස්, ලාහෝර් ක්ලාන්ඩර්ස්, ඩකා ඩයිනමයිට්ස්, සදර්න් එක්ස්ප්‍රස්",
        "career_info": "2011 සැප්තැම්බර් 8 දින ඕස්ට්‍රේලියාවට එරෙහිව පල්ලෙකැලේ ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාංගණයේදී ප්‍රසන්න සිය මංගල ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළේය. 2011 දී එම තරග මාලාවේදීම ඕස්ට්‍රේලියාවට එරෙහිව එක්දින මංගල දර්ශනය පැමිණියේය. ඔහුගේ පන්දුවාර 20 යි 20 ජාත්‍යන්තර මංගල තරඟය පකිස්ථානයට එරෙහිව එක්සත් අරාබි එමීර් රාජ්‍යයේදී 2013 දී සිදු විය"
    },
    {
        "name": "ශමින්ද එරංග",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 19 ලකුණු 34, විස්සයි විස්ස තරග 3 ලකුණු 6, ටෙස්ට් තරග 19 ලකුණු 193",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 19 කඩුලු 21, විස්සයි විස්ස තරග 3 කඩුලු 3,ටෙස්ට් තරග 19 කඩුලු 57",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "රණවීර මුදියන්සේලාගේ ශමින්ද එරංග (උපත 1986 ජුනි 23), හෝ ෂමින්ද එරංග, ශ්‍රී ලංකාවේ වෘත්තීය ක්රීඩකයෙක් වන අතර ඔහු ක්රීඩාවේ සියලු හැඩතල වලට ක්රීඩා කරයි. ඔහු ඉගෙනුම ලැබුවේ හලාවත ශාන්ත මරියා විද්‍යාලයේ ය.",
        "teams": "ශ්‍රී  ලංකාව,හලාවත මේරියන්ස්",
        "career_info": "2011 අගෝස්තු 16 දින හම්බන්තොට මහින්ද රාජපක්ෂ ජාත්‍යන්තර ක්‍රීඩාංගණයේදී ඕස්ට්‍රේලියාවට එරෙහිව ශමින්ද ශ්‍රී ලංකාව වෙනුවෙන් එක්දින ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය."
    },
    {
        "name": " චානක වෙලගෙදර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 10 ලකුණු 4, විස්සයි විස්ස තරග 2 ලකුණු 2, ටෙස්ට් තරග 21 ලකුණු 218",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 10 කඩුලු 15, විස්සයි විස්ස තරග 2 කඩුලු 1,ටෙස්ට් තරග 21 කඩුලු 55",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "උඩ වලව්වේ මාහිම් බණ්ඩාරලාගේ චානක අසංක වෙලගෙදර, පොදුවේ චානක වෙලගෙදර, (සිංහල: චානක වෙලගෙදර; උපත 1981 මාර්තු 20, මාතලේ), ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කළ හිටපු ශ්‍රී ලාංකික ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව, දෙමළ සංගමය",
        "career_info": "2007 දෙසැම්බර් 18 දින ඔහු සිය පළමු ටෙස්ට් තරඟය එංගලන්තයට එරෙහිව ගාල්ලේ පැවති තුන්වන ටෙස්ට් තරඟයේදී ආරම්භ කළේය. වෙලගෙදර 2008 බටහිර ඉන්දීය කොදෙව් සංචාරය සඳහා ශ්‍රී ලංකා ටෙස්ට් සංචිතයට තේරී පත් වූ නමුත් ඉන්දියාවට එරෙහිව පැමිණි ඔහුගේ දෙවන ටෙස්ට් තරගය සඳහා 2009 නොවැම්බර් දක්වා බලා සිටීමට සිදු වූ අතර එම තරගාවලියේ ටෙස්ට් තරග තුනම ක්‍රීඩා කිරීමට ඔහු සමත් විය."
    },
    {
        "name": "සුරාජ් රන්දිව්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 31 ලකුණු 280, විස්සයි විස්ස තරග 7 ලකුණු 8, ටෙස්ට් තරග 12 ලකුණු 147",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 31 කඩුලු 36, විස්සයි විස්ස තරග 7 කඩුලු 7,ටෙස්ට් තරග 12 කඩුලු 43",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "හේවා කළුහමුල්ලගේ සුරාජ් රන්දිව් කළුහලමුල්ල (උපත 1985 ජනවාරි 30), කලින් මොහොමඩ් මර්ෂුක් මොහොමඩ් සුරාජ්, සුරාජ් රන්දිව් ලෙස ප්‍රසිද්ධව සිටි, හිටපු වෘත්තීය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ක්‍රීඩාවේ සෑම ආකෘතියක්ම ක්‍රීඩා කළේය. ඔහු සිංහල ක්‍රීඩා සමාජය වෙනුවෙන් පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩා කරයි.",
        "teams": "ශ්‍රී  ලංකාව, චෙන්නායි සුපර් කිංග්ස්, රුහුණු රයිනෝස්",
        "career_info": "2009 දෙසැම්බරයේදී ඔහු මුත්තයියා මුරලිදරන් වෙනුවට ශ්‍රී ලංකාවේ ඉන්දියාවේ එක්දින සංචිතයට කැඳවා තිබූ අතර ඔහු නාග්පූර්හි පැවති තරගාවලියේ දෙවන තරඟයට සහභාගී විය. ලකුණු 51 කට කඩුලු 3 ක් දවා ගැනීමෙන් ඔහු පුදුමයට පත් විය. ශ්‍රී ලංකාව කඩුලු තුනකින් තරගය ජයග්‍රහණය කළේය"
    },
    {
        "name": "තිලාන් තුෂාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 38 ලකුණු 392, විස්සයි විස්ස තරග 6 ලකුණු 4, ටෙස්ට් තරග 10 ලකුණු 94",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 38 කඩුලු 50, විස්සයි විස්ස තරග 6 කඩුලු 7,ටෙස්ට් තරග 10 කඩුලු 28",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මැගිනා තිලාන් තුෂාර මිරැන්ඩෝ; (උපත 1981 මාර්තු 1), නැතහොත් තිලාන් තුෂාර යනු ක්‍රීඩාවේ සියලුම ආකෘති ක්‍රීඩා කළ හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු වමත් පිතිකරුවෙක් වන අතර වමත් මධ්‍ය වේග පන්දු යවන්නෙක්.",
        "teams": "ශ්‍රී  ලංකාව,සිංගා ක්‍රීඩා සමාජය",
        "career_info": "ඔහු එම තරග මාලාවට ක්‍රීඩා නොකළ නමුත් 2003 දී බටහිර ඉන්දීය කොදෙව් සංචාරය කිරීමේ සාදයේදී ඔහුගේ මංගල ටෙස්ට් තරගය ආරම්භ කළේය. නමුත් ඔහු එම තරග මාලාවේදී වැඩි සාර්ථකත්වයක් අත්කර ගැනීමට නොහැකි වුනේ ඔහු වැඩි ලකුණු ලබා නොගැනීම සහ කිසිදු කඩුල්ලක් ලබා නොගැනීම නිසා පාර අයිනේ විසිවී ගිය බැවිනි."
    },
    {
        "name": "මහේල උඩවත්ත",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 257, විස්සයි විස්ස තරග 8 ලකුණු 96, ටෙස්ට් තරග 2 ලකුණු 23",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මහේල උඩවත්ත ලෙස හැඳින්වෙන මහේල ලක්මාල් උඩවත්ත (උපත 1986 ජූලි 19, කොළඹ) ශ්‍රී ලංකාවේ වෘත්තීය මට්ටමේ ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු 2008 දී මංගල තරග මාලාවේ ආරම්භක පිතිකරුවෙකු ලෙස ක්‍රීඩා කළ අතර එය 2017 දී නැවත පැමිණීම සඳහා මැද පෙළ පිතිකරුවෙකු බවට පත්විය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2008 අප්‍රේල් මාසයේදී බටහිර ඉන්දීය කොදෙව් සංචාරය සඳහා වූ ශ්‍රී ලංකා එක්දින සංචිතය සඳහා ඔහු තෝරා ගනු ලැබූ අතර එක්දින තරග තුනටම ක්‍රීඩා කළේය. එක්දින තරග 9 කදී අර්ධ ශතක 2 ක් පමණක් ලබා සිටි උඩවත්ත 2009 අවසානයේදී සංචිතයෙන් ඉවත් කරන ලදී. වසර 9 කට පසු, පාකිස්තානයට එරෙහි තරඟ 3 කින් සමන්විත විස්සයි 20 සංචිතයට ඔහුව නැවත කැඳවන ලදි. ලාහෝර්හිදී පැවැත්වෙන තුන්වන T20 තරඟය සඳහා පකිස්ථානයේ සංචාරය කරන්න"
    },
    {
        "name": "දිල්රුවන් පෙරේරා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 13 ලකුණු 152, විස්සයි විස්ස තරග 3 ලකුණු 1, ටෙස්ට් තරග 41 ලකුණු 1155",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 13 කඩුලු 30, විස්සයි විස්ස තරග 3 කඩුලු 3,ටෙස්ට් තරග 41 කඩුලු 156",
        "ball_rank": "ටෙස්ට් පන්දු යැවීමේ ස්ථානය 39",
        "bat_rank": "",
        "bio": "මහවදුගේ දිල්රුවන් කමලනෙත් පෙරේරා (උපත 1982 ජූලි 22) යනු දැනට ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකු වන අතර ඔහු දැනට ටෙස්ට් හා එක්දින තරඟ සඳහා ක්‍රීඩා කරයි. ඔහු කෝල්ට්ස් ක්‍රිකට් සමාජය සඳහා දේශීයව ක්‍රීඩා කරයි. තුන් ඉරියව් ක්‍රීඩකයෙකු වන පෙරේරා දකුණතින් පිති හරින පන්දු යවන්නෙකු සහ දකුණත් පිතිකරුවෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2007 ඔක්තෝබර් 13 දින පෙරේරා එංගලන්තයට එරෙහිව කොළඹදී සිය එක්දින මංගල තරඟය ආරම්භ කළේය. පිතිහරඹය ආරම්භ කරමින් ඔහු ලකුණු 30. 2014 ජනවාරි 16 දින සාජා හිදී පාකිස්තානයට එරෙහිව සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය. අංක 8 ට පන්දුවට පහර දෙමින් ඔහු ශ්‍රී ලංකාවේ පළමු ඉනිමේදී ලකුණු 95 ක් ලබා වැඩිම ලකුණු ලාභියා විය"
    },
    {
        "name": "මලින්ද වර්ණපුර ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 3 ලකුණු 35, ටෙස්ට් තරග 14 ලකුණු 821",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 3 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "බස්නායක ශලිත් මලින්ද වර්ණපුර (උපත 1979 මැයි 26) නොහොත් මලින්ද වර්ණපුර යනු ටෙස්ට් තරග 14 කට සහ එක්දින ජාත්‍යන්තර තරග තුනකට ක්‍රීඩා කළ හිටපු ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු වමත් පිතිකරුවෙකු වන අතර දකුණත් පන්දු යැවීමේ පන්දු යවන්නෙක්.",
        "teams": "ශ්‍රී  ලංකාව, කොළඹ ක්‍රිකට් සමාජය",
        "career_info": "මලින්ද 2007 මැයි 20 දින බංග්ලාදේශයට එරෙහිව සිය මංගල එක්දින ජාත්‍යන්තර තරඟය ආරම්භ කළ අතර එම තරගමාලාවේදීම ඔහුගේ මංගල ටෙස්ට් තරඟය 2007 ජූනි 25 දින සිදු විය. බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව පළමු ඉනිමේදී ලකුණු 120 ක් ලබාගත් මලින්ද ඔහුගේ තුන්වන ටෙස්ට් තරගයේදී සිය පළමු ටෙස්ට් ශතකය වාර්තා කළේය."
    },
    {
        "name": "ඉෂාරා අමරසිංහ ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 8 ලකුණු 6, ටෙස්ට් තරග 1 ලකුණු 0",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 8 කඩුලු 9, ටෙස්ට් තරග 1 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මෙරෙනා කෝරලගේ දොන් ඉෂාරා අමරසිංහ (උපත 1978 මාර්තු 5) නොහොත් ඉෂාරා අමරසිංහ යනු කොළඹ නාලන්දා විද්‍යාලයට ඇතුළත් වූ ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩිකාවකි. දක්ෂිනාංශික වේගපන්දු යවන ක්‍රීඩකයෙකු වන අමරසිංහ 2007 ලෝක කුසලානය සඳහා 30 දෙනෙකුගෙන් සමන්විත පළාත් සංචිතයට ඇතුළත් විය.",
        "teams": "ශ්‍රී  ලංකාව, ගාල්ල ක්‍රිකට් සමාජය",
        "career_info": "ඔහු ලසිත් මාලිංගට පිටුපසින් ලංකාවේ දෙවන වේගවත්ම පන්දු යවන්නා විය හැකිය. කැරිබියන් දූපතට නොපැමිණියත් ඔහු පකිස්ථානයට එරෙහිව අබුඩාබි හිදී පැවති ලෝක කුසලාන තරඟාවලියෙන් පසු පැවති ශ්‍රී ලංකා සංචිතයට තෝරා ගන්නා ලදී."
    },
    {
        "name": "ධම්මික ප්‍රසාද්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 24 ලකුණු 129, විස්සයි විස්ස තරග 1 ලකුණු 0, ටෙස්ට් තරග 25 ලකුණු 476",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 24 කඩුලු 32, විස්සයි විස්ස තරග 1 කඩුලු 0,ටෙස්ට් තරග 25 කඩුලු 47",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කාරියවසම් ටිරානා ගමගේ ධම්මික ප්‍රසාද් (උපත 1983 මැයි 30 රාගම), නැතහොත් සරලව ධම්මික ප්‍රසාද් යනු ශ්‍රී ලංකාවේ හිටපු ක්‍රිකට් ක්‍රීඩකයෙකි, ඔහු සියලු ආකාර ක්‍රීඩාවන් ක්‍රීඩා කළේය. ඔහු දකුණත් වේග පන්දු යවන්නෙක්.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2006 පෙබරවාරි මාසයේදී ඔහු බංග්ලාදේශ සංචාරය සඳහා වූ ශ්‍රී ලංකාවේ එක්දින සහ ටෙස්ට් කණ්ඩායම් සඳහා කැඳවනු ලැබුවේ දේශීය පළමු පෙළ ක්‍රිකට් ක්‍රීඩාවේදී එක් කඩුල්ලකට ලකුණු 23 කටත් වඩා අඩු සාමාන්‍යයක් ලබා දෙමිනි. චිතගොංහිදී බංග්ලාදේශයට එරෙහිව ලකුණු 78 ක ජයක් ලබා 2/29 ලබා ගනිමින් ඔහු එම සංචාරයේදී සිය එක්දින මංගල ජාත්‍යන්තර තරඟය ආරම්භ කළේය."
    },
    {
        "name": "මයිකල් වැන්ඩෝර්ට්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 48, ටෙස්ට් තරග 20 ලකුණු 1144",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 1 කඩුලු 0, ටෙස්ට් තරග 20 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මයිකල් ග්‍රේඩන් වැන්ඩෝර්ට් (උපත 1980 ජනවාරි 19 කොළඹ) ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු වමත් පිතිකරුවෙකු වන අතර දකුණත් මැද වේග පන්දු යවන්නෙකු ද වේ. ඔහු මෙතෙක් ටෙස්ට් ක්‍රිකට් ක්‍රීඩා කළ උසම පිතිකරුවන්ගෙන් කෙනෙකු වන අතර අඩි 6 අඟල් 5 ක් උසයි.",
        "teams": "ශ්‍රී  ලංකාව, වයඹ",
        "career_info": "ආකර්ෂණීය සමාජ දස්කම් වලින් පසුව 2001 දී මතු වූ ඔහු ආකර්ෂණීය ශතකයකට පසු 2001 සැප්තැම්බර් මාසයේදී බංග්ලාදේශයට එරෙහිව තෝරා ගන්නා ලදී. ඔහුගේ ටෙස්ට් සාමාන්‍යය 36.90 කි. 2006 මැයි 28 දින එංගලන්තය හමුවේ ශ්‍රී ලංකාව පරාජය වීමේදී ඔහු ශතකයක් වාර්තා කළේය."
    },
    {
        "name": "මාලිංග බණ්ඩාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 31 ලකුණු 160, ටෙස්ට් තරග 8 ලකුණු 124",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 31 කඩුලු 36, ටෙස්ට් තරග 8 කඩුලු 16",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මාලිංග බණ්ඩාර ලෙස පොදුවේ හඳුන්වන හේරත් මුදියන්සේලාගේ චරිත මාලිංග බණ්ඩාර (උපත 1979 දෙසැම්බර් 31), සියලු හැඩතල ක්‍රීඩා කළ හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙකු වන අතර කකුල් බිඳීම් ද සිදු කරයි. ඔහු ඉගෙනුම ලැබුවේ කළුතර විද්‍යාලයේ ය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "1998 දී නවසීලන්තයට එරෙහිව බණ්ඩාර සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළ නමුත් දුර්වල ලෙස ක්‍රීඩා කළ අතර පසුව එය අතහැර දැමීය. 2005 මාර්තු මාසයේදී එංගලන්ත ‘ඒ’ කණ්ඩායමට එරෙහිව ප්‍රයෝජනවත් දස්කම් දැක්වීමක් (126 ට එකොළොස් දෙනෙකුගේ ලකුණු සංඛ්‍යාව තහවුරු කර ගැනීම) දෙසැම්බර් මාසයේදී ටෙස්ට් කැඳවීමක් ලැබීමට හේතු විය. ඔහු ඉන්දියාව සමඟ පැවති ටෙස්ට් තරග තුනම කඩුලු 9 ක් සමඟින් සාමාන්‍යයෙන් 32.88 ක සාමාන්‍යයකින් අවසන් කළේය"
    },
    {
        "name": "ප්‍රදීප් ශ්‍රී ජයප්‍රකාශ්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 1 ලකුණු 0",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ප්‍රදීප් ශ්‍රී ජයප්‍රකාශ් දුරන් (උපත 1984 ජනවාරි 13, කොළඹ) යනු ශ්‍රී ලංකාවේ කොළඹ නගරයේ හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු 2005 ඉන්දියානු තෙල් කුසලානයේ කණ්ඩායම් අදියරේදී ඉන්දියාවට එරෙහිව එක් දින ජාත්‍යන්තර තරඟයක් ක්‍රීඩා කර තිබේ."
    },
    {
        "name": "ධනුෂ්ක දිල්හාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 9 ලකුණු 83, විස්සයි විස්ස තරග 2 ලකුණු 18",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 9 කඩුලු 6, විස්සයි විස්ස තරග 2 කඩුලු 2",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ලොකු හෙට්ටිගේ ධනුෂ්ක දිල්හාර (උපත 1980 ජූලි 3) දිල්හාර ලොකුහෙට්ටිගේ ලෙස හැඳින්වෙන අතර ඔහු සීමිත ඕවර ක්‍රිකට් ක්‍රීඩා කළ ශ්‍රී ලාංකික හිටපු ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙකු මෙන්ම දකුණත් මැද වේග පන්දු යවන්නෙකු ද වේ. ලොකුහිට්ටේගේ කොළඹ අශෝක විද්‍යාලයේ 13 න් පහළ සිට ජ්‍යෙෂ්ඨ මට්ටම දක්වාම නායකත්වය දැරීය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "2005 දී ඉන්දියානු තෙල් කුසලානය සඳහා ඔහුව ප්‍රථම වරට තෝරා ගත් විට සාපේක්ෂ කම්පනයකට පත් විය, මන්ද මධ්‍යස්ථ දේශීය දස්කම් වලින් පසු ලොකුහෙට්ටිගේ අප්‍රසිද්ධියේ සිට ප්‍රායෝගිකව තෝරා ගන්නා ලදි. කෙසේ වෙතත්, ඔහු හොඳ පිතිකරණ සහ පන්දු යැවීමේ සංඛ්‍යාලේඛන ග්‍රහණය කර ගනිමින් ගුණාත්මක අත්පත් කර ගැනීමක් ඔප්පු කළේය."
    },
    {
        "name": "තිළිණ කණ්ඩම්බි",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 33 ලකුණු 814, විස්සයි විස්ස තරග 5 ලකුණු 13",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 33 කඩුලු 2, විස්සයි විස්ස තරග 5 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "තිළිණ උමේෂ් කණ්ඩම්බි (උපත 1982 ජූනි 4) හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙක් සහ ශ්‍රී ලංකාව සඳහා හිටපු T20 ජාත්‍යන්තර නායකයෙකි. විශේෂඥ මැද පෙළ පිතිකරුවෙකු වූ කණ්ඩම්බි 1998 සිට 2001 දක්වා 19 න් පහළ ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩා කරමින් දක්ෂතා ඇති අයෙකු වූ අතර ඔහු ශ්‍රී ලංකා ඒ ක්‍රිකට් කණ්ඩායම සඳහා පළමු පෙළ ක්‍රීඩා 10 කට ද ක්‍රීඩා කළේය.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "කණ්ඩම්බි 2004 වසරේදී සිම්බාබ්වේට එරෙහිව හයේ පහර එල්ල කරමින් එක්දින ජාත්‍යන්තර ක්‍රිකට් පිටියට පිවිසියේය. 2004 ආසියානු කුසලානය ජයග්‍රහණය කළ කණ්ඩායමේ ඔහු සිටියද ඔහුගේ ඊළඟ දස්කම් තුන ඔහුට ලකුණු 23 ක් ගෙන දුන්නේය"
    },
    {
        "name": "සමන් ජයන්ත",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 17 ලකුණු 400",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 17 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "වරුණවිතාන සමන් ජයන්ත (උපත 1974 ජනවාරි 26 අම්බලන්ගොඩ), නැත්නම් සමන් ජයන්ත, 2004 දී ශ්‍රී ලංකා තේරීම් කමිටුව විසින් ඔහු අතහැර දැමීමට පෙර ශ්‍රී ලංකාව වෙනුවෙන් එක්දින ජාත්‍යන්තර තරග 17 කට ක්‍රීඩා කළ හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ඔහු සිය ජාත්‍යන්තර ක්‍රිකට් දිවිය ආරම්භ කළේ ඕස්ට්‍රේලියාවට එරෙහිව මැද පෙළ පිතිකරුවෙකු ලෙස තරඟ දෙකකදී ලකුණු 24 ක් රැස් කරමිනි, නමුත් 2004 අප්‍රේල් මාසයේදී සිම්බාබ්වේහිදී පැවති ශ්‍රී ලංකාව 5-0 ට වයිට් වොෂ් තරගාවලියේදී වැඩි දියුණු වෙමින්, හොඳම ලකුණු 74 ලබාගෙන ශ්‍රී ලංකාව මඟ පෙන්වීය. දෙවන එක්දින තරඟයේදී කඩුලු 9 ක ජයක්."
    },
    {
        "name": " දිනුෂ ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": " ටෙස්ට් තරග 2 ලකුණු 56",
        "wickets": "ටෙස්ට් තරග 2 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කඳාන ආරච්චිගේ දිනුෂා මනෝජ් ප්‍රනාන්දු (උපත 1979 අගෝස්තු 10 පානදුර), නැතහොත් දිනුෂා ප්‍රනාන්දු යනු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකි. ඔහු දකුණත් පිතිකරුවෙකු මෙන්ම දකුණත් මැද වේග පන්දු යවන්නෙකු ද වේ.",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "ප්‍රයෝජනවත් මැදපෙළ පිතිකරුවෙකු වන ඔහු 2001 දී එංගලන්තය සමඟ පැවති ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් තරගයේදී මුලින් ආකර්ෂණය විය. කෙසේ වෙතත්, ඔහුගේ සමාජය සඳහා ගුණාත්මක දස්කම් කිහිපයක් තිබියදීත්, ඔහු 2003 නොවැම්බර් දක්වා ටෙස්ට් සංචිතයට ඇතුළත් නොවීය. ඔහුගේ එකම එක්දින තරගයේදී දඹුල්ලේදී එංගලන්තයට එරෙහිව ලකුණු 2-13 ක් ලබා ගැනීමට ඔහු පන්දු යැවීය."
    },
    {
        "name": "කීර්ති රණසිංහ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 55",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 4 කඩුලු 3",
        "ball_rank": "",
        "bat_rank": "",
        "bio": " කොළඹ නාලන්දා විද්‍යා‍ලයෙහි ආදි සිසුවෙකි. 1978 සිට 1981 දක්වා කීර්ති කොලඹ නාලන්ද විද්‍යාලයේ ජේෂ්ට ක්‍රිකට් පිලේ ක්‍රීඞා කල අතර 1981 දී නාලන්දා උප නායකයා හා 1982දී නායකයා විය. හේමන්ත දේවප්‍රිය, ෂම්මි සිල්වා, සනත් කලුපෙරුම, රොෂාන් ගුනරත්න, මහාචාර්ය මොහාන් ද සිල්වා මොහුගේ නාලන්දා ක්‍රිකට් කණ්ඩායමේ සමකාලීනයන්ය.කීර්ති එන්ගලන්තයේ වාසය කරයි. ",
        "teams": "ශ්‍රී  ලංකාව",
        "career_info": "1978 සිට 1981 දක්වා කීර්ති කොලඹ නාලන්ද විද්‍යාලයේ ජේෂ්ට ක්‍රිකට් පිලේ ක්‍රීඞා කල අතර 1981 දී නාලන්දා උප නායකයා හා 1982දී නායකයා විය."
    },
    {
        "name": "සනත් ජයසූරිය",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 445 ලකුණු 13430, විස්සයි විස්ස තරග 31 ලකුණු 629, ටෙස්ට් තරග 110 ලකුණු 6973",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 445 කඩුලු 323, විස්සයි විස්ස 31 තරග කඩුලු 19, ටෙස්ට් තරග 110 කඩුලු 98",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "(උපත 1969 ජූනි 30, මාතර) ශ්‍රී ලාංකීය හිටපු ක්‍රිකට් ක්‍රීඩකයෙකු වන අතර වර්තමානය වන විට ශ්‍රී ලංකා පාර්ලිමේන්තුවේ මන්ත්‍රී වරයකු ලෙස කටයුතු කලේය.ජයසුරිය අධ්‍යාපනය ලද්දේ මාතර සර්වේෂස් විද්‍යාලයෙනි. ඔහු ක්‍රිකට් ක්‍රීඩාවට අත්පොත් තබන ලද්දේ එම විද්‍යාලයේ ඉගෙනුම ලබන කාලයේදීය. ඒ එවකට සිටි විදුහල්පති ජී.එල්. ගල්ප්පත්ති සහ පුහුණුකරුවූ ලයනල් වනසිංහගේ පුර්ණ උපකාරය ඇතිවය. සනත් ජයසුරිය ක්‍රිකට් ක්‍රීඩාවට අමතරව සමාජ සේවකයෙකු ලෙසද කටයුතු කරන අතර ශ්‍රි ලංකාවේ ඒඞ්ස් රෝගය තුරන් කිරීමේ අරමුණ ඇතිව ඔහු විසින් ඉටු කරන ලද මෙහෙවර උදෙසා එක්සත් ජාතීන්ගේ සංවීධාකය මඟින් විශේෂිත ගෞරව තනතුරකින් ද පිදුම් ලැබිය. ",
        "teams": "‍ශ්‍රී ලංකාව, බ්ලූම්ෆීල්ඩ්,සමර්සෙට්,මැරිලිබෝන් ක්‍රිකට් සමාජය,ලැන්කෂයර්,කුල්නා රාජකීය බෙංගාලි",
        "career_info": "ශ්‍රි ලංකා ජාතික ක්‍රිකට් කණ්ඩායමට 1989 දී සම්බන්ධ වූ ඔහු තුන් ඉරියව්වෙන්ම දස්කම් දැක්වු ක්‍රීඩකයෙකි. එක්දින තරඟවලදී ලකුණු 13000 ඉක්මවුද කඩුලූ 300 දවාගන්නා ලද්දා වුද ලොව සිටින එකම ක්‍රීඩකයා මොහුය. 1996 වර්ෂයේ ලෝක කුසලාන ක්‍රිකට් තරඟා වලිය පැවති කාලයේ සනත් ජයසුරිය ඔහුගේ උපාය මාර්ගික ක්‍රම භාවිතා කරමින් එක් දින ජාත්‍යන්තර ක්‍රිකට් තරඟවල පන්දුවට පහර දීමේ විප්ලවයක් ඇති කළේය. මෙහිදි භාවිතා කළ උපක්‍රමය නම් පළමු පන්දු යවන්නන්ට පිටියේ සෑම අන්තයකටම දිගට හරහට පහර එල්ල කරමින් ඔවුන් දුර්මුඛ කිරිමය. මෙය අලුත් ක්‍රමයක් වුවද ඒ කාලයේ දී තරඟ දිනවිය හැකි උපායක් විය. ඉතා ඉක්මණින්ම මෙම ක්‍රමය ලෝක ක්‍රිකට් තරඟ වලදි පළමු පන්දුවට පහර දීමේ නියත ක්‍රමයක් බවට පත් විය. ග්ලෙන් මැක්ග්‍රාත් ජයසූරිය ගැන සඳහන් කරමින් කීවේ. එය සෑම විටම කෙනෙකුට ගෞරවයක් වෙනවා මෙසේ කීමට හැකි වීම සම්බන්ධයෙන්. ඔවුන් ක්‍රීඩාවේ ගමන් මග වෙනස් කලා. ඔහුගේ දැවැන්ත ඉනිමයන් 1996 ලෝක කුසලාන තරඟ වලියේ පළමුවෙන් ලකුණු රැස් කිරීම ආරම්භ කළ යුත්තේ කෙසේ දැයි යන්න පිළිබඳ සැමගේ අදහස් වෙනස් කළා යනුවෙනි. "
    },
    {
        "name": "මාවන් අතපත්තු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 268 ලකුණු 8529, විස්සයි විස්ස තරග 2 ලකුණු 5, ටෙස්ට් තරග 90 ලකුණු 5502",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 268 කඩුලු 0, විස්සයි විස්ස 2 තරග කඩුලු 0, ටෙස්ට් තරග 90 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "(උපත 1970 නොවැම්බර් 22) ශ්‍රී ලංකා ක්‍රිකට් පුහුණුකරුවෙකු සහ හිටපු ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු වසර 17 ක් ශ්‍රී ලංකාව වෙනුවෙන් ටෙස්ට් හා එක්දින තරඟ ක්‍රීඩා කළේය. ඔහුගේ යුගයේ ඉතාමත් තාක්‍ෂණික පිතිකරුවෙකු ලෙස සැලකෙන අතපත්තු සිය පළමු ඉනිම 6 තුළදී තාරාවන් 5 ක් නොසලකා ශ්‍රී ලංකාව වෙනුවෙන් ටෙස්ට් ක්‍රිකට් ක්‍රීඩාවේදී ද්විත්ව ශතක 6 ක් රැස් කළේය.ඔහු මීට පෙර කැනඩාව සහ සිංගප්පූරුවේ ජාතික ක්‍රිකට් කණ්ඩායම් පුහුණු කර ඇත.2014 අප්‍රේල් සිට 2015 සැප්තැම්බර් දක්වා ඔහු ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායමේ ප්‍රධාන පුහුණුකරු විය.",
        "teams": "ශ්‍රී ලංකාව,සිංහල ක්‍රීඩා සමාජය,ඒෂියා XI ",
        "career_info": "අතපත්තු  ඔහුගේ පළමු තරඟ තුනේම දුෂ්කර ආරම්භයෙන් පසු, ඔහු සිය ඊළඟ ඉනිම 11 තුළදී ලකුණු 29 ට වැඩි ලකුණු ලබා නොගත් අතර, ඔහුගේ මංගල තරගයට වසර 7 කට පසු ඉන්දියාවට එරෙහිව ඔහුගේ 10 වන තරඟයේදී ඔහුගේ පළමු ටෙස්ට් ශතකය වාර්තා කළේය. ඔහු සිය එක්දින ජාත්‍යන්තර තරඟය ඉන්දියාවට එරෙහිව නාග්පූර්හිදී ආරම්භ කළේය. ඔහු 2003 අප්‍රේල්  මාසයේදී එක්දින කණ්ඩායමේ නායකයා ලෙස පත් කරන ලදී. 2004 දී සිම්බාබ්වේට එරෙහිව ඔහුගේ වැඩිම ටෙස්ට් ලකුණු සංඛ්‍යාව  249 ක් වාර්තා කළ අතර, දෙවන කඩුල්ල සඳහා කුමාර් සංගක්කාර සමඟ ලකුණු 438 ක සබඳතාවක් පැවැත්වීය. අතපත්තු සිය කණ්ඩායමේ ඕස්ට්‍රේලියානු සංචාරයේදී ක්වීන්ස්ලන්තයේ කෙයාන්ස් හිදී පැවති දෙවන ටෙස්ට් තරඟයේ පළමු ඉනිමේදී ශතකයක් වාර්තා කළේය. ඔහුගේ ඉනිම පහේදී තුන්වන ශතකය වාර්තා කළ ඔහු ලකුණු 133 ක් රැස් කළේය. "
    },
    {
        "name": "ගාමිණී වික්‍රමසිංහ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 4 ලකුණු 2,  ටෙස්ට් තරග 3 ලකුණු 17",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "අංගුප්පුලිගේ ගාමිණී දයන්ත වික්‍රමසිංහ ශ්‍රි ලංකාවේ ගාලු නගරයේ දී 1965 දෙසැම්බර් 27 උපත ලැබීය.කොළඹ නාලන්දා විද්‍යා‍ලයෙහි ආදි සිසුවෙකි. 1982 සිට 1984 දක්වා ගාමිණී කොලඹ නාලන්ද විද්‍යාලයේ ජ්‍යෙෂ්ඨ ක්‍රිකට් ක්‍රීඩා පිලේ ක්‍රීඞා කලේය.",
        "teams": "ශ්‍රී ලංකාව,නොන්ඩිස්ක්‍රිප්ට් ක්‍රිකට් සමාජය",
        "career_info": "ගාමිණී වික්‍රමසිංහ කඩුලු පිටුපස ස්ථාවර දස්කම් දැක්වූ සහ පහළ මට්ටමේ පිතිකරුවෙකු වූ ඔහුට ජාතික කණ්ඩායම තුළ ස්ථීර ස්ථානයක් තහවුරු කර ගැනීමට කිසිඳු අවස්ථාවක් ලැබුනේ නැත.වික්‍රමසිංහ 1989-90 සංචාරයේදී ඕස්ට්‍රේලියාවට එරෙහිව ගබ්බා හිදී ටෙස්ට් දිවියට පිවිසියේ කඩුල්ල පිටුපසින් උඩපන්දු තුනක් ලබාගෙන ලකුණු දෙකක් ලබා ගනිමිනි. හෝබර්ට් හිදී පැවති දෙවන ටෙස්ට් තරගය මග හැරීමට ඔහුට සිදු වූ අතර තිලකරත්න එම ස්ථානයට පත්වූයේ ආකර්ෂණීය දර්‍ශනයක් ලබා දෙමිනි.වික්‍රමසිංහ අඛණ්ඩව දේශීය මට්ටමින් ස්ථාවර දක්‍ෂතා දැක්වූ අයෙකු වූ අතර 1992-93 දී නවසීලන්තයට එරෙහිව නැවත කැඳවීමක් ලබා ගත්තේය. මුරලිදරන්, වර්ණවීර සහ අනුරසිරිගේ දඟ පන්දු සම්බන්ධව ශ‍්‍රී ලංකාව වික‍්‍රමසිංහ ජයග්‍රහණය කළ අතර කඩුලු පිටුපස වික්‍රමසිංහ සහතික විය. කෙසේ වෙතත්, තේරීම් කමිටුව ප්‍රඥාවන්ත ලෙස පළමු වතාවට නොව උසස් පිතිකරණ හැකියාවන් ඇති ක්‍රීඩකයා සඳහා තණකොළ තෝරා ගත්තේය. ඉදිරි වසර කිහිපය තුළදී අපේක්‍ෂකයින් ගනනාවකට වැඩි සාර්ථකත්වයක් අත්හදා බැලීමට නොහැකි වූ අතර වික්‍රමසිංහ මහතා දේශීය මට්ටමින් විශ්වාස කටයුතු ලෙස කටයුතු කළේය. අවස්ථාව ලබා දී ඔහුට එම තනතුර ඔහුගේම කර ගැනීමට ඉඩ තිබුණි."
    },
    {
        "name": "මුත්තයියා මුරලිදරන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 350 ලකුණු 674,විස්සයි විස්ස තරග 12 ලකුණු 1,ටෙස්ට් තරග 133 ලකුණු 1256,IPL තරග 66 ලකුණු 20",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 350 කඩුලු 534, විස්සයි විස්ස 12 තරග කඩුලු 13, ටෙස්ට් තරග 133 කඩුලු 800, IPL තරග 66 කඩුලු 63",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1972 අප්‍රේල් මස 17 මහනුවර අසල උපන් මුරලිදරන් , කුන්ඩසාලේ නත්තරංපොත දී ලක්ෂ්මි සහ සින්නසාමි මුත්තයියා මව් පියනට දාව උපත ලත් අතර, දරුවන් හතර දෙනෙකුගෙන් යුත් පවුලේ වැඩිමලා ඔහු විය. මුත්තයියාගේ පියා වූ සින්නසාමි මුත්තයියා සාර්ථක විස්කෝතු නිෂ්පාදන ව්‍යපාරයක් පවත්වාගෙන යන්නේය. ඔහුගේ වයස අවුරුදු 9 ක් වන විට ඔහු මහනුවර සෙන්ට් ඇන්තනී විදුහලට යවනු ලැබුවේය. මෙම පාසල පෞද්ගලික එකක් වූ අතර බෙනඩික් පූජකවරු විසින් පාලනය කරන ලද්දේය. ඔහු තම ක්‍රිකට් දිවිය ආරම්භ කළේ මද වේග පන්දු යවන්නෙකු වශයෙනි. එහෙත් පසුව ඔහුගේ පුහුණුකරු වූ සුනිල් ප්‍රනාන්දු ගේ උපදෙස් මත වයස දාහතරේදි පිට දඟ පන්දු යවන්නෙකු ලෙස ක්‍රීඩා කිරීම ඇරඹුවේය. ",
        "teams": "ශ්‍රී ලංකාව, ආසියා XI, චෙන්නායි සුපර් කිංග්ස්, අයිසීසී වර්ල්ඩ් ඉලෙවන්, කෝචි ටස්කර්ස් කේරල, ග්ලෝස්ටර්ෂයර්, චිතගොං කිංග්ස්, රෝයල් චැලෙන්ජර්ස් බැංගලෝර්, උතුරු රුද්‍රා, මෙල්බර්න් රෙනේගේඩ්ස්, ජැමෙයිකාව තලවා, සචින් බ්ලාස්ටර්, මිථුන අරාබියන්",
        "career_info": "මුරලිදරන් ක්‍රීඩාවේ ඉතිහාසයේ පළමු මැණික් කටුව කරකැවෙන දඟ පන්දු යවන්නා වේ.  2004 දී චැනල් 4 නාලිකාවේ මාර්ක් නිකලස් සමඟ පටිගත කරන ලද රූපවාහිනී ‘දූස්රා’ වැඩසටහන අතරතුර, ඔහුගේ ප්‍රධාන බෙදාහැරීම් වේගයෙන් ඉහළට යන ක්‍රීඩකයෙකි , දූස්රා, විස්මිත ලෙස බෙදා හැරීම කකුලේ සිට අනෙක් පැත්තට (ඔහුගේ කොටස් බෙදා හැරීමේ ප්‍රතිවිරුද්ධ දිශාවට) පහසුවෙන් හඳුනාගත හැකි ක්‍රියාවකින් තොරව වෙනස් වේ. ඔහුගේ සුපිරි නම්‍යශීලී මැණික් කටුව ඔහුව විශේෂයෙන් බලවත් කරන අතර ඕනෑම මතුපිටක් හැරවීමට ඔහුට සහතික වේ."
    },
    {
        "name": "චමින්ද වාස් ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 322 ලකුණු 2025,විස්සයි විස්ස තරග 6 ලකුණු 33,ටෙස්ට් තරග 111 ලකුණු 3089",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 322 කඩුලු 400, විස්සයි විස්ස 6 තරග කඩුලු 6, ටෙස්ට් තරග 111 කඩුලු 355",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1974 ජනවාරි 27 මත්තුමගල දී උපත ලැබීය,කොළඹ ශාන්ත ජෝසප් විද්‍යාලයේ ආදි ශිෂ්‍යයෙකු වූ ඔහු ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායමට එකතු වූයේ 1994 දීය. ඔහු ඔහුගේ අන්තර්ජාතික ක්‍රිකට් දිවියේ ප්‍රථම වසරේදීම නැපියර්හිදී නවසීලන්තයට එරෙහිව ටෙස්ට් ජයක් ලබා ගැනීමට ශ්‍රී ලංකාවට උදව් විය. එය ශ්‍රී ලංකා කණ්ඩායම මව් රටෙන් පිටදී ලබාගත් ප්‍රථම ටෙස්ට් ජයග්‍රහණය විය. එහිදී වාස් ප්‍රථම ඉණිමේදී 5 - 42 ද දෙවන ඉණිමේ දී 5 – 43 ද ලබා ගත්තේය. ",
        "teams": "ශ්‍රී ලංකාව, කෝල්ට්ස් ක්‍රිකට් සමාජය,හැම්ප්ෂයර්,ඌව,වෝර්සෙස්ටර්ෂයර්,ඩෙකෑන් චාජර්ස්,නෝර්ත්හැම්ප්ටන්ෂයර්",
        "career_info": "ඔහුගේ පළමු  මංගල  තරගයෙන් වසර 4 කට ආසන්න කාලයකට පසු, තරඟ 13 කට පසු වාස් 1994 අගෝස්තු මාසයේදී පකිස්ථානයට එරෙහිව ශ්‍රී ලංකා ක්‍රිකට් කණ්ඩායම සඳහා සිය මංගල ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළේය. ජාතික පිලේ පළමු වසර තුළදී ඔහු ශ්‍රී ලංකාවට මඟ පෙන්වමින් මහත් බලපෑමක් කළේය. නවසීලන්තයට එරෙහිව නැපියර් හිදී පැවැති තරගයේදී ශ්‍රී ලංකාව මංගල ටෙස්ට් ජයග්‍රහණය වාර්තා කරමින් 5-47 සහ 5-43 ක් ලබා ගනිමින් ලකුණු 33 හා 36 ලබා ගනිමින් තරගයේ වීරයා ලෙස නම් කරන ලදී. ඩුනෙඩින්හිදී පැවති දෙවන ටෙස්ට් තරගයේදී ඔහුගේ 6 වන ටෙස්ට් තරගය පමණක් වූ ඔහු ඔහුගේ තුන්වන කඩුලු 5 දවාලීමත් සමඟම තරඟයේ වීරයා ලෙස නම් කෙරිණි."
    },
    {
        "name": "කුමාර ධර්මසේන",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 141 ලකුණු 1222,විස්සයි විස්ස තරග 7 ලකුණු 129,ටෙස්ට් තරග 31 ලකුණු 868",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 141 කඩුලු 138, විස්සයි විස්ස 7 තරග කඩුලු 4, ටෙස්ට් තරග 31 කඩුලු 69",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කුමාර ධර්මසේන නාලන්දා විද්‍යාලය, කොළඹහි ආදි සිසුවෙකි. 1986 සිට 1990 දක්වා කුමාර කොලඹ නාලන්ද විද්‍යාලයේ ජේෂ්ඨ  ක්‍රිකට් පිලේ ක්‍රීඩා  කල අතර 1990 දී නාලන්දා නායකයාවිය. කුමාර වසර 1989 දී ඔබ්සර්ව බාටා හොඳම පාසැල් ක්‍රිකට් ක්‍රීඩකයාට හිමි සම්මානය ලබාගත්තාය. ",
        "teams": "ශ්‍රී ලංකාව, බ්ලූම්ෆීල්ඩ් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,නොන්ඩි ක්‍රිකට් සමාජය,මොරටුව ක්‍රිකට් සමාජය",
        "career_info": "ධර්මසේන සිය ක්‍රිකට් දිවිය නව යොවුන් වියේදී කොළඹ නාලන්දා විද්‍යාලයෙන් ආරම්භ කළ අතර ඔහුගේ පළමු ජාත්‍යන්තර ක්‍රිකට් පිටිය 1994 දී දකුණු අප්‍රිකාවට එරෙහිව විය.ඔහු එක්දින තරඟ වලදී පන්දු යැවීමට පරිපූර්ණ වූ නමුත් ධර්මසේන ද ප්‍රයෝජනවත් පිතිකරුවෙකු බව සනාථ කළේය, විශේෂයෙන් 1998 දී අයිසීසී විසින් ඔහුගේ පන්දු යැවීමේ ක්‍රියාව නීති විරෝධී සමානුපාතිකයන්ට වැඩි කිරීම ගැන පරීක්ෂණ පැවැත්වීමෙන් පසුව. 2000 ජූලි මාසයේදී නිදහස් කරන ලද ඔහු එතැන් සිට අවස්ථා කිහිපයකදීම එක්දින කණ්ඩායම සඳහා ක්‍රීඩා කළ නමුත් කලාතුරකින් ටෙස්ට් ක්‍රිකට් ක්‍රීඩා කළේය. ධර්මසේන ටෙස්ට් කැප් එකක් ලබා ගත් 59 වන ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයා විය"
    },
    {
        "name": "මහේල ජයවර්ධන",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 448 ලකුණු 12650, විස්සයි විස්ස තරග 55 ලකුණු 1493, ටෙස්ට් තරග 149 ලකුණු 11814, IPL තරග 80 ලකුණු 15",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 448 කඩුලු 7, විස්සයි විස්ස 55 තරග කඩුලු 0, ටෙස්ට් තරග 149 කඩුලු 6, IPL තරග 80 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1977 මැයි 27  උපත ලැබීය,ජයවර්ධන අධ්‍යාපනය ලැබුවේ කොලඹ නාලන්ද විද්‍යාලයේය.ජයවර්ධන 1997 දී ටෙස්ට් හා එක්දින වරම් ලැබුවේය.2006 දී ඔහු ටෙස්ට් තරග ඉතිහාසයේ ශ්‍රී ලාංකිකයෙකු වාර්තා කල වැඩි ම ලකුණු සංඛ්‍යාව වන 374 දකුණු අප්‍රිකාවට එරෙහිව මව්බිමෙදී ලබා ගන්නා ලදී. ඔහුට 50ට ඉතාමත් ආසන්න ටෙස්ට් සාමාන්‍යයක් (49.84) හා 30ට වැඩි (32.90) එක්දින සාමාන්‍යයක් ඇත. ටෙස්ට් ලකුණු 10,000 හා 11,000 සීමාව පසු කල පලමු ශ්‍රී ලාංකිකයා ද ඔහු වේ.ඔහුගේ අඩු ලකුණු සාමාන්‍යය නොසලකා හැරියොත් ඔහුගේ ම කණ්ඩායම් සගයෙකු වන කුමාර් සංගාක්කාර සමග මැතකදී ශ්‍රී ලාංකාවෙන් බිහි වූ හොදම පිතිකරුවෙකු වේ.ඔහු එක් දින ජාත්‍යන්තර තරඟ වලදී කුමාර් සංගක්කාර හා සනත් ජයසූරිය හැරුණු විට ශ්‍රී ලංකාව වෙනුවෙන් ලකුණු 10,000 ක් ලබා ගත් තෙවැනි පිතිකරු වේ. ",
        "teams": "ශ්‍රී ලංකාව, ආසියා XI, ශ්‍රී ලංකා මණ්ඩල XI, උතුරු මැද පළාත, ශ්‍රී ලංකාව A, ශ්‍රී ලංකා ආරාධනා XI, සිංහල ක්‍රීඩා සමාජය, යං ශ්‍රී ලංකාව, කිංග්ස් XI පන්ජාබ්, දිල්ලි කැපිටල්ස්, වයඹ, 19 න් පහළ සමර්සෙට්, සසෙක්ස් , කොචි ටස්කර්ස් කේරල, ඇඩිලේඩ් ස්ට්‍රයිකර්ස්, වයඹ යුනයිටඩ්, මධ්‍යම දිස්ත්‍රික්ක, මැරිලිබෝන් ක්‍රිකට් සමාජය, ට්‍රින්බැගෝ නයිට් රයිඩර්ස්, ජැමෙයිකා තල්ලවාස්, සචින් බ්ලාස්ටර්, ඩකා ප්ලැටූන්, කරච්චි කිංග්ස්",
        "career_info": "මහේල ජයවර්ධන ශ්‍රී ලංකාවේ 69 වන ටෙස්ට් ක්‍රිකට් ක්‍රීඩකය වේ. ජයවර්ධනගේ පළමුවැනි ටෙස්ට් තරඟය වුයේ ආර්.ප්‍රේමදාස ක්‍රීඩාංගනයේදී ශ්‍රී ලංකාව සහ ඉන්දියාව අතර පැවති වාර්තාගත ටෙස්ට් තරඟයේදීය.එහිදී ඔහු පළමු ඉනිම වෙනුවෙන් ලකුණු 66ක් රැස් කරගන්නා ලදී. ඔහු එම තරඟයේදී ක්‍රීඩා පිටියට පැමිණියේ ඊට පෙර ටෙස්ට් තරඟයකදී කණ්ඩායමක් රැස් කරගෙන තිබූ වැඩිම ලකුණු සංඛ්‍යාවත් ඉක්මවා ගිය පසුවය. ඉන්පසුව ඔහු නවසීලන්තයට හා ඉන්දියාවට එරෙහිව පිළිවෙලින් ලකුණු 167ක් සහ ලකුණු 242ක් රැස් කරගන්න ලදී. "
    },
    {
        "name": "චාමර සිල්වා",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 75 ලකුණු 1587, විස්සයි විස්ස තරග 16 ලකුණු 175, ටෙස්ට් තරග 11 ලකුණු 537",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 75 කඩුලු 1, විස්සයි විස්ස 16 තරග කඩුලු 1, ටෙස්ට් තරග 11 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1979 දෙසැම්බර්  14  උපත ලැබීය,ඔහු පානදුර රාජකීය විද්‍යාලයෙන් අධ්‍යාපනය ලැබූ අතර පානදුර ක්‍රීඩා සමාජය සඳහා ස්ථාවර වාර්තාවක් තැබූ ඔහු කණ්ඩායමේ නායකත්වය දැරූ අතර ඕස්ට්‍රේලියාවට එරෙහි ඔහුගේ එක්දින ජාත්‍යන්තර මංගල තරගයේදී ලකුණු 54 ක් ද ඇතුළත්ව හොඳ වාර්තාවක් ලබා ගත්තේය. 1998 සිට ඔහු ලැයිස්තු A ක්‍රිකට් ක්‍රීඩා කර ඇති අතර 2004 සිට විස්සයි 20 ක්‍රිකට් මධ්‍යස්ථ සාර්ථකත්වයකින් සහ ස්ථාවර සාමාන්‍යයකින් ක්‍රීඩා කර ඇත. 2004 අගෝස්තු 17 දින ඔහු 2004 විස්සයි 20 ක්‍රිකට් තරගාවලියේදී සිංහල ක්‍රීඩා සමාජය සඳහා විස්සයි 20 ක්‍රිකට් පිටියට පිවිසියේය.",
        "teams": "ශ්‍රී ලංකාව, බ්ලූම්ෆීල්ඩ් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,සෙබස්තියනයිට්ස් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,සිංහල ක්‍රීඩා සමාජය,පානදුර ක්‍රීඩා සමාජය",
        "career_info": "ඔහු නවසීලන්තයේදී සිය මංගල ටෙස්ට් තරඟය ආරම්භ කළ අතර ඔහුගේ සගයා වූ මාවන් අතපත්තු මෙන් යුගලයක් සඳහා දැවී යා හැකි නරකම ආරම්භය ඔහු සතු විය. කෙසේ වෙතත්, ඔහුට දෙවන අවස්ථාවක් ලබා දුන් අතර, කුමාර් සංගක්කාර සමඟ ලකුණු 121 ක සබඳතාවක් භුක්ති විඳිමින් දෙවන ටෙස්ට් තරඟයේ පළමු ඉනිමේදී ලකුණු 61 ක් ලබා ගැනීමෙන් ඔහු තෝරා ගැනීම වහාම සාධාරණීකරණය කළේය. දෙවන ඉනිමේදී ඔහු හවුල්කරුවන් අහිමි වීමට පෙර ඉතාමත් ආක්රමණශීලීව නොදැවී ලකුණු 152 ක් රැස් කරමින් හතරේ පහර 20 ක් එල්ල කරමින් වැඩි දියුණු කළේය.ලෝක කුසලානයට සති 3 ක් තිබියදී සිල්වා ඉන්දියාවට එරෙහිව සිය පළමු ජාත්‍යන්තර එක්දින ශතකය වාර්තා කළේය.2007 ක්‍රිකට් ලෝක කුසලාන තරගාවලියේදී ඔහුගේ යහපත් ස්වරූපය අඛණ්ඩව පැවති අතර, අර්ධ ශතක 4 ක් සහ වැඩිම ලකුණු 64 ක් සමඟින් 43.75 ක සාමාන්‍යයක් සහිතව ලකුණු 350 ක් ලබා ගැනීමට ඔහු සමත් විය. මැදපෙළේ ඔහුගේ ජයග්‍රහණය ශ්‍රි ලංකාවට ඔවුන්ගේ ශ්‍රි ලංකා පිල ඉහළ නංවා ගැනීමට උපකාරී වී තිබේ.විශේෂයෙන්ම ලෝක කුසලානය අවසානයේදී විශ්‍රාම ගැනීම නිවේදනය කිරීමෙන් පසු දින සහ ටෙස්ට් තරඟ වලදී විශේෂයෙන් ප්‍රවීණ මැද පෙළ පිතිකරුවන් වූ රසල් ආර්නෝල්ඩ්."
    },
    {
        "name": "තිලකරත්න ඩිල්ෂාන්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 330 ලකුණු 10290, විස්සයි විස්ස තරග  ලකුණු , ටෙස්ට් තරග 87 ලකුණු 5492, IPL තරග 52 ලකුණු 1153",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 330 කඩුලු 106, විස්සයි විස්ස  තරග කඩුලු , ටෙස්ට් තරග 87 කඩුලු 39",
        "ball_rank": "",
        "bat_rank": "",
        "bio": " ඩිල්ෂාන්  1976 ඔක්තෝබර් 14උපත ලැබීය, ශ්‍රී ලංකාවේ හිටපු ක්‍රිකට් ක්‍රීඩකයෙක් සහ ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායමේ හිටපු නායකයෙකි. එක්දින ඉතිහාසයේ දුවද්දී හඹා යන ශ්‍රේණිගත කිරීම් වල හොඳම ශ්‍රේණිගත කළ ක්‍රීඩකයා ලෙස ඔහු බොහෝ විට සැලකෙන්නේ එක් දින ඉතිහාසයේ ඉතාමත් නවෝත්පාදක එක්දින පිතිකරුවෙකු ලෙස ය. ක්‍රීඩාවේ සෑම අංශයකින්ම කැපී පෙනෙන කුසලතා ඇති, පන්දුවට පහර දීමට, පන්දු යැවීමට, පන්දු යැවීමට සහ කඩුල්ල තබා ගැනීමට ක්‍රිකට් ක්‍රීඩකයෙකුගේ දුර්ලභ උදාහරණයක් ලෙස ඩිල්ෂාන් සැලකේ. ඔහු ආක්‍රමණශීලී දකුණත් පිතිකරුවෙකි. ඔහු ආරම්භක පිතිකරුවෙකු පමණක් නොව, දක්ෂ පන්දු යැවීමේ පන්දු යවන්නෙකු ද වේ.",
        "teams": " ශ්‍රි ලංකාව,ඒෂියා XI,බ්ලූම්ෆීල්ඩ් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,දිල්ලි ඩෙයාර් ඩෙවිල්ස්,ගයානා ඇමසන් වොරියර්ස්,කළුතර නගර සමාජය,පේෂාවර් සල්මි,රෝයල් චැලෙන්ජර්ස් බැංගලෝර්,සෙබස්තියනයිට්ස් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,ටැමිල් යූනියන් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය",
        "career_info": "1999 නොවැම්බර් 18 දින බුලවායෝහිදී ඩිල්ෂාන් මුලින්ම සිම්බාබ්වේ කණ්ඩායමට එරෙහිව ක්‍රීඩා කළේය. ඔහු මංගල තරගයේදී ලකුණු 9 ක් ලබා ගත් අතර හෙන්රි ඔලොන්ගාගේ පන්දුවක් හමුවේ එල්ඩබ්ලිව්ඩබ්ලිව් අවුට් විය. කෙසේ වෙතත්, ශ්‍රී ලංකාව සහ සිම්බාබ්වේ අතර පැවැත්වෙන දෙවන ටෙස්ට් තරඟයේදී හරාරේ ක්‍රීඩා සමාජයේදී ඩිල්ෂාන් සිය මංගල ටෙස්ට් ශතකය වාර්තා කිරීමට සමත් විය. ඔහු පළමු ඉනිමේදී නොදැවී ලකුණු 163 ක් රැස්කළ අතර ශ්‍රී ලංකා ජයග්‍රහණය සඳහා ඔහුගේ දායකත්වය වෙනුවෙන් තරඟයේ වීරයා ලෙස සම්මානයෙන් පිදුම් ලැබීය. ලෝඩ්ස් ක්‍රිකට් පිටියේදී පැවති දෙවන ටෙස්ට් තරඟයේදී ලකුණු 193 ක් ලබා ගත් ඩිල්ෂාන් එංගලන්තයේදී ඔහුගේ වැඩිම ටෙස්ට් ලකුණු ලබා ගත්තේය. "
    },
    {
        "name": "කුමාර් සංගක්කාර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 404 ලකුණු 14234, විස්සයි විස්ස තරග 56 ලකුණු 1382 , ටෙස්ට් තරග 134 ලකුණු 12400, IPL තරග 71 ලකුණු 1687",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 404 කඩුලු 0, විස්සයි විස්ස  56 තරග කඩුලු 0, ටෙස්ට් තරග 134 කඩුලු 0,IPL තරග 71 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1977දී මාතලේ දී කුමාර සංගක්කාර උපත ලබන ලදි. සංගක්කාර ඔහුගේ මූලික හා ද්වීතීක අධ්‍යාපනය ලැබුවේ නුවර නගරයේ තිබෙන ප්‍රමුඛතම පාසලක් මෙන්ම ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාංගනයක් (අස්ගිරිය ක්‍රීඩාංගණය) හිමි ලෝකයේ එකම පාසල වන ත්‍රිත්ව විද්‍යාලයෙනි. වරක් ඔහු වසරේ විශිෂ්ඨම ශිෂ්‍යයාට පිරිනමන The Ryde Gold Medal සම්මානයෙන්ද පිදුම් ලැබීය.1996 වසරේ පාසලේ ප්‍රධාන ශිෂ්‍ය නායක දූරය දැරීමටද ඔහුට හැකි විය. ඔහු මුල් පෙළ වමත් පිතිකරුවෙකි. ඔහු කඩුළු රකින්නා හා මුල් පෙළ පිතිකරුවෙක් ලෙස ක්‍රීඩා කිරීමට පුරුදුව සිටියත්, ටෙස්ට් ක්‍රීඩාවේ කඩුළු රැකීමෙන් ඉවත්වීමත් සමගම ඔහුගේ පිතිකරණයේ සැලකිය යුතු වෙනසක් ඇති විය. ඔහුගේ ක්‍රීඩා දිවියේ අවස්ථා කීපයකදිම ලොව අංක 1 ටෙස්ට් පිතිකරු බවට පත් වීමට ඔහුට හැකි විය.",
        "teams": "ශ්‍රී ලංකාව, එන්සීසී,කිංග්ස් XI පංජාබ් ,වෝර්වික්ෂයර් ,ඩෙකෑන් චාර්ජර්ස් ,සරේ ප්‍රාන්ත පිළ ",
        "career_info": "වයස අවුරුදු 22 දී සංගක්කාර සිය මංගල ටෙස්ට් ක්‍රිකට් තරගය ආරම්භ කළේ 2000 ජූලි 20 දින දකුණු අප්‍රිකාවට එරෙහිව පැවති තරඟ තුනකින් සමන්විත තරගාවලියක පළමු කඩුල්ල ලෙස කඩුලු රැකීමෙනි. මෙම තරඟය ජයග්‍රහණය කළ ශ්‍රී ලංකාව සහ ඔහුගේ එක් ඉනිමේ තුන්වන කඩුල්ල බිඳ වැටෙන විට සංගකරා ලකුණු 23 ක් රැස් කළේය. 2000 වසරේ සිංගර් තුන්කොන් තරගාවලියේ 2 වන තරඟයේදී ඔහු දකුණු අප්‍රිකාවට එරෙහිව ලකුණු 85 ක් ලබා ඔහුගේ පළමු තරගයේ වීරයා සම්මානය ලබා ගත්තේය. ඔහු දකුණු අප්‍රිකාවට එරෙහිව පැවැත්වීමට නියමිත ටෙස්ට් තරගාවලිය සඳහා තම ස්ථානය තහවුරු කර ගනිමින් ලකුණු 199 ක් ලබා 66.33 ක සාමාන්‍යයක් සහිතව තරග මාලාව අවසන් කළේය. ඔහුගේ පළමු ටෙස්ට් ශතකය ලබා ගැනීමට පෙර, 90 දශකයේදී එක් වරක් දකුණු අප්‍රිකාවට සහ එංගලන්තයට එරෙහිව ඔහු දෙවරක් දැවී ගියේය. 2001 අගෝස්තු මාසයේදී ඉන්දියාව ටෙස්ට් තරග තුනක් සඳහා ශ්‍රී ලංකාවේ සංචාරය කළ අතර ආරම්භක තරගයේදී සංගක්කාර සිය පළමු ශතකය වාර්තා කළේය."
    },
    {
        "name": "දිල්හාර ප්‍රනාන්දු",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 147 ලකුණු 239, විස්සයි විස්ස තරග 18 ලකුණු 25 , ටෙස්ට් තරග 40 ලකුණු 249",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 147 කඩුලු 187, විස්සයි විස්ස  18 තරග කඩුලු 18, ටෙස්ට් තරග 40 කඩුලු 100",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "කොංගෙනිගේ බොන්ගෝලි රන්ධි ලැබිලේ දිල්හාර ප්‍රනාන්දු යනු ජාත්‍යන්තර තලයේ ටෙස්ට්, එක්දින සහ විස්සයි 20 තරග සඳහා ක්‍රීඩා කරන ශ්‍රී ලාංකික වෘත්තීය ක්‍රීඩකයෙකි. ඔහු දකුණත් වේග පන්දු යවන්නෙක්. ඔහු 2007 අයිසීසී ක්‍රිකට් ලෝක කුසලානය සහ 2011 අයිසීසී ක්‍රිකට් ලෝක කුසලාන අනුශූර කණ්ඩායම් සඳහා ප්‍රධාන සාමාජිකයෙකු විය.ප්‍රනාන්දු වඩාත් ප්‍රචලිත වන්නේ මන්දගාමී පන්දුව මුදා හරින විට පන්දුව මත ඇඟිලි බෙදී පන්දු යැවීමේදී ඔහුගේ දුර්ලභ තාක්‍ෂණය සඳහා ය.",
        "teams": "ශ්‍රී ලංකාව, සිංහල ක්‍රීඩා සමාජය,වෝර්සෙස්ටර්ෂයර්,මුම්බායි ඉන්දියන්ස් ",
        "career_info": "ප්‍රනාන්දු 2000 ජූනි මාසයේදී පාකිස්තානයට එරෙහිව කොළඹදී පැවති ටෙස්ට් තරගයකදී ශ්‍රී ලංකාව වෙනුවෙන් ක්‍රීඩා කළේය. මාස හයකට පසු ඩර්බන්හිදී පැවති තරඟයකදී ඔහු පැයට සැතපුම් 91.9 වේගයක් ලබා ගත්තේය. ඔහු ඉන්දියාවේදී බංග්ලාදේශයට එරෙහිව පැයට සැතපුම් 93.40 ට පන්දු යැවීය. කෙසේ වෙතත් ඔහුගේ ජාත්‍යන්තර ක්‍රිකට් දිවිය ආබාධ හේතුවෙන් සීමා වී ඇත. වසරක කාලයකදී ඔහුගේ පිටේ ආතතියෙන් අස්ථි බිඳීම් දෙකකට මුහුණ පෑමට සිදු වූ අතර එහි ප්‍රතිඵලයක් වශයෙන් 2004 දී ඕස්ට්‍රේලියාවට එරෙහිව ඔවුන්ගේ මව්බිමේ තරඟාවලිය අහිමි විය.2010 ඕස්ට්‍රේලියානු සංචාරයේදී, ගබ්බා හි පැවති 3 වන සහ අවසාන එක්දින තරඟයේදී ඔහු පැයට කිලෝමීටර් 150 (පැයට සැතපුම් 93) දක්වා වේගයෙන් ගමන් කළේය."
    },
    {
        "name": "නුවන් කුලසේකර",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 184 ලකුණු 1327, විස්සයි විස්ස තරග 58 ලකුණු 215 , ටෙස්ට් තරග 21 ලකුණු 391, IPL තරග 6 ලකුණු 5",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 184 කඩුලු 199, විස්සයි විස්ස  58 තරග කඩුලු 66, ටෙස්ට් තරග 21 කඩුලු 48,IPL තරග 6 කඩුලු 5",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1982 ජූලි 22 උපත ලැබීය,කුලසේකර මුදියන්සේලාගේ දිනේෂ් නුවන් කුලසේකර යනු හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර ඔහු ලෝක ක්‍රිකට් ක්‍රීඩාවේ හොඳම දඟ පන්දු යවන්නන්ගෙන් කෙනෙකු ලෙස සැලකේ, 2009 මාර්තු 11 වන දින එක්දින පන්දු යවන්නන්ගේ ශ්‍රේණිගත කිරීම් වල අංක එකේ සිටි කුලසේකර එම වසරේ සැප්තැම්බර් 26 දක්වා රැඳී සිටියේය. එම ජයග්‍රහණය ලබා ගත් එකම ශ්‍රී ලාංකිකයා ඔහු වේ. ඔහු අධ්‍යාපනය ලැබුවේ ගම්පහ බණ්ඩාරනායක විද්‍යාලයේ ය.ඔහු 2014 අයිසීසී ලෝක විස්සයි 20 ජයග්‍රහණය කළ කණ්ඩායමේ ප්‍රධාන සාමාජිකයෙකු වූ අතර 2007 ක්‍රිකට් ලෝක කුසලානය, 2011 ක්‍රිකට් ලෝක කුසලානය, 2009 අයිසීසී ලෝක විස්සයි විස්ස සහ 2012 අයිසීසී ලෝක විස්සයි 20 තරගාවලියේ අවසන් මහා තරගයට සුදුසුකම් ලැබූ කණ්ඩායමේ සාමාජිකයෙකි. 2016 ජුනි මාසයේදී කුලසේකර සීමිත ඕවර ක්‍රිකට් ක්‍රීඩා කිරීම සඳහා ටෙස්ට් ක්‍රිකට් ක්‍රීඩාවෙන් විශ්‍රාම ගත්තේය. 2019 ජූලි මාසයේදී ඔහු ජාත්‍යන්තර ක්‍රිකට් පිටියෙන් විශ්‍රාම ගන්නා බව නිවේදනය කළේය. 2019 ජූලි 31 දින ශ්‍රී ලංකාව සහ බංග්ලාදේශය අතර පැවති තුන්වන එක්දින තරගය කුලසේකරට කැප විය.",
        "teams": "ශ්‍රී ලංකාව, ගාල්ල ක්‍රිකට් සමාජය,කෝල්ට්ස් ක්‍රිකට් සමාජය,චෙන්නායි සුපර් කිංග්ස්,කොමිලා වික්ටෝරියානු,ලාහෝර් කලන්දර්ස්",
        "career_info": "2003 නොවැම්බර් 18 දින දඹුල්ලේදී එංගලන්තයට එරෙහිව කුලසේකර සිය එක්දින ජාත්‍යන්තර තරඟය ආරම්භ කළේය. ඔහු ලකුණු 2-19 ක් ලබා ගත් අතර එංගලන්තය ලකුණු 88 කට දැවී ගිය අතර ශ්‍රී ලංකාව ඕවර 14 කටත් අඩු කාලයක් ගත කරමින් තරගය කඩුලු 10 කින් ජයග්‍රහණය කළේය. කුලසේකර සිය ටෙස්ට් ක්‍රිකට් දිවිය ආරම්භ කළේ 2005 අප්‍රේල් 4 දින නවසීලන්තයට එරෙහිව නවසීලන්තයේ නැපියර් හිදී ශ්‍රී ලංකාවේ 100 වන ටෙස්ට් ක්‍රිකට් තරගය ලෙස ය. කුලසේකර සිය පන්දුවාර 20 යි 20 ජාත්‍යන්තර තරඟය ආරම්භ කළේ 2008 ඔක්තෝබර් 11 දින පකිස්ථානයට එරෙහිව ය. පාකිස්තානය කඩුලු 3 කින් ජයග්‍රහණය කළත් ඔහු පන්දුවාර 3.5 කදී ලකුණු 36 ක් ලබා ගත්තේය"
    },
    {
        "name": "රංගන හේරත්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 71 ලකුණු 140, විස්සයි විස්ස තරග 17 ලකුණු 8 , ටෙස්ට් තරග 93 ලකුණු 1699",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 71 කඩුලු 74, විස්සයි විස්ස  17 තරග කඩුලු 18, ටෙස්ට් තරග 93 කඩුලු 433",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1978 වර්ෂයේ මාර්තු මස 19 දින කුරුණෑගල දී උපත ලද හේරත් මුදියන්සේලාගේ රංගනාත කීර්ති බණ්ඩාර හේරත් ශ්‍රී ලංකාව වෙනුවෙන් ටෙස්ට් වරම් ලබාගත්තේ 1999 වර්ෂයේ සැප්තැම්බර් මස 22 දින ගාල්ල ජාත්‍යන්තර ක්‍රීඩාංගනයේදී ඕස්ට්‍රේලියා කණ්ඩායමට එරෙහිවය. ඔහු එක්දින වරම් දිනාගත්තේ 2004 වසරේ අප්‍රේල් මස 25 දින හරාරේ හීදී සිම්බාබ්වේ කණ්ඩායමට එරෙහිවය.",
        "teams": "ශ්‍රී ලංකාව, කුරුණෑගල යෞවන ක්‍රිකට් සමාජය,මුවර්ස් ක්‍රීඩා සමාජය,හැම්ප්ෂයර්,ටැමිල් යූනියන් ක්‍රිකට් සහ මලල ක්‍රීඩා සමාජය,බස්නාහිර ක්‍රිකට් ඩුණ්ඩේ",
        "career_info": "1999 දී ඕස්ට්‍රේලියාවට එරෙහිව ශ්‍රී ලංකාවේ ගාල්ල ජාත්‍යන්තර ක්‍රීඩාංගණයේදී හේරත් සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය. ඔහුගේ එක්දින ජාත්‍යන්තර ක්‍රිකට් තරගය වසර 5 කට පසු 2004 දී සිම්බාබ්වේ කණ්ඩායමට එරෙහිව හරාරේ ක්‍රීඩා සමාජයේදී ආරම්භ විය. 2016 එංගලන්ත ක්‍රිකට් තරඟාවලියේදී, 2012 වසරේදී ලැයිස්තුවේ දෙවන ස්ථානයේ සිටි හේරත් ලොව 13 වන ටෙස්ට් පන්දු යවන්නා ලෙස ශ්‍රේණිගත විය.1999 දී හේරත් සිය මංගල ටෙස්ට් තරගය ආරම්භ කළද මුරලිදරන් විශ්‍රාම ගන්නා තුරු ඔහු කිසි දිනෙක ප්‍රමුඛ දඟ පන්දු යවන්නෙකු ලෙස ප්‍රසිද්ධියට පැමිණියේ නැත. 2009 දී පාකිස්තානයට එරෙහිව ටෙස්ට් ක්‍රිකට් පිටියට නැවත පැමිණි හේරත් මුරලිදරන්ගෙන් ශ්‍රී ලංකාවේ ප්‍රධාන දඟ පන්දු යවන්නාගේ වගකීම භාර ගත්තේය. "
    },
    {
        "name": "උපුල් තරංග",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 235 ලකුණු 6951, විස්සයි විස්ස තරග 125 ලකුණු 3384 , ටෙස්ට් තරග 31 ලකුණු 1754",
        "wickets": "",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "1985 පෙබරවාරි 2 වන දින උපත ලද තාරංග උපත ලැබුවේ බලපිටිය මහ රෝහලේ ය. පොදුවේ උපුල් තරංගලෙස හඳුන්වන වරුෂවිතාන උපුල් තරංග වෘත්තීමය ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙක් වන අතර හිටපු සීමිත ඕවර් කැප්ටන් ක්‍රීඩාවේ සියලුම ආකෘතීන් සඳහා ක්‍රීඩා කරයි. ඔහු වමත් ආරම්භක පිතිකරුවෙකු වන අතර ඉඳහිට කඩුලු රකින්නෙකි . ",
        "teams": "ශ්‍රී ලංකාව, සිංගා ක්‍රීඩා සමාජය,රුහුණ,කඳුරට මැරූන්,සිල්හෙට් සික්සර්ස්,ඩකා ඩයිනමයිට්ස්,ලලිත්පූර් දේශප්‍රේමීන්,දඹුල්ල වයිකිං",
        "career_info": "2006 එංගලන්ත සංචාරයේදී උපුල් තරංග විශේෂයෙන් දියුණු වීමට පටන් ගත්තේය, විශේෂයෙන් එක්දින තරඟයේදී, ශ්‍රී ලංකාව 5-0 ලෙස සත්කාරක ක්‍රීඩකයින්ට වයිට් වොෂ් දී ලකුණු 300 ඉක්මවා ගියේය. ඊට අමතරව, තරංග මෙම මාලාවේ අවසාන තරඟයේදී සනත් ජයසූරිය සමඟ වාර්තාගත පළමු කඩුලු සබඳතාවයට සහභාගී වීම සඳහා ද ප්‍රසිද්ධය. ඔහු පන්දු 102 කදී ලකුණු 109 ක් ලබා ගත් අතර පළමු වරට එංගලන්තයේදී එංගලන්තයට එරෙහිව වයිට් වොෂ් සම්පූර්ණ කිරීමේ දී තීරණාත්මක කාර්යභාරයක් ඉටු කළේය."
    },
    {
        "name": "අජන්ත මෙන්ඩිස්",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 65 ලකුණු 111, විස්සයි විස්ස තරග 39 ලකුණු 8 , ටෙස්ට් තරග 17 ලකුණු 164",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 65 කඩුලු 152, විස්සයි විස්ස  39 තරග කඩුලු 66, ටෙස්ට් තරග 17 කඩුලු 70",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "බලාපුවඩුගේ අජන්තා වින්ස්ලෝ මෙන්ඩිස් (උපත මොරටුවෙහිදී, 1985 මාර්තු 11 දිනදී) යනු ශ්‍රීලාංකීක ජාතික ක්‍රිකට් කණ්ඩායමට ක්‍රීඩා කරන ක්‍රිකට් ක්‍රීඩකයෙකි. දකුණු-අත් ලැසි-මද වේග පන්දු යවන්නෙකු ලෙස වර්ගීකරණයට ලක් වුවද, අජන්තා මෙන්ඩිස් යනු ගුග්ලි, පිට-බිඳුම් (ඕෆ් බ්‍රේක්), උඩු-දඟ (ටොප් ස්පින්), ලැසි-ඉපිලුම් (ෆ්ලිපර්ස්) සහ පා-බිඳුම් (ලෙග් බ්‍රේක්) යන පන්දු යැවීම් ශෛලීන් මිශ්‍රණයක් උපයෝගී කරගන්නා දඟ පන්දු යවන්නෙකි. ඔහු සතුව ඇති පන්දු එවීමේ ශෛලීන් සමුදාය හමුවේ පිතිකරුවන් වික්ෂිප්තව අන්දමන්දව ඔහුගේ නිත්‍ය පන්දු එවීම කුමක්දැයි තෝරාබේරා ගැනුමට නොහැකිව අවිනිශ්චිතව ලතැවුනු අවස්ථා එමටය. ",
        "teams": "ශ්‍රී ලංකාව, ශ්‍රී ලංකා යුද හමුදාව,සමර්සෙට්,කොල්කටා නයිට් රයිඩර්ස්,නගෙනහිරා නාගස්,පූනේ වොරියර්ස්",
        "career_info": "2007-08 ප්‍රිමියර් ලීගයේ කඩුලු 54 ක් දවා ගැනීමේ සාමාන්‍යයෙන් දස පන්දු යැවීමේදී වැඩිම කඩුලු ලාභියා බවට පත්වීමෙන් පසු මෙන්ඩිස් බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහි තරඟාවලිය සඳහා වූ එක්දින සංචිතයට කැඳවා තිබුණි. ඔහු සිය එක්දින ජාත්‍යන්තරය (එක්දින) ආරම්භ කළේ 2008 අප්‍රේල් 10 දින බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහි පළමු එක්දින තරඟයේදී ය. ඔහු මෙම තරඟයේදී ඕවර 10 කදී ලකුණු 39 කට කඩුලු 3 ක් දවා ජාත්‍යන්තර වේදිකාවට පැමිණෙන බව නිවේදනය කළ අතර ඔහුගේ ක්‍රියාවෙහි වෙනසක් නොපෙනෙන ලෙස බටහිර ඉන්දීය පිතිකරුවන්ගේ විවිධ වෙනස්කම් ගැන ගොළු විය. රොබ් ස්ටීන් මෙම මූලික දස්කම් වල බලපෑම සාරාංශගත කළේ මම දැන් දඟ පන්දු යැවීමේ අනාගතය දුටුවෙමි ඔහුගේ නම අජන්තා මෙන්ඩිස් යනුවෙන් සඳහන් කරමිනි. කෙසේ වෙතත්, බටහිර ඉන්දීය කොදෙව් කණ්ඩායම එක් කඩුල්ලකින් තරගය ජයග්‍රහණය කළේය. දෙවන එක්දින තරගයේදී ඔහු ලකුණු 21 කට කඩුලු නොමැති ඕවර 4 ක් යැවූ අතර බටහිර ඉන්දීය කොදෙව් කණ්ඩායම තරඟය ජයග්‍රහණය කර තරගාවලිය 2-0 ක් ලෙස මුද්‍රා තැබීය. 2008 ආසියානු කුසලාන තරගාවලියේදී මෙන්ඩිස් තරඟ ජයග්‍රාහී පන්දු යැවීමේ දක්ෂතාවය පෙන්නුම් කළ අතර එමඟින් ඔහු තරග  මාලාවේ ක්‍රීඩකයා ද දිනා ගැනීමට සමත් විය. 2008 ජුනි 29 දින පකිස්ථානයට එරෙහිව ඔහු 47 ට 4 කඩුලු 4 ක් ලබා ගත් අතර එම තරඟයෙන් ශ්‍රී ලංකාව ලකුණු 64 කින් ජයග්‍රහණය කළේය. [16] 2009 ජූලි 6 වන දින ඉන්දියාවට එරෙහිව පැවති ආසියානු කුසලාන අවසන් මහා තරඟයේදී මෙන්ඩිස් තරඟය ජයග්‍රහණය කරමින් විස්මිත ලකුණු 13 කට කඩුලු 6 ක් ලබා දුන්නේය. ශ්‍රී ලංකාව සිය සිව්වන ආසියානු කුසලානය ලකුණු 100 කින් ජයග්‍රහණය කළේය. "
    },
    {
        "name": "ඇන්ජෙලෝ මැතිව්ස් ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 156 ලකුණු 3783, ටෙස්ට් තරග 46 ලකුණු 3193",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 156 කඩුලු 97,  ටෙස්ට් තරග 46 කඩුලු 23",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "ඇන්ජෙලෝ ඩේවිස් මැතිව්ස්( උපත 2 ජුනි 1987) ශ්‍රීලංකා ක්‍රිකට් වංසකථාව තුළ බිහිවූ තවත් අනගිබනීය නායකයෙකි.වර්තමාන ශ්‍රීලංකා ක්‍රිකට් කණ්ඩායමේ එක්දින සහ ජාත්‍යන්තර නායකත්වය හොබවන අතර වෘත්තිය ක්‍රිකට් ක්‍රීඩකයකු වශයෙන් කටයුතු කරයි. ",
        "teams": "ශ්‍රී ලංකාව, කොල්කටා නයිට් රයිඩර්ස්,ඉන්දියාවේ පූනේ වොරියර්ස්,නගෙනහිරා නාගස්,දිල්ලි ඩෙයාර් ඩෙවිල්ස්",
        "career_info": "අව්‍යාජ තුන් ඉරියව් ක්‍රීඩකයෙකු වීමේ අභිලාෂයෙන් මැතිව්ස් 2008 අග භාගයේ සිය ජාත්‍යන්තර ක්‍රිකට් දිවිය ආරම්භ කළ නමුත් එතැන් සිට ඔහුගේ පිතිකරණයට ප්‍රමුඛතාවය ලබා දී ඇත (ඔහුගේ වැඩ බර අඩු කර ගැනීමට හා තුවාල වලින් වැළකීමට) ටෙස්ට් පිටියේ විශේෂඥ පිතිකරුවෙකු ලෙස ක්‍රීඩා කළේය. කෙසේ වෙතත්, කණ්ඩායමේ සමබරතාවය සඳහා ඔහු තවමත් සීමිත ඕවර ක්‍රිකට් වල පිතිකරණ තුන් ඉරියව් ක්‍රීඩකයෙකු ලෙස ක්‍රීඩා කරයි. ප්‍රයෝජනයට වඩා වැඩියෙන් ප්‍රහාරක වේගය 84.06 ක් වන අතර එමඟින් ඔහු ශ්‍රී ලංකා ඉනිමේ අවසන් ඕවර වලදී හානිකර අපේක්ෂාවක් බවට පත් විය. 2008 නොවැම්බරයේදී සිම්බාබ්වේට එරෙහිව පැවති එක්දින ජාත්‍යන්තර තරඟයකදී ඔහු සිය ජාත්‍යන්තර මංගල දර්ශනය ආරම්භ කළ අතර 2009 ජූලි මාසයේදී ගාල්ලේදී පාකිස්තානයට එරෙහිව ඔහුගේ මංගල ටෙස්ට් තරගය ආරම්භ කළේය."
    },
    {
        "name": "ලහිරු තිරිමාන්න",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ 127 ලකුණු 3194, ටෙස්ට් තරග 42 ලකුණු 2063",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ 127 කඩුලු 3,  ටෙස්ට් තරග 42 කඩුලු 0",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "හෙට්ටිගේ දොන් රුමේෂ් ලහිරු තිරිමාන්න  ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායමේ සිටින ආරම්භක වමත් පිතිකරුවෙකු හා දකුණත් මඳ වේග පන්දු යවන්නෙකු වේ. බණ්ඩාරවෙල ශාන්ත තෝමස් විද්‍යාලයෙන් මූලික අධ්‍යාපනය හදාරා එම විද්‍යාලයේ 11න් පහල ක්‍රිකට් කණ්ඩායමට පළමු වරට තරඟ කරන ලදී. පසුව මොරටුව වේල්ස් කුමර විද්‍යාලයට ඇතුලත්වී එහිදී වයස 13න් පහල, 15න් පහල, 17න් පහල සහ පාසල් කණ්ඩායමේ ක්‍රීඩකයෙකු වශයෙන් ක්‍රීඩා කරන ලදී. 2007 වර්ෂයේදී වයස 19න් පහල ශ්‍රී ලංකා ජාතික ක්‍රිකට් කණ්ඩායමට තෝරා ගැනීමෙන් පසුව 2007/08 වයස 19න් පහල ක්‍රිකට් ලෝක කුසලාන කණ්ඩායමට [1] තෝරාගන්නා ලදී.",
        "teams": "ශ්‍රී ලංකාව, රාගම,බස්නාහිර දකුණ",
        "career_info": "ඔහු 2010 මුල් භාගයේදී ඔහුගේ එක්දින ජාත්‍යන්තර (එක්දින) මංගල දර්ශනය ආරම්භ කළේය.  ඔහු 2011 ජූනි මාසයේදී රෝස් බෝල් හිදී එංගලන්තයට එරෙහිව ඔහුගේ පළමු ටෙස්ට් තරඟය ආරම්භ කළේය, තුවාල ලැබූ තිලකරත්න ඩිල්ෂාන් වෙනුවෙන් කණ්ඩායමට පැමිණියේය. ඔහුගේ පළමු ටෙස්ට් ඉනිමේදී ඔහු ලකුණු 10 කට දැවී ගියේ ජේම්ස් ඇන්ඩර්සන්ගේ පන්දු යැවීමට හසුවී ය. තිරිමාන්න ඕස්ට්‍රේලියාවට එරෙහිව ඇඩිලේඩ් ඕවල් ක්‍රීඩාංගණයේදී 2012-13 පොදුරාජ්‍ය මණ්ඩලයීය බැංකු තරගාවලියේ දෙවන එක්දින තරඟයේදී සිය පළමු එක්දින ශතකය වාර්තා කළේය. එය ඔහුගේ පළමු A ලැයිස්තු ශතකය ද වේ."
    },
    {
        "name": "ඉෂාරා අමරසිංහ",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ  8 ලකුණු  6, ටෙස්ට් තරග 1 ලකුණු 0",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ  8 කඩුලු 9 ,  ටෙස්ට් තරග 1 කඩුලු 1",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "මෙරෙනා කෝරලගේ දොන් ඉෂාරා අමරසිංහ (උපත 1978 මාර්තු 5) නොහොත් ඉෂාරා අමරසිංහ යනු කොළඹ නාලන්දා විද්‍යාලයට ඇතුළත් වූ ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩිකාවකි. දක්ෂිනාංශික වේගපන්දු යවන ක්‍රීඩකයෙකු වන අමරසිංහ 2007 ලෝක කුසලානය සඳහා 30 දෙනෙකුගෙන් සමන්විත පළාත් සංචිතයට ඇතුළත් විය. සමරසිංහ 108 වන ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් නායකයා වන අතර එහිදී ඔහු බටහිර ඉන්දීය කොදෙව් කණ්ඩායමට එරෙහිව 2007/08 බටහිර ඉන්දීය කොදෙව් හිදී ක්‍රීඩා කළේය.",
        "teams": "ශ්‍රී ලංකාව, බර්ගර් විනෝද සමාජය,කෝල්ට්ස් ක්‍රිකට් සමාජය,නොන්ඩි ක්‍රිකට් සමාජය,කෝල්ට්ස් ක්‍රිකට් සමාජය,ගාල්ල ක්‍රිකට් සමාජය,කෝල්ට්ස් ක්‍රිකට් සමාජය",
        "career_info": "ඔහු ලසිත් මාලිංගට පිටුපසින් ලංකාවේ දෙවන වේගවත්ම පන්දු යවන්නා විය හැකිය. කැරිබියන් දූපතට නොපැමිණියත් ඔහු පකිස්ථානයට එරෙහිව අබුඩාබි හිදී පැවති ලෝක කුසලාන තරඟාවලියෙන් පසු පැවති ශ්‍රී ලංකා සංචිතයට තෝරා ගන්නා ලදී. මෙම තරඟාවලියේ පළමු තරඟයේදී ඔහු සිය එක්දින ජාත්‍යන්තර තරඟය ආරම්භ කළ නමුත් කඩුල්ලක් ලබා ගැනීමට නොහැකි විය. කෙසේ වෙතත්, ඔහු 2008 සීබී ශ්‍රේණියේදී සැලකිය යුතු ප්‍රගතියක් ලබා ඇති අතර එහිදී කඩුලු 8 බැගින් දවා ගනිමින් 35.75 බැගින් ලබා ගත්තේය."
    },
    {
        "name": "දිමුත් කරුණාරත්න",
        "gender": "පුරුෂ",
        "runs": "එක් දින ජාත්‍යන්තර තරඟ  34 ලකුණු  767, ටෙස්ට් තරග 72 ලකුණු 5176",
        "wickets": "එක් දින ජාත්‍යන්තර තරඟ  34 කඩුලු 0 ,  ටෙස්ට් තරග 72 කඩුලු 2",
        "ball_rank": "",
        "bat_rank": "",
        "bio": "දිමුත් කරුණාරත්න ලෙස ප්‍රචලිත ෆ්‍රෑන්ක් දිමුත් මධුශංක කරුණාරත්න (උපත 1988 අප්‍රේල් 21), ශ්‍රී ලංකාවේ වෘත්තීය ක්‍රිකට් ක්‍රීඩකයෙකු මෙන්ම වර්තමාන ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් කණ්ඩායමේ නායකයෙකි. ඔහු ටෙස්ට් හා එක්දින තරඟ දෙකෙන්ම රට නියෝජනය කරන වමත් දකුණත් පන්දු විශේෂඥයෙකු වන අතර හිටපු එක්දින නායකයෙක්ද වේ. ඔහු සිංහල ක්‍රීඩා සමාජය වෙනුවෙන් පළමු පන්තියේ ක්‍රිකට් ක්‍රීඩා කරයි. කරුණාරත්න යනු ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් ආරම්භක පිතිකරු ය.",
        "teams": "ශ්‍රී ලංකාව, සිංහල ක්‍රීඩා සමාජය,බස්නාහිර උතුර,වයඹ",
        "career_info": "2012 අග භාගයේදී නවසීලන්තයට එරෙහිව පැවති ටෙස්ට් ක්‍රිකට් තරගාවලිය සඳහා වූ ටෙස්ට් සංචිතයට ඔහුව නැවත කැඳවනු ලැබීය. ඔහු එම තරග මාලාවේ පළමු ටෙස්ට් තරඟය ගාල්ලේදී ආරම්භ කළේ පළමු ඉනිමේදී න් සඳහා  බිංදුවෙන් දැවී යාම පමණි. කෙසේ වෙතත්, ඔහු නොදැවී අර්ධ ශතකයක් ලබා ගනිමින් 2 වන ඉනිමේදී දැඩි ලෙස ආපසු පැමිණ ජයග්‍රාහී ලකුණු ද වාර්තා කළේය. නවසීලන්ත තරගාවලියෙන් පසුව ඔහුව ඕස්ට්‍රේලියාවේ ටෙස්ට් තරග තුනකින් සමන්විත ටෙස්ට් තරගාවලියකට කැඳවා තිබුණි. එම තරගමාලාවේ පළමු ටෙස්ට් තරග දෙකේදී ඔහු ඕස්ට්‍රේලියානු වේග ප්‍රහාරයට එරෙහිව අරගල කළ නිසා බලපෑමක් කිරීමට නොහැකි විය. සිඩ්නි හි පැවති තරඟාවලියේ අවසන් ටෙස්ට් තරඟයේදී දෙවන ඉනිමේදී ඔහුගේ වැඩිම ටෙස්ට් ලකුණු 85 ලබා ගැනීමට ඔහු සමත් වුනා."
    }
]